TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Mon Dec 10 17:47:29 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/LaunchPad/CC13X0_LAUNCHXL.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\sensor_c
      13                            .bound  ".TI.bound:flashBuf", 106496, 0
      14                            .noinit ".TI.bound:flashBuf"

    3034                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3035                            .dwattr $C$DW$193, DW_AT_decl_line(0x5ed)
    3036                            .dwattr $C$DW$193, DW_AT_decl_column(0x05)
    3037                    
    3038                    $C$DW$194       .dwtag  DW_TAG_enumerator
    3039                            .dwattr $C$DW$194, DW_AT_name("RF_AllowDelayAny")
    3040                            .dwattr $C$DW$194, DW_AT_const_value(-1)
    3041                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3042                            .dwattr $C$DW$194, DW_AT_decl_line(0x5ee)
    3043                            .dwattr $C$DW$194, DW_AT_decl_column(0x05)
    3044                    
    3045                            .dwattr $C$DW$T$1042, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3046                            .dwattr $C$DW$T$1042, DW_AT_decl_line(0x5ec)
    3047                            .dwattr $C$DW$T$1042, DW_AT_decl_column(0x0e)
    3048                            .dwendtag $C$DW$T$1042
    3049                    
    3050                    $C$DW$T$1043    .dwtag  DW_TAG_typedef
    3051                            .dwattr $C$DW$T$1043, DW_AT_name("RF_AllowDelay")
    3052                            .dwattr $C$DW$T$1043, DW_AT_type(*$C$DW$T$1042)
    3053                            .dwattr $C$DW$T$1043, DW_AT_language(DW_LANG_C)
    3054                            .dwattr $C$DW$T$1043, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3055                            .dwattr $C$DW$T$1043, DW_AT_decl_line(0x5ef)
    3056                            .dwattr $C$DW$T$1043, DW_AT_decl_column(0x03)
    3057                    
    3058                    
    3059                    $C$DW$T$1044    .dwtag  DW_TAG_enumeration_type
    3060                            .dwattr $C$DW$T$1044, DW_AT_byte_size(0x01)
    3061                    $C$DW$195       .dwtag  DW_TAG_enumerator
    3062                            .dwattr $C$DW$195, DW_AT_name("RF_RatChannelAny")
    3063                            .dwattr $C$DW$195, DW_AT_const_value(-1)
    3064                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3065                            .dwattr $C$DW$195, DW_AT_decl_line(0x60f)
    3066                            .dwattr $C$DW$195, DW_AT_decl_column(0x05)
    3067                    
    3068                    $C$DW$196       .dwtag  DW_TAG_enumerator
    3069                            .dwattr $C$DW$196, DW_AT_name("RF_RatChannel0")
    3070                            .dwattr $C$DW$196, DW_AT_const_value(0x00)
    3071                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3072                            .dwattr $C$DW$196, DW_AT_decl_line(0x610)
    3073                            .dwattr $C$DW$196, DW_AT_decl_column(0x05)
    3074                    
    3075                    $C$DW$197       .dwtag  DW_TAG_enumerator
    3076                            .dwattr $C$DW$197, DW_AT_name("RF_RatChannel1")
    3077                            .dwattr $C$DW$197, DW_AT_const_value(0x01)
    3078                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3079                            .dwattr $C$DW$197, DW_AT_decl_line(0x611)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   57

    3080                            .dwattr $C$DW$197, DW_AT_decl_column(0x05)
    3081                    
    3082                    $C$DW$198       .dwtag  DW_TAG_enumerator
    3083                            .dwattr $C$DW$198, DW_AT_name("RF_RatChannel2")
    3084                            .dwattr $C$DW$198, DW_AT_const_value(0x02)
    3085                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3086                            .dwattr $C$DW$198, DW_AT_decl_line(0x612)
    3087                            .dwattr $C$DW$198, DW_AT_decl_column(0x05)
    3088                    
    3089                            .dwattr $C$DW$T$1044, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3090                            .dwattr $C$DW$T$1044, DW_AT_decl_line(0x60e)
    3091                            .dwattr $C$DW$T$1044, DW_AT_decl_column(0x0e)
    3092                            .dwendtag $C$DW$T$1044
    3093                    
    3094                    $C$DW$T$1045    .dwtag  DW_TAG_typedef
    3095                            .dwattr $C$DW$T$1045, DW_AT_name("RF_RatSelectChannel")
    3096                            .dwattr $C$DW$T$1045, DW_AT_type(*$C$DW$T$1044)
    3097                            .dwattr $C$DW$T$1045, DW_AT_language(DW_LANG_C)
    3098                            .dwattr $C$DW$T$1045, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/driver
    3099                            .dwattr $C$DW$T$1045, DW_AT_decl_line(0x613)
    3100                            .dwattr $C$DW$T$1045, DW_AT_decl_column(0x03)
    3101                    
    3102                    
    3103                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3104                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    3105                    $C$DW$199       .dwtag  DW_TAG_member
    3106                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3107                            .dwattr $C$DW$199, DW_AT_name("rfMode")
    3108                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("rfMode")
    3109                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3110                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3111                            .dwattr $C$DW$199, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3112                            .dwattr $C$DW$199, DW_AT_decl_line(0x421)
    3113                            .dwattr $C$DW$199, DW_AT_decl_column(0x0d)
    3114                    
    3115                    $C$DW$200       .dwtag  DW_TAG_member
    3116                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    3117                            .dwattr $C$DW$200, DW_AT_name("cpePatchFxn")
    3118                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("cpePatchFxn")
    3119                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3120                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3121                            .dwattr $C$DW$200, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3122                            .dwattr $C$DW$200, DW_AT_decl_line(0x422)
    3123                            .dwattr $C$DW$200, DW_AT_decl_column(0x0c)
    3124                    
    3125                    $C$DW$201       .dwtag  DW_TAG_member
    3126                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    3127                            .dwattr $C$DW$201, DW_AT_name("mcePatchFxn")
    3128                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("mcePatchFxn")
    3129                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3130                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3131                            .dwattr $C$DW$201, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3132                            .dwattr $C$DW$201, DW_AT_decl_line(0x423)
    3133                            .dwattr $C$DW$201, DW_AT_decl_column(0x0c)
    3134                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   58

    3135                    $C$DW$202       .dwtag  DW_TAG_member
    3136                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    3137                            .dwattr $C$DW$202, DW_AT_name("rfePatchFxn")
    3138                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("rfePatchFxn")
    3139                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3140                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3141                            .dwattr $C$DW$202, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    3142                            .dwattr $C$DW$202, DW_AT_decl_line(0x424)
    3143                            .dwattr $C$DW$202, DW_AT_decl_column(0x0c)
    3144                    
    3145                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    3146                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x420)
    3147                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3148                            .dwendtag $C$DW$T$22
    3149                    
    3150                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    3151                            .dwattr $C$DW$T$44, DW_AT_name("RF_Mode")
    3152                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$22)
    3153                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3154                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    3155                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x425)
    3156                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    3157                    
    3158                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    3159                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3160                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    3161                    
    3162                    
    3163                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3164                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    3165                    $C$DW$203       .dwtag  DW_TAG_member
    3166                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3167                            .dwattr $C$DW$203, DW_AT_name("triggerType")
    3168                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("triggerType")
    3169                            .dwattr $C$DW$203, DW_AT_bit_offset(0x04)
    3170                            .dwattr $C$DW$203, DW_AT_bit_size(0x04)
    3171                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3172                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3173                            .dwattr $C$DW$203, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3174                            .dwattr $C$DW$203, DW_AT_decl_line(0x7d)
    3175                            .dwattr $C$DW$203, DW_AT_decl_column(0x0f)
    3176                    
    3177                    $C$DW$204       .dwtag  DW_TAG_member
    3178                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3179                            .dwattr $C$DW$204, DW_AT_name("bEnaCmd")
    3180                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("bEnaCmd")
    3181                            .dwattr $C$DW$204, DW_AT_bit_offset(0x03)
    3182                            .dwattr $C$DW$204, DW_AT_bit_size(0x01)
    3183                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3184                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3185                            .dwattr $C$DW$204, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3186                            .dwattr $C$DW$204, DW_AT_decl_line(0x7e)
    3187                            .dwattr $C$DW$204, DW_AT_decl_column(0x0f)
    3188                    
    3189                    $C$DW$205       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   59

    3190                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3191                            .dwattr $C$DW$205, DW_AT_name("triggerNo")
    3192                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("triggerNo")
    3193                            .dwattr $C$DW$205, DW_AT_bit_offset(0x01)
    3194                            .dwattr $C$DW$205, DW_AT_bit_size(0x02)
    3195                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3196                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3197                            .dwattr $C$DW$205, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3198                            .dwattr $C$DW$205, DW_AT_decl_line(0x80)
    3199                            .dwattr $C$DW$205, DW_AT_decl_column(0x0f)
    3200                    
    3201                    $C$DW$206       .dwtag  DW_TAG_member
    3202                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3203                            .dwattr $C$DW$206, DW_AT_name("pastTrig")
    3204                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("pastTrig")
    3205                            .dwattr $C$DW$206, DW_AT_bit_offset(0x00)
    3206                            .dwattr $C$DW$206, DW_AT_bit_size(0x01)
    3207                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3208                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3209                            .dwattr $C$DW$206, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3210                            .dwattr $C$DW$206, DW_AT_decl_line(0x81)
    3211                            .dwattr $C$DW$206, DW_AT_decl_column(0x0f)
    3212                    
    3213                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3214                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x7c)
    3215                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0b)
    3216                            .dwendtag $C$DW$T$23
    3217                    
    3218                    
    3219                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3220                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    3221                    $C$DW$207       .dwtag  DW_TAG_member
    3222                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3223                            .dwattr $C$DW$207, DW_AT_name("rule")
    3224                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("rule")
    3225                            .dwattr $C$DW$207, DW_AT_bit_offset(0x04)
    3226                            .dwattr $C$DW$207, DW_AT_bit_size(0x04)
    3227                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3228                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3229                            .dwattr $C$DW$207, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3230                            .dwattr $C$DW$207, DW_AT_decl_line(0x85)
    3231                            .dwattr $C$DW$207, DW_AT_decl_column(0x0f)
    3232                    
    3233                    $C$DW$208       .dwtag  DW_TAG_member
    3234                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3235                            .dwattr $C$DW$208, DW_AT_name("nSkip")
    3236                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("nSkip")
    3237                            .dwattr $C$DW$208, DW_AT_bit_offset(0x00)
    3238                            .dwattr $C$DW$208, DW_AT_bit_size(0x04)
    3239                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3240                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3241                            .dwattr $C$DW$208, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3242                            .dwattr $C$DW$208, DW_AT_decl_line(0x86)
    3243                            .dwattr $C$DW$208, DW_AT_decl_column(0x0f)
    3244                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   60

    3245                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3246                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x84)
    3247                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x0b)
    3248                            .dwendtag $C$DW$T$24
    3249                    
    3250                    
    3251                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3252                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    3253                    $C$DW$209       .dwtag  DW_TAG_member
    3254                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3255                            .dwattr $C$DW$209, DW_AT_name("triggerType")
    3256                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("triggerType")
    3257                            .dwattr $C$DW$209, DW_AT_bit_offset(0x04)
    3258                            .dwattr $C$DW$209, DW_AT_bit_size(0x04)
    3259                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3260                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3261                            .dwattr $C$DW$209, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3262                            .dwattr $C$DW$209, DW_AT_decl_line(0xb3)
    3263                            .dwattr $C$DW$209, DW_AT_decl_column(0x0f)
    3264                    
    3265                    $C$DW$210       .dwtag  DW_TAG_member
    3266                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3267                            .dwattr $C$DW$210, DW_AT_name("bEnaCmd")
    3268                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("bEnaCmd")
    3269                            .dwattr $C$DW$210, DW_AT_bit_offset(0x03)
    3270                            .dwattr $C$DW$210, DW_AT_bit_size(0x01)
    3271                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3272                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3273                            .dwattr $C$DW$210, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3274                            .dwattr $C$DW$210, DW_AT_decl_line(0xb4)
    3275                            .dwattr $C$DW$210, DW_AT_decl_column(0x0f)
    3276                    
    3277                    $C$DW$211       .dwtag  DW_TAG_member
    3278                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    3279                            .dwattr $C$DW$211, DW_AT_name("triggerNo")
    3280                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("triggerNo")
    3281                            .dwattr $C$DW$211, DW_AT_bit_offset(0x01)
    3282                            .dwattr $C$DW$211, DW_AT_bit_size(0x02)
    3283                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3284                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3285                            .dwattr $C$DW$211, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3286                            .dwattr $C$DW$211, DW_AT_decl_line(0xb6)
    3287                            .dwattr $C$DW$211, DW_AT_decl_column(0x0f)
    3288                    
    3289                    $C$DW$212       .dwtag  DW_TAG_member
    3290                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    3291                            .dwattr $C$DW$212, DW_AT_name("pastTrig")
    3292                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("pastTrig")
    3293                            .dwattr $C$DW$212, DW_AT_bit_offset(0x00)
    3294                            .dwattr $C$DW$212, DW_AT_bit_size(0x01)
    3295                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3296                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3297                            .dwattr $C$DW$212, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3298                            .dwattr $C$DW$212, DW_AT_decl_line(0xb7)
    3299                            .dwattr $C$DW$212, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   61

    3300                    
    3301                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3302                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xb2)
    3303                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x0b)
    3304                            .dwendtag $C$DW$T$25
    3305                    
    3306                    
    3307                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3308                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    3309                    $C$DW$213       .dwtag  DW_TAG_member
    3310                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    3311                            .dwattr $C$DW$213, DW_AT_name("rule")
    3312                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("rule")
    3313                            .dwattr $C$DW$213, DW_AT_bit_offset(0x04)
    3314                            .dwattr $C$DW$213, DW_AT_bit_size(0x04)
    3315                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3316                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3317                            .dwattr $C$DW$213, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3318                            .dwattr $C$DW$213, DW_AT_decl_line(0xbb)
    3319                            .dwattr $C$DW$213, DW_AT_decl_column(0x0f)
    3320                    
    3321                    $C$DW$214       .dwtag  DW_TAG_member
    3322                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3323                            .dwattr $C$DW$214, DW_AT_name("nSkip")
    3324                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("nSkip")
    3325                            .dwattr $C$DW$214, DW_AT_bit_offset(0x00)
    3326                            .dwattr $C$DW$214, DW_AT_bit_size(0x04)
    3327                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3328                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3329                            .dwattr $C$DW$214, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3330                            .dwattr $C$DW$214, DW_AT_decl_line(0xbc)
    3331                            .dwattr $C$DW$214, DW_AT_decl_column(0x0f)
    3332                    
    3333                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3334                            .dwattr $C$DW$T$26, DW_AT_decl_line(0xba)
    3335                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    3336                            .dwendtag $C$DW$T$26
    3337                    
    3338                    
    3339                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3340                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    3341                    $C$DW$215       .dwtag  DW_TAG_member
    3342                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$27)
    3343                            .dwattr $C$DW$215, DW_AT_name("frontEndMode")
    3344                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("frontEndMode")
    3345                            .dwattr $C$DW$215, DW_AT_bit_offset(0x0d)
    3346                            .dwattr $C$DW$215, DW_AT_bit_size(0x03)
    3347                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3348                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3349                            .dwattr $C$DW$215, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3350                            .dwattr $C$DW$215, DW_AT_decl_line(0xc9)
    3351                            .dwattr $C$DW$215, DW_AT_decl_column(0x10)
    3352                    
    3353                    $C$DW$216       .dwtag  DW_TAG_member
    3354                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$27)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   62

    3355                            .dwattr $C$DW$216, DW_AT_name("biasMode")
    3356                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("biasMode")
    3357                            .dwattr $C$DW$216, DW_AT_bit_offset(0x0c)
    3358                            .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    3359                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3360                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3361                            .dwattr $C$DW$216, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3362                            .dwattr $C$DW$216, DW_AT_decl_line(0xcf)
    3363                            .dwattr $C$DW$216, DW_AT_decl_column(0x10)
    3364                    
    3365                    $C$DW$217       .dwtag  DW_TAG_member
    3366                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$27)
    3367                            .dwattr $C$DW$217, DW_AT_name("analogCfgMode")
    3368                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("analogCfgMode")
    3369                            .dwattr $C$DW$217, DW_AT_bit_offset(0x06)
    3370                            .dwattr $C$DW$217, DW_AT_bit_size(0x06)
    3371                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3372                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3373                            .dwattr $C$DW$217, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3374                            .dwattr $C$DW$217, DW_AT_decl_line(0xd1)
    3375                            .dwattr $C$DW$217, DW_AT_decl_column(0x10)
    3376                    
    3377                    $C$DW$218       .dwtag  DW_TAG_member
    3378                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
    3379                            .dwattr $C$DW$218, DW_AT_name("bNoFsPowerUp")
    3380                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3381                            .dwattr $C$DW$218, DW_AT_bit_offset(0x05)
    3382                            .dwattr $C$DW$218, DW_AT_bit_size(0x01)
    3383                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3384                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3385                            .dwattr $C$DW$218, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3386                            .dwattr $C$DW$218, DW_AT_decl_line(0xd8)
    3387                            .dwattr $C$DW$218, DW_AT_decl_column(0x10)
    3388                    
    3389                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3390                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xc8)
    3391                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    3392                            .dwendtag $C$DW$T$28
    3393                    
    3394                    
    3395                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3396                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    3397                    $C$DW$219       .dwtag  DW_TAG_member
    3398                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3399                            .dwattr $C$DW$219, DW_AT_name("triggerType")
    3400                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("triggerType")
    3401                            .dwattr $C$DW$219, DW_AT_bit_offset(0x04)
    3402                            .dwattr $C$DW$219, DW_AT_bit_size(0x04)
    3403                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3404                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3405                            .dwattr $C$DW$219, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3406                            .dwattr $C$DW$219, DW_AT_decl_line(0x1cf)
    3407                            .dwattr $C$DW$219, DW_AT_decl_column(0x0f)
    3408                    
    3409                    $C$DW$220       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   63

    3410                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3411                            .dwattr $C$DW$220, DW_AT_name("bEnaCmd")
    3412                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("bEnaCmd")
    3413                            .dwattr $C$DW$220, DW_AT_bit_offset(0x03)
    3414                            .dwattr $C$DW$220, DW_AT_bit_size(0x01)
    3415                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3416                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3417                            .dwattr $C$DW$220, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3418                            .dwattr $C$DW$220, DW_AT_decl_line(0x1d0)
    3419                            .dwattr $C$DW$220, DW_AT_decl_column(0x0f)
    3420                    
    3421                    $C$DW$221       .dwtag  DW_TAG_member
    3422                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3423                            .dwattr $C$DW$221, DW_AT_name("triggerNo")
    3424                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("triggerNo")
    3425                            .dwattr $C$DW$221, DW_AT_bit_offset(0x01)
    3426                            .dwattr $C$DW$221, DW_AT_bit_size(0x02)
    3427                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3428                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3429                            .dwattr $C$DW$221, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3430                            .dwattr $C$DW$221, DW_AT_decl_line(0x1d2)
    3431                            .dwattr $C$DW$221, DW_AT_decl_column(0x0f)
    3432                    
    3433                    $C$DW$222       .dwtag  DW_TAG_member
    3434                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3435                            .dwattr $C$DW$222, DW_AT_name("pastTrig")
    3436                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("pastTrig")
    3437                            .dwattr $C$DW$222, DW_AT_bit_offset(0x00)
    3438                            .dwattr $C$DW$222, DW_AT_bit_size(0x01)
    3439                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3440                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3441                            .dwattr $C$DW$222, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3442                            .dwattr $C$DW$222, DW_AT_decl_line(0x1d3)
    3443                            .dwattr $C$DW$222, DW_AT_decl_column(0x0f)
    3444                    
    3445                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3446                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x1ce)
    3447                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    3448                            .dwendtag $C$DW$T$29
    3449                    
    3450                    
    3451                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3452                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    3453                    $C$DW$223       .dwtag  DW_TAG_member
    3454                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3455                            .dwattr $C$DW$223, DW_AT_name("rule")
    3456                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("rule")
    3457                            .dwattr $C$DW$223, DW_AT_bit_offset(0x04)
    3458                            .dwattr $C$DW$223, DW_AT_bit_size(0x04)
    3459                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3460                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3461                            .dwattr $C$DW$223, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3462                            .dwattr $C$DW$223, DW_AT_decl_line(0x1d7)
    3463                            .dwattr $C$DW$223, DW_AT_decl_column(0x0f)
    3464                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   64

    3465                    $C$DW$224       .dwtag  DW_TAG_member
    3466                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3467                            .dwattr $C$DW$224, DW_AT_name("nSkip")
    3468                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("nSkip")
    3469                            .dwattr $C$DW$224, DW_AT_bit_offset(0x00)
    3470                            .dwattr $C$DW$224, DW_AT_bit_size(0x04)
    3471                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3472                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3473                            .dwattr $C$DW$224, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3474                            .dwattr $C$DW$224, DW_AT_decl_line(0x1d8)
    3475                            .dwattr $C$DW$224, DW_AT_decl_column(0x0f)
    3476                    
    3477                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3478                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x1d6)
    3479                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
    3480                            .dwendtag $C$DW$T$30
    3481                    
    3482                    
    3483                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3484                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    3485                    $C$DW$225       .dwtag  DW_TAG_member
    3486                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$27)
    3487                            .dwattr $C$DW$225, DW_AT_name("modType")
    3488                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("modType")
    3489                            .dwattr $C$DW$225, DW_AT_bit_offset(0x0d)
    3490                            .dwattr $C$DW$225, DW_AT_bit_size(0x03)
    3491                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3492                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3493                            .dwattr $C$DW$225, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3494                            .dwattr $C$DW$225, DW_AT_decl_line(0x1db)
    3495                            .dwattr $C$DW$225, DW_AT_decl_column(0x10)
    3496                    
    3497                    $C$DW$226       .dwtag  DW_TAG_member
    3498                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    3499                            .dwattr $C$DW$226, DW_AT_name("deviation")
    3500                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("deviation")
    3501                            .dwattr $C$DW$226, DW_AT_bit_offset(0x00)
    3502                            .dwattr $C$DW$226, DW_AT_bit_size(0x0d)
    3503                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3504                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3505                            .dwattr $C$DW$226, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3506                            .dwattr $C$DW$226, DW_AT_decl_line(0x1de)
    3507                            .dwattr $C$DW$226, DW_AT_decl_column(0x10)
    3508                    
    3509                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3510                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x1da)
    3511                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0b)
    3512                            .dwendtag $C$DW$T$31
    3513                    
    3514                    
    3515                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3516                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    3517                    $C$DW$227       .dwtag  DW_TAG_member
    3518                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$32)
    3519                            .dwattr $C$DW$227, DW_AT_name("preScale")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   65

    3520                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("preScale")
    3521                            .dwattr $C$DW$227, DW_AT_bit_offset(0x1c)
    3522                            .dwattr $C$DW$227, DW_AT_bit_size(0x04)
    3523                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3524                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3525                            .dwattr $C$DW$227, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3526                            .dwattr $C$DW$227, DW_AT_decl_line(0x1e1)
    3527                            .dwattr $C$DW$227, DW_AT_decl_column(0x10)
    3528                    
    3529                    $C$DW$228       .dwtag  DW_TAG_member
    3530                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$32)
    3531                            .dwattr $C$DW$228, DW_AT_name("rateWord")
    3532                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("rateWord")
    3533                            .dwattr $C$DW$228, DW_AT_bit_offset(0x03)
    3534                            .dwattr $C$DW$228, DW_AT_bit_size(0x15)
    3535                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3536                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3537                            .dwattr $C$DW$228, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3538                            .dwattr $C$DW$228, DW_AT_decl_line(0x1e3)
    3539                            .dwattr $C$DW$228, DW_AT_decl_column(0x10)
    3540                    
    3541                    $C$DW$229       .dwtag  DW_TAG_member
    3542                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$32)
    3543                            .dwattr $C$DW$229, DW_AT_name("decimMode")
    3544                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("decimMode")
    3545                            .dwattr $C$DW$229, DW_AT_bit_offset(0x00)
    3546                            .dwattr $C$DW$229, DW_AT_bit_size(0x03)
    3547                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3548                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3549                            .dwattr $C$DW$229, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3550                            .dwattr $C$DW$229, DW_AT_decl_line(0x1e4)
    3551                            .dwattr $C$DW$229, DW_AT_decl_column(0x10)
    3552                    
    3553                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3554                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1e0)
    3555                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    3556                            .dwendtag $C$DW$T$33
    3557                    
    3558                    
    3559                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3560                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    3561                    $C$DW$230       .dwtag  DW_TAG_member
    3562                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    3563                            .dwattr $C$DW$230, DW_AT_name("nPreamBytes")
    3564                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("nPreamBytes")
    3565                            .dwattr $C$DW$230, DW_AT_bit_offset(0x02)
    3566                            .dwattr $C$DW$230, DW_AT_bit_size(0x06)
    3567                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3568                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3569                            .dwattr $C$DW$230, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3570                            .dwattr $C$DW$230, DW_AT_decl_line(0x1ec)
    3571                            .dwattr $C$DW$230, DW_AT_decl_column(0x0f)
    3572                    
    3573                    $C$DW$231       .dwtag  DW_TAG_member
    3574                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   66

    3575                            .dwattr $C$DW$231, DW_AT_name("preamMode")
    3576                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("preamMode")
    3577                            .dwattr $C$DW$231, DW_AT_bit_offset(0x00)
    3578                            .dwattr $C$DW$231, DW_AT_bit_size(0x02)
    3579                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3580                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3581                            .dwattr $C$DW$231, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3582                            .dwattr $C$DW$231, DW_AT_decl_line(0x1f2)
    3583                            .dwattr $C$DW$231, DW_AT_decl_column(0x0f)
    3584                    
    3585                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3586                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1eb)
    3587                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    3588                            .dwendtag $C$DW$T$34
    3589                    
    3590                    
    3591                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3592                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    3593                    $C$DW$232       .dwtag  DW_TAG_member
    3594                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$27)
    3595                            .dwattr $C$DW$232, DW_AT_name("nSwBits")
    3596                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("nSwBits")
    3597                            .dwattr $C$DW$232, DW_AT_bit_offset(0x0a)
    3598                            .dwattr $C$DW$232, DW_AT_bit_size(0x06)
    3599                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3600                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3601                            .dwattr $C$DW$232, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3602                            .dwattr $C$DW$232, DW_AT_decl_line(0x1f8)
    3603                            .dwattr $C$DW$232, DW_AT_decl_column(0x10)
    3604                    
    3605                    $C$DW$233       .dwtag  DW_TAG_member
    3606                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$27)
    3607                            .dwattr $C$DW$233, DW_AT_name("bBitReversal")
    3608                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("bBitReversal")
    3609                            .dwattr $C$DW$233, DW_AT_bit_offset(0x09)
    3610                            .dwattr $C$DW$233, DW_AT_bit_size(0x01)
    3611                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3612                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3613                            .dwattr $C$DW$233, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3614                            .dwattr $C$DW$233, DW_AT_decl_line(0x1f9)
    3615                            .dwattr $C$DW$233, DW_AT_decl_column(0x10)
    3616                    
    3617                    $C$DW$234       .dwtag  DW_TAG_member
    3618                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
    3619                            .dwattr $C$DW$234, DW_AT_name("bMsbFirst")
    3620                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("bMsbFirst")
    3621                            .dwattr $C$DW$234, DW_AT_bit_offset(0x08)
    3622                            .dwattr $C$DW$234, DW_AT_bit_size(0x01)
    3623                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3624                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3625                            .dwattr $C$DW$234, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3626                            .dwattr $C$DW$234, DW_AT_decl_line(0x1fb)
    3627                            .dwattr $C$DW$234, DW_AT_decl_column(0x10)
    3628                    
    3629                    $C$DW$235       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   67

    3630                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$27)
    3631                            .dwattr $C$DW$235, DW_AT_name("fecMode")
    3632                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("fecMode")
    3633                            .dwattr $C$DW$235, DW_AT_bit_offset(0x04)
    3634                            .dwattr $C$DW$235, DW_AT_bit_size(0x04)
    3635                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3636                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3637                            .dwattr $C$DW$235, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3638                            .dwattr $C$DW$235, DW_AT_decl_line(0x1fd)
    3639                            .dwattr $C$DW$235, DW_AT_decl_column(0x10)
    3640                    
    3641                    $C$DW$236       .dwtag  DW_TAG_member
    3642                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
    3643                            .dwattr $C$DW$236, DW_AT_name("whitenMode")
    3644                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("whitenMode")
    3645                            .dwattr $C$DW$236, DW_AT_bit_offset(0x00)
    3646                            .dwattr $C$DW$236, DW_AT_bit_size(0x03)
    3647                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3648                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3649                            .dwattr $C$DW$236, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3650                            .dwattr $C$DW$236, DW_AT_decl_line(0x203)
    3651                            .dwattr $C$DW$236, DW_AT_decl_column(0x10)
    3652                    
    3653                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3654                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1f7)
    3655                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    3656                            .dwendtag $C$DW$T$35
    3657                    
    3658                    
    3659                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3660                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    3661                    $C$DW$237       .dwtag  DW_TAG_member
    3662                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$27)
    3663                            .dwattr $C$DW$237, DW_AT_name("frontEndMode")
    3664                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("frontEndMode")
    3665                            .dwattr $C$DW$237, DW_AT_bit_offset(0x0d)
    3666                            .dwattr $C$DW$237, DW_AT_bit_size(0x03)
    3667                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3668                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3669                            .dwattr $C$DW$237, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3670                            .dwattr $C$DW$237, DW_AT_decl_line(0x20d)
    3671                            .dwattr $C$DW$237, DW_AT_decl_column(0x10)
    3672                    
    3673                    $C$DW$238       .dwtag  DW_TAG_member
    3674                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$27)
    3675                            .dwattr $C$DW$238, DW_AT_name("biasMode")
    3676                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("biasMode")
    3677                            .dwattr $C$DW$238, DW_AT_bit_offset(0x0c)
    3678                            .dwattr $C$DW$238, DW_AT_bit_size(0x01)
    3679                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3680                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3681                            .dwattr $C$DW$238, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3682                            .dwattr $C$DW$238, DW_AT_decl_line(0x213)
    3683                            .dwattr $C$DW$238, DW_AT_decl_column(0x10)
    3684                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   68

    3685                    $C$DW$239       .dwtag  DW_TAG_member
    3686                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$27)
    3687                            .dwattr $C$DW$239, DW_AT_name("analogCfgMode")
    3688                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("analogCfgMode")
    3689                            .dwattr $C$DW$239, DW_AT_bit_offset(0x06)
    3690                            .dwattr $C$DW$239, DW_AT_bit_size(0x06)
    3691                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3692                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3693                            .dwattr $C$DW$239, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3694                            .dwattr $C$DW$239, DW_AT_decl_line(0x215)
    3695                            .dwattr $C$DW$239, DW_AT_decl_column(0x10)
    3696                    
    3697                    $C$DW$240       .dwtag  DW_TAG_member
    3698                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$27)
    3699                            .dwattr $C$DW$240, DW_AT_name("bNoFsPowerUp")
    3700                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3701                            .dwattr $C$DW$240, DW_AT_bit_offset(0x05)
    3702                            .dwattr $C$DW$240, DW_AT_bit_size(0x01)
    3703                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3704                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3705                            .dwattr $C$DW$240, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3706                            .dwattr $C$DW$240, DW_AT_decl_line(0x21c)
    3707                            .dwattr $C$DW$240, DW_AT_decl_column(0x10)
    3708                    
    3709                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3710                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x20c)
    3711                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    3712                            .dwendtag $C$DW$T$36
    3713                    
    3714                    
    3715                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3716                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    3717                    $C$DW$241       .dwtag  DW_TAG_member
    3718                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    3719                            .dwattr $C$DW$241, DW_AT_name("triggerType")
    3720                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("triggerType")
    3721                            .dwattr $C$DW$241, DW_AT_bit_offset(0x04)
    3722                            .dwattr $C$DW$241, DW_AT_bit_size(0x04)
    3723                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3724                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3725                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3726                            .dwattr $C$DW$241, DW_AT_decl_line(0x232)
    3727                            .dwattr $C$DW$241, DW_AT_decl_column(0x0f)
    3728                    
    3729                    $C$DW$242       .dwtag  DW_TAG_member
    3730                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    3731                            .dwattr $C$DW$242, DW_AT_name("bEnaCmd")
    3732                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("bEnaCmd")
    3733                            .dwattr $C$DW$242, DW_AT_bit_offset(0x03)
    3734                            .dwattr $C$DW$242, DW_AT_bit_size(0x01)
    3735                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3736                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3737                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3738                            .dwattr $C$DW$242, DW_AT_decl_line(0x233)
    3739                            .dwattr $C$DW$242, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   69

    3740                    
    3741                    $C$DW$243       .dwtag  DW_TAG_member
    3742                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3743                            .dwattr $C$DW$243, DW_AT_name("triggerNo")
    3744                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("triggerNo")
    3745                            .dwattr $C$DW$243, DW_AT_bit_offset(0x01)
    3746                            .dwattr $C$DW$243, DW_AT_bit_size(0x02)
    3747                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3748                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3749                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3750                            .dwattr $C$DW$243, DW_AT_decl_line(0x235)
    3751                            .dwattr $C$DW$243, DW_AT_decl_column(0x0f)
    3752                    
    3753                    $C$DW$244       .dwtag  DW_TAG_member
    3754                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    3755                            .dwattr $C$DW$244, DW_AT_name("pastTrig")
    3756                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("pastTrig")
    3757                            .dwattr $C$DW$244, DW_AT_bit_offset(0x00)
    3758                            .dwattr $C$DW$244, DW_AT_bit_size(0x01)
    3759                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3760                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3761                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3762                            .dwattr $C$DW$244, DW_AT_decl_line(0x236)
    3763                            .dwattr $C$DW$244, DW_AT_decl_column(0x0f)
    3764                    
    3765                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3766                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x231)
    3767                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    3768                            .dwendtag $C$DW$T$37
    3769                    
    3770                    
    3771                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3772                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    3773                    $C$DW$245       .dwtag  DW_TAG_member
    3774                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3775                            .dwattr $C$DW$245, DW_AT_name("rule")
    3776                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("rule")
    3777                            .dwattr $C$DW$245, DW_AT_bit_offset(0x04)
    3778                            .dwattr $C$DW$245, DW_AT_bit_size(0x04)
    3779                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3780                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3781                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3782                            .dwattr $C$DW$245, DW_AT_decl_line(0x23a)
    3783                            .dwattr $C$DW$245, DW_AT_decl_column(0x0f)
    3784                    
    3785                    $C$DW$246       .dwtag  DW_TAG_member
    3786                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    3787                            .dwattr $C$DW$246, DW_AT_name("nSkip")
    3788                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("nSkip")
    3789                            .dwattr $C$DW$246, DW_AT_bit_offset(0x00)
    3790                            .dwattr $C$DW$246, DW_AT_bit_size(0x04)
    3791                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3792                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3793                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3794                            .dwattr $C$DW$246, DW_AT_decl_line(0x23b)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   70

    3795                            .dwattr $C$DW$246, DW_AT_decl_column(0x0f)
    3796                    
    3797                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3798                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x239)
    3799                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    3800                            .dwendtag $C$DW$T$38
    3801                    
    3802                    
    3803                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3804                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    3805                    $C$DW$247       .dwtag  DW_TAG_member
    3806                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    3807                            .dwattr $C$DW$247, DW_AT_name("modType")
    3808                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("modType")
    3809                            .dwattr $C$DW$247, DW_AT_bit_offset(0x0d)
    3810                            .dwattr $C$DW$247, DW_AT_bit_size(0x03)
    3811                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3812                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3813                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3814                            .dwattr $C$DW$247, DW_AT_decl_line(0x23e)
    3815                            .dwattr $C$DW$247, DW_AT_decl_column(0x10)
    3816                    
    3817                    $C$DW$248       .dwtag  DW_TAG_member
    3818                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$27)
    3819                            .dwattr $C$DW$248, DW_AT_name("deviation")
    3820                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("deviation")
    3821                            .dwattr $C$DW$248, DW_AT_bit_offset(0x00)
    3822                            .dwattr $C$DW$248, DW_AT_bit_size(0x0d)
    3823                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3824                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3825                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3826                            .dwattr $C$DW$248, DW_AT_decl_line(0x241)
    3827                            .dwattr $C$DW$248, DW_AT_decl_column(0x10)
    3828                    
    3829                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3830                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x23d)
    3831                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    3832                            .dwendtag $C$DW$T$39
    3833                    
    3834                    
    3835                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3836                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    3837                    $C$DW$249       .dwtag  DW_TAG_member
    3838                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$32)
    3839                            .dwattr $C$DW$249, DW_AT_name("preScale")
    3840                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("preScale")
    3841                            .dwattr $C$DW$249, DW_AT_bit_offset(0x1c)
    3842                            .dwattr $C$DW$249, DW_AT_bit_size(0x04)
    3843                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3844                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3845                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3846                            .dwattr $C$DW$249, DW_AT_decl_line(0x244)
    3847                            .dwattr $C$DW$249, DW_AT_decl_column(0x10)
    3848                    
    3849                    $C$DW$250       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   71

    3850                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$32)
    3851                            .dwattr $C$DW$250, DW_AT_name("rateWord")
    3852                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("rateWord")
    3853                            .dwattr $C$DW$250, DW_AT_bit_offset(0x03)
    3854                            .dwattr $C$DW$250, DW_AT_bit_size(0x15)
    3855                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3856                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3857                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3858                            .dwattr $C$DW$250, DW_AT_decl_line(0x246)
    3859                            .dwattr $C$DW$250, DW_AT_decl_column(0x10)
    3860                    
    3861                    $C$DW$251       .dwtag  DW_TAG_member
    3862                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$32)
    3863                            .dwattr $C$DW$251, DW_AT_name("decimMode")
    3864                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("decimMode")
    3865                            .dwattr $C$DW$251, DW_AT_bit_offset(0x00)
    3866                            .dwattr $C$DW$251, DW_AT_bit_size(0x03)
    3867                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3868                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3869                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3870                            .dwattr $C$DW$251, DW_AT_decl_line(0x247)
    3871                            .dwattr $C$DW$251, DW_AT_decl_column(0x10)
    3872                    
    3873                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3874                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x243)
    3875                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    3876                            .dwendtag $C$DW$T$40
    3877                    
    3878                    
    3879                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3880                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    3881                    $C$DW$252       .dwtag  DW_TAG_member
    3882                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    3883                            .dwattr $C$DW$252, DW_AT_name("nPreamBytes")
    3884                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("nPreamBytes")
    3885                            .dwattr $C$DW$252, DW_AT_bit_offset(0x02)
    3886                            .dwattr $C$DW$252, DW_AT_bit_size(0x06)
    3887                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3888                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3889                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3890                            .dwattr $C$DW$252, DW_AT_decl_line(0x24f)
    3891                            .dwattr $C$DW$252, DW_AT_decl_column(0x0f)
    3892                    
    3893                    $C$DW$253       .dwtag  DW_TAG_member
    3894                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    3895                            .dwattr $C$DW$253, DW_AT_name("preamMode")
    3896                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("preamMode")
    3897                            .dwattr $C$DW$253, DW_AT_bit_offset(0x00)
    3898                            .dwattr $C$DW$253, DW_AT_bit_size(0x02)
    3899                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3900                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3901                            .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3902                            .dwattr $C$DW$253, DW_AT_decl_line(0x255)
    3903                            .dwattr $C$DW$253, DW_AT_decl_column(0x0f)
    3904                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   72

    3905                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3906                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x24e)
    3907                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    3908                            .dwendtag $C$DW$T$41
    3909                    
    3910                    
    3911                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3912                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    3913                    $C$DW$254       .dwtag  DW_TAG_member
    3914                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$27)
    3915                            .dwattr $C$DW$254, DW_AT_name("nSwBits")
    3916                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("nSwBits")
    3917                            .dwattr $C$DW$254, DW_AT_bit_offset(0x0a)
    3918                            .dwattr $C$DW$254, DW_AT_bit_size(0x06)
    3919                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3920                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3921                            .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3922                            .dwattr $C$DW$254, DW_AT_decl_line(0x25b)
    3923                            .dwattr $C$DW$254, DW_AT_decl_column(0x10)
    3924                    
    3925                    $C$DW$255       .dwtag  DW_TAG_member
    3926                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$27)
    3927                            .dwattr $C$DW$255, DW_AT_name("bBitReversal")
    3928                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("bBitReversal")
    3929                            .dwattr $C$DW$255, DW_AT_bit_offset(0x09)
    3930                            .dwattr $C$DW$255, DW_AT_bit_size(0x01)
    3931                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3932                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3933                            .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3934                            .dwattr $C$DW$255, DW_AT_decl_line(0x25c)
    3935                            .dwattr $C$DW$255, DW_AT_decl_column(0x10)
    3936                    
    3937                    $C$DW$256       .dwtag  DW_TAG_member
    3938                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    3939                            .dwattr $C$DW$256, DW_AT_name("bMsbFirst")
    3940                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("bMsbFirst")
    3941                            .dwattr $C$DW$256, DW_AT_bit_offset(0x08)
    3942                            .dwattr $C$DW$256, DW_AT_bit_size(0x01)
    3943                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3944                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3945                            .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3946                            .dwattr $C$DW$256, DW_AT_decl_line(0x25e)
    3947                            .dwattr $C$DW$256, DW_AT_decl_column(0x10)
    3948                    
    3949                    $C$DW$257       .dwtag  DW_TAG_member
    3950                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$27)
    3951                            .dwattr $C$DW$257, DW_AT_name("fecMode")
    3952                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("fecMode")
    3953                            .dwattr $C$DW$257, DW_AT_bit_offset(0x04)
    3954                            .dwattr $C$DW$257, DW_AT_bit_size(0x04)
    3955                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3956                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3957                            .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3958                            .dwattr $C$DW$257, DW_AT_decl_line(0x260)
    3959                            .dwattr $C$DW$257, DW_AT_decl_column(0x10)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   73

    3960                    
    3961                    $C$DW$258       .dwtag  DW_TAG_member
    3962                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$27)
    3963                            .dwattr $C$DW$258, DW_AT_name("whitenMode")
    3964                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("whitenMode")
    3965                            .dwattr $C$DW$258, DW_AT_bit_offset(0x00)
    3966                            .dwattr $C$DW$258, DW_AT_bit_size(0x03)
    3967                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3968                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3969                            .dwattr $C$DW$258, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3970                            .dwattr $C$DW$258, DW_AT_decl_line(0x266)
    3971                            .dwattr $C$DW$258, DW_AT_decl_column(0x10)
    3972                    
    3973                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3974                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x25a)
    3975                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    3976                            .dwendtag $C$DW$T$42
    3977                    
    3978                    
    3979                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3980                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    3981                    $C$DW$259       .dwtag  DW_TAG_member
    3982                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$27)
    3983                            .dwattr $C$DW$259, DW_AT_name("frontEndMode")
    3984                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("frontEndMode")
    3985                            .dwattr $C$DW$259, DW_AT_bit_offset(0x0d)
    3986                            .dwattr $C$DW$259, DW_AT_bit_size(0x03)
    3987                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3988                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3989                            .dwattr $C$DW$259, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3990                            .dwattr $C$DW$259, DW_AT_decl_line(0x270)
    3991                            .dwattr $C$DW$259, DW_AT_decl_column(0x10)
    3992                    
    3993                    $C$DW$260       .dwtag  DW_TAG_member
    3994                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    3995                            .dwattr $C$DW$260, DW_AT_name("biasMode")
    3996                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("biasMode")
    3997                            .dwattr $C$DW$260, DW_AT_bit_offset(0x0c)
    3998                            .dwattr $C$DW$260, DW_AT_bit_size(0x01)
    3999                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4000                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    4001                            .dwattr $C$DW$260, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4002                            .dwattr $C$DW$260, DW_AT_decl_line(0x276)
    4003                            .dwattr $C$DW$260, DW_AT_decl_column(0x10)
    4004                    
    4005                    $C$DW$261       .dwtag  DW_TAG_member
    4006                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
    4007                            .dwattr $C$DW$261, DW_AT_name("analogCfgMode")
    4008                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("analogCfgMode")
    4009                            .dwattr $C$DW$261, DW_AT_bit_offset(0x06)
    4010                            .dwattr $C$DW$261, DW_AT_bit_size(0x06)
    4011                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4012                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    4013                            .dwattr $C$DW$261, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4014                            .dwattr $C$DW$261, DW_AT_decl_line(0x278)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   74

    4015                            .dwattr $C$DW$261, DW_AT_decl_column(0x10)
    4016                    
    4017                    $C$DW$262       .dwtag  DW_TAG_member
    4018                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$27)
    4019                            .dwattr $C$DW$262, DW_AT_name("bNoFsPowerUp")
    4020                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("bNoFsPowerUp")
    4021                            .dwattr $C$DW$262, DW_AT_bit_offset(0x05)
    4022                            .dwattr $C$DW$262, DW_AT_bit_size(0x01)
    4023                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4024                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    4025                            .dwattr $C$DW$262, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4026                            .dwattr $C$DW$262, DW_AT_decl_line(0x27f)
    4027                            .dwattr $C$DW$262, DW_AT_decl_column(0x10)
    4028                    
    4029                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4030                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x26f)
    4031                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    4032                            .dwendtag $C$DW$T$43
    4033                    
    4034                    
    4035                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4036                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x24)
    4037                    $C$DW$263       .dwtag  DW_TAG_member
    4038                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$32)
    4039                            .dwattr $C$DW$263, DW_AT_name("nInactivityTimeout")
    4040                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("nInactivityTimeout")
    4041                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4042                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    4043                            .dwattr $C$DW$263, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4044                            .dwattr $C$DW$263, DW_AT_decl_line(0x515)
    4045                            .dwattr $C$DW$263, DW_AT_decl_column(0x1d)
    4046                    
    4047                    $C$DW$264       .dwtag  DW_TAG_member
    4048                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$45)
    4049                            .dwattr $C$DW$264, DW_AT_name("pRfMode")
    4050                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("pRfMode")
    4051                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4052                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    4053                            .dwattr $C$DW$264, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4054                            .dwattr $C$DW$264, DW_AT_decl_line(0x516)
    4055                            .dwattr $C$DW$264, DW_AT_decl_column(0x1d)
    4056                    
    4057                    $C$DW$265       .dwtag  DW_TAG_member
    4058                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$47)
    4059                            .dwattr $C$DW$265, DW_AT_name("pRadioSetup")
    4060                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("pRadioSetup")
    4061                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4062                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4063                            .dwattr $C$DW$265, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4064                            .dwattr $C$DW$265, DW_AT_decl_line(0x517)
    4065                            .dwattr $C$DW$265, DW_AT_decl_column(0x1d)
    4066                    
    4067                    $C$DW$266       .dwtag  DW_TAG_member
    4068                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$32)
    4069                            .dwattr $C$DW$266, DW_AT_name("nPowerUpDuration")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   75

    4070                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("nPowerUpDuration")
    4071                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4072                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4073                            .dwattr $C$DW$266, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4074                            .dwattr $C$DW$266, DW_AT_decl_line(0x518)
    4075                            .dwattr $C$DW$266, DW_AT_decl_column(0x1d)
    4076                    
    4077                    $C$DW$267       .dwtag  DW_TAG_member
    4078                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$48)
    4079                            .dwattr $C$DW$267, DW_AT_name("bMeasurePowerUpDuration")
    4080                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    4081                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4082                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4083                            .dwattr $C$DW$267, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4084                            .dwattr $C$DW$267, DW_AT_decl_line(0x519)
    4085                            .dwattr $C$DW$267, DW_AT_decl_column(0x1d)
    4086                    
    4087                    $C$DW$268       .dwtag  DW_TAG_member
    4088                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$48)
    4089                            .dwattr $C$DW$268, DW_AT_name("bUpdateSetup")
    4090                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("bUpdateSetup")
    4091                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    4092                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4093                            .dwattr $C$DW$268, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4094                            .dwattr $C$DW$268, DW_AT_decl_line(0x51a)
    4095                            .dwattr $C$DW$268, DW_AT_decl_column(0x1d)
    4096                    
    4097                    $C$DW$269       .dwtag  DW_TAG_member
    4098                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$27)
    4099                            .dwattr $C$DW$269, DW_AT_name("nPowerUpDurationMargin")
    4100                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    4101                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4102                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4103                            .dwattr $C$DW$269, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4104                            .dwattr $C$DW$269, DW_AT_decl_line(0x51b)
    4105                            .dwattr $C$DW$269, DW_AT_decl_column(0x1d)
    4106                    
    4107                    $C$DW$270       .dwtag  DW_TAG_member
    4108                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$3)
    4109                            .dwattr $C$DW$270, DW_AT_name("pPowerCb")
    4110                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("pPowerCb")
    4111                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4112                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4113                            .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4114                            .dwattr $C$DW$270, DW_AT_decl_line(0x51c)
    4115                            .dwattr $C$DW$270, DW_AT_decl_column(0x1d)
    4116                    
    4117                    $C$DW$271       .dwtag  DW_TAG_member
    4118                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$3)
    4119                            .dwattr $C$DW$271, DW_AT_name("pErrCb")
    4120                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("pErrCb")
    4121                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4122                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4123                            .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4124                            .dwattr $C$DW$271, DW_AT_decl_line(0x51d)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   76

    4125                            .dwattr $C$DW$271, DW_AT_decl_column(0x1d)
    4126                    
    4127                    $C$DW$272       .dwtag  DW_TAG_member
    4128                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$3)
    4129                            .dwattr $C$DW$272, DW_AT_name("pClientEventCb")
    4130                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("pClientEventCb")
    4131                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4132                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4133                            .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4134                            .dwattr $C$DW$272, DW_AT_decl_line(0x51e)
    4135                            .dwattr $C$DW$272, DW_AT_decl_column(0x1d)
    4136                    
    4137                    $C$DW$273       .dwtag  DW_TAG_member
    4138                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$49)
    4139                            .dwattr $C$DW$273, DW_AT_name("nClientEventMask")
    4140                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("nClientEventMask")
    4141                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4142                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4143                            .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4144                            .dwattr $C$DW$273, DW_AT_decl_line(0x51f)
    4145                            .dwattr $C$DW$273, DW_AT_decl_column(0x1d)
    4146                    
    4147                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4148                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x514)
    4149                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x0c)
    4150                            .dwendtag $C$DW$T$50
    4151                    
    4152                    
    4153                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4154                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    4155                    $C$DW$274       .dwtag  DW_TAG_member
    4156                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    4157                            .dwattr $C$DW$274, DW_AT_name("triggerType")
    4158                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("triggerType")
    4159                            .dwattr $C$DW$274, DW_AT_bit_offset(0x04)
    4160                            .dwattr $C$DW$274, DW_AT_bit_size(0x04)
    4161                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4162                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4163                            .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4164                            .dwattr $C$DW$274, DW_AT_decl_line(0xee)
    4165                            .dwattr $C$DW$274, DW_AT_decl_column(0x0f)
    4166                    
    4167                    $C$DW$275       .dwtag  DW_TAG_member
    4168                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    4169                            .dwattr $C$DW$275, DW_AT_name("bEnaCmd")
    4170                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("bEnaCmd")
    4171                            .dwattr $C$DW$275, DW_AT_bit_offset(0x03)
    4172                            .dwattr $C$DW$275, DW_AT_bit_size(0x01)
    4173                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4174                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    4175                            .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4176                            .dwattr $C$DW$275, DW_AT_decl_line(0xef)
    4177                            .dwattr $C$DW$275, DW_AT_decl_column(0x0f)
    4178                    
    4179                    $C$DW$276       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:29 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{ED7C9A95-CFE4-493F-A9E3-403708A24123} PAGE   77

    4180                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    4181                            .dwattr $C$DW$276, DW_AT_name("triggerNo")
    4182                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("triggerNo")
    4183                            .dwattr $C$DW$276, DW_AT_bit_offset(0x01)
    4184                            .dwattr $C$DW$276, DW_AT_bit_size(0x02)
    4185                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4186                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4187                            .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4188                            .dwattr $C$DW$276, DW_AT_decl_line(0xf1)
    4189                            .dwattr $C$DW$276, DW_AT_decl_column(0x0f)
    4190                    
    4191                    $C$DW$277       .dwtag  DW_TAG_member
    4192                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    4193                            .dwattr $C$DW$277, DW_AT_name("pastTrig")
    4194                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("pastTrig")
    4195                            .dwattr $C$DW$277, DW_AT_bit_offset(0x00)
    4196                            .dwattr $C$DW$277, DW_AT_bit_size(0x01)
    4197                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4198                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4199                            .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4200                            .dwattr $C$DW$277, DW_AT_decl_line(0xf2)
    4201                            .dwattr $C$DW$277, DW_AT_decl_column(0x0f)
    4202                    
    4203                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4204                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xed)
    4205                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x0b)
    4206                            .dwendtag $C$DW$T$51
    4207                    
    4208                    
    4209                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    4210                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    4211                    $C$DW$278       .dwtag  DW_TAG_member
    4212                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    4213                            .dwattr $C$DW$278, DW_AT_name("rule")
