TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{43F84232-E102-44B5-834C-C34E11CA4B14} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Mon Dec 10 17:47:31 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HAL/target/hal_trng_wrapper.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\sensor_c
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

     280                            .dwpsn  file "../Application/MAC/HAL/target/hal_trng_wrapper.c",line 196,column 5,is_stmt,isa 
     281 0000002c 6008              STRNE     A1, [A2, #0]          ; [DPU_3_PIPE] |196|  ; [ORIG 16-BIT INS]
     282                    $C$DW$15        .dwtag  DW_TAG_TI_branch
     283                            .dwattr $C$DW$15, DW_AT_low_pc(0x00)
     284                            .dwattr $C$DW$15, DW_AT_TI_return
     285                    
     286 0000002e BD08              POP       {A4, PC}              ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
     287                            .dwcfi  cfa_offset, 0
     288                            .dwcfi  restore_reg, 3
     289                            ; BRANCH OCCURS                  ; [] 
     290                            .dwattr $C$DW$11, DW_AT_TI_end_file("../Application/MAC/HAL/target/hal_trng_wrapper.c")
     291                            .dwattr $C$DW$11, DW_AT_TI_end_line(0xca)
     292                            .dwattr $C$DW$11, DW_AT_TI_end_column(0x01)
     293                            .dwendentry
     294                            .dwendtag $C$DW$11
     295                    
     296                    ;******************************************************************************
     297                    ;* CONSTANT TABLE                                                             *
     298                    ;******************************************************************************
     299 0000000a                   .sect   ".text:HalTRNG_WaitForReady"
     300                            .align  4
     301 0000000a 800846C0  ||$C$CON1||:    .bits   1073905672,32
         0000000e 00004002 
     302                    ;******************************************************************************
     303                    ;* CONSTANT TABLE                                                             *
     304                    ;******************************************************************************
     305 0000001c                   .sect   ".text:HalTRNG_InitTRNG"
     306                            .align  4
     307 0000001c 425002A8  ||$C$CON2||:    .bits   1112539816,32
     308                            .align  4
     309 00000020 00000000! ||$C$CON3||:    .bits   lastTrngVal,32
     310                    ;******************************************************************************
     311                    ;* CONSTANT TABLE                                                             *
     312                    ;******************************************************************************
     313 00000030                   .sect   ".text:HalTRNG_GetTRNG"
     314                            .align  4
     315 00000030 40028008  ||$C$CON5||:    .bits   1073905672,32
     316                            .align  4
     317 00000034 100001CC  ||$C$CON6||:    .bits   268435916,32
     318                            .align  4
     319 00000038 DEADBEEF  ||$C$CON8||:    .bits   -559038737,32
     320                            .align  4
     321 0000003c 40028008  ||$C$CON9||:    .bits   1073905672,32
     322                            .align  4
     323 00000040 00000000! ||$C$CON10||:   .bits   lastTrngVal,32
     324                    ;*****************************************************************************
     325                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
     326                    ;*****************************************************************************
     327                            .global NOROM_TRNGConfigure
     328                    
     329                    ;******************************************************************************
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{43F84232-E102-44B5-834C-C34E11CA4B14} PAGE    7

     330                    ;* BUILD ATTRIBUTES                                                           *
     331                    ;******************************************************************************
     332                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     333                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     334                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     335                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     336                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     337                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
     338                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(0)
     339                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     340                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
     341                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     342                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     343                    
     344                    ;******************************************************************************
     345                    ;* TYPE INFORMATION                                                           *
     346                    ;******************************************************************************
     347                    
     348                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
     349                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x4c)
     350                    $C$DW$16        .dwtag  DW_TAG_member
     351                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$24)
     352                            .dwattr $C$DW$16, DW_AT_name("Crc32")
     353                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("Crc32")
     354                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     355                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     356                            .dwattr $C$DW$16, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     357                            .dwattr $C$DW$16, DW_AT_decl_line(0x76)
     358                            .dwattr $C$DW$16, DW_AT_decl_column(0x25)
     359                    
     360                    $C$DW$17        .dwtag  DW_TAG_member
     361                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$27)
     362                            .dwattr $C$DW$17, DW_AT_name("FlashGetSize")
     363                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("FlashGetSize")
     364                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     365                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     366                            .dwattr $C$DW$17, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     367                            .dwattr $C$DW$17, DW_AT_decl_line(0x77)
     368                            .dwattr $C$DW$17, DW_AT_decl_column(0x25)
     369                    
     370                    $C$DW$18        .dwtag  DW_TAG_member
     371                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$28)
     372                            .dwattr $C$DW$18, DW_AT_name("GetChipId")
     373                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("GetChipId")
     374                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     375                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     376                            .dwattr $C$DW$18, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     377                            .dwattr $C$DW$18, DW_AT_decl_line(0x78)
     378                            .dwattr $C$DW$18, DW_AT_decl_column(0x25)
     379                    
     380                    $C$DW$19        .dwtag  DW_TAG_member
     381                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$31)
     382                            .dwattr $C$DW$19, DW_AT_name("ReservedLocation1")
     383                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("ReservedLocation1")
     384                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{43F84232-E102-44B5-834C-C34E11CA4B14} PAGE    8

     385                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     386                            .dwattr $C$DW$19, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     387                            .dwattr $C$DW$19, DW_AT_decl_line(0x79)
     388                            .dwattr $C$DW$19, DW_AT_decl_column(0x25)
     389                    
     390                    $C$DW$20        .dwtag  DW_TAG_member
     391                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$32)
     392                            .dwattr $C$DW$20, DW_AT_name("ReservedLocation2")
     393                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("ReservedLocation2")
     394                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     395                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     396                            .dwattr $C$DW$20, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     397                            .dwattr $C$DW$20, DW_AT_decl_line(0x7a)
     398                            .dwattr $C$DW$20, DW_AT_decl_column(0x25)
     399                    
     400                    $C$DW$21        .dwtag  DW_TAG_member
     401                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$33)
     402                            .dwattr $C$DW$21, DW_AT_name("ReservedLocation3")
     403                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("ReservedLocation3")
     404                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     405                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     406                            .dwattr $C$DW$21, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     407                            .dwattr $C$DW$21, DW_AT_decl_line(0x7b)
     408                            .dwattr $C$DW$21, DW_AT_decl_column(0x25)
     409                    
     410                    $C$DW$22        .dwtag  DW_TAG_member
     411                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$36)
     412                            .dwattr $C$DW$22, DW_AT_name("ResetDevice")
     413                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("ResetDevice")
     414                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     415                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     416                            .dwattr $C$DW$22, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     417                            .dwattr $C$DW$22, DW_AT_decl_line(0x7c)
     418                            .dwattr $C$DW$22, DW_AT_decl_column(0x25)
     419                    
     420                    $C$DW$23        .dwtag  DW_TAG_member
     421                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$41)
     422                            .dwattr $C$DW$23, DW_AT_name("Fletcher32")
     423                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("Fletcher32")
     424                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     425                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     426                            .dwattr $C$DW$23, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     427                            .dwattr $C$DW$23, DW_AT_decl_line(0x7d)
     428                            .dwattr $C$DW$23, DW_AT_decl_column(0x25)
     429                    
     430                    $C$DW$24        .dwtag  DW_TAG_member
     431                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$45)
     432                            .dwattr $C$DW$24, DW_AT_name("MinValue")
     433                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("MinValue")
     434                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     435                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     436                            .dwattr $C$DW$24, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     437                            .dwattr $C$DW$24, DW_AT_decl_line(0x7e)
     438                            .dwattr $C$DW$24, DW_AT_decl_column(0x25)
     439                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{43F84232-E102-44B5-834C-C34E11CA4B14} PAGE    9

     440                    $C$DW$25        .dwtag  DW_TAG_member
     441                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$46)
     442                            .dwattr $C$DW$25, DW_AT_name("MaxValue")
     443                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("MaxValue")
     444                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     445                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     446                            .dwattr $C$DW$25, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     447                            .dwattr $C$DW$25, DW_AT_decl_line(0x7f)
     448                            .dwattr $C$DW$25, DW_AT_decl_column(0x25)
     449                    
     450                    $C$DW$26        .dwtag  DW_TAG_member
     451                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$47)
     452                            .dwattr $C$DW$26, DW_AT_name("MeanValue")
     453                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("MeanValue")
     454                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     455                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     456                            .dwattr $C$DW$26, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     457                            .dwattr $C$DW$26, DW_AT_decl_line(0x80)
     458                            .dwattr $C$DW$26, DW_AT_decl_column(0x25)
     459                    
     460                    $C$DW$27        .dwtag  DW_TAG_member
     461                            .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$48)
     462                            .dwattr $C$DW$27, DW_AT_name("StandDeviationValue")
     463                            .dwattr $C$DW$27, DW_AT_TI_symbol_name("StandDeviationValue")
     464                            .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     465                            .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     466                            .dwattr $C$DW$27, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     467                            .dwattr $C$DW$27, DW_AT_decl_line(0x81)
     468                            .dwattr $C$DW$27, DW_AT_decl_column(0x25)
     469                    
     470                    $C$DW$28        .dwtag  DW_TAG_member
     471                            .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$51)
     472                            .dwattr $C$DW$28, DW_AT_name("ReservedLocation4")
     473                            .dwattr $C$DW$28, DW_AT_TI_symbol_name("ReservedLocation4")
     474                            .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     475                            .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     476                            .dwattr $C$DW$28, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     477                            .dwattr $C$DW$28, DW_AT_decl_line(0x82)
     478                            .dwattr $C$DW$28, DW_AT_decl_column(0x25)
     479                    
     480                    $C$DW$29        .dwtag  DW_TAG_member
     481                            .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$52)
     482                            .dwattr $C$DW$29, DW_AT_name("ReservedLocation5")
     483                            .dwattr $C$DW$29, DW_AT_TI_symbol_name("ReservedLocation5")
     484                            .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     485                            .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     486                            .dwattr $C$DW$29, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     487                            .dwattr $C$DW$29, DW_AT_decl_line(0x83)
     488                            .dwattr $C$DW$29, DW_AT_decl_column(0x25)
     489                    
     490                    $C$DW$30        .dwtag  DW_TAG_member
     491                            .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$53)
     492                            .dwattr $C$DW$30, DW_AT_name("HFSourceSafeSwitch")
     493                            .dwattr $C$DW$30, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
     494                            .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{43F84232-E102-44B5-834C-C34E11CA4B14} PAGE   10

     495                            .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     496                            .dwattr $C$DW$30, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     497                            .dwattr $C$DW$30, DW_AT_decl_line(0x84)
     498                            .dwattr $C$DW$30, DW_AT_decl_column(0x25)
     499                    
     500                    $C$DW$31        .dwtag  DW_TAG_member
     501                            .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$56)
     502                            .dwattr $C$DW$31, DW_AT_name("SelectCompAInput")
     503                            .dwattr $C$DW$31, DW_AT_TI_symbol_name("SelectCompAInput")
     504                            .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     505                            .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     506                            .dwattr $C$DW$31, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     507                            .dwattr $C$DW$31, DW_AT_decl_line(0x85)
     508                            .dwattr $C$DW$31, DW_AT_decl_column(0x25)
     509                    
     510                    $C$DW$32        .dwtag  DW_TAG_member
     511                            .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$57)
     512                            .dwattr $C$DW$32, DW_AT_name("SelectCompARef")
     513                            .dwattr $C$DW$32, DW_AT_TI_symbol_name("SelectCompARef")
     514                            .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     515                            .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     516                            .dwattr $C$DW$32, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     517                            .dwattr $C$DW$32, DW_AT_decl_line(0x86)
     518                            .dwattr $C$DW$32, DW_AT_decl_column(0x25)
     519                    
     520                    $C$DW$33        .dwtag  DW_TAG_member
     521                            .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$58)
     522                            .dwattr $C$DW$33, DW_AT_name("SelectADCCompBInput")
     523                            .dwattr $C$DW$33, DW_AT_TI_symbol_name("SelectADCCompBInput")
     524                            .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     525                            .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     526                            .dwattr $C$DW$33, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     527                            .dwattr $C$DW$33, DW_AT_decl_line(0x87)
     528                            .dwattr $C$DW$33, DW_AT_decl_column(0x25)
     529                    
     530                    $C$DW$34        .dwtag  DW_TAG_member
     531                            .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$59)
     532                            .dwattr $C$DW$34, DW_AT_name("SelectCompBRef")
     533                            .dwattr $C$DW$34, DW_AT_TI_symbol_name("SelectCompBRef")
     534                            .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     535                            .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     536                            .dwattr $C$DW$34, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     537                            .dwattr $C$DW$34, DW_AT_decl_line(0x88)
     538                            .dwattr $C$DW$34, DW_AT_decl_column(0x25)
     539                    
     540                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     541                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x75)
     542                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
     543                            .dwendtag $C$DW$T$60
     544                    
     545                    $C$DW$T$61      .dwtag  DW_TAG_typedef
     546                            .dwattr $C$DW$T$61, DW_AT_name("HARD_API_T")
     547                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
     548                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
     549                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:31 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{43F84232-E102-44B5-834C-C34E11CA4B14} PAGE   11

     550                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x89)
     551                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
     552                    
     553                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     554                            .dwattr $C$DW$T$2, DW_AT_name("void")
     555                    
     556                    
     557                    $C$DW$T$34      .dwtag  DW_TAG_subroutine_type
     558                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     559                            .dwendtag $C$DW$T$34
     560                    
     561                    $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     562                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
     563                            .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
     564                    
     565                    $C$DW$T$53      .dwtag  DW_TAG_typedef
     566                            .dwattr $C$DW$T$53, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
     567                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$35)
     568                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     569                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     570                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x5f)
     571                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x19)
     572                    
     573                    $C$DW$T$36      .dwtag  DW_TAG_typedef
     574                            .dwattr $C$DW$T$36, DW_AT_name("FPTR_RESETDEV_T")
     575                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
     576                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
     577                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     578                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x4d)
     579                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x19)
     580                    
     581                    $C$DW$T$62      .dwtag  DW_TAG_typedef
     582                            .dwattr $C$DW$T$62, DW_AT_name("FPTR_VOID_VOID_T")
     583                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$35)
     584                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
