TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Mon Dec 10 17:47:28 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/ICall/icall_cc2650.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\sensor_c
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1673                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
    1674                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
    1675                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
    1676                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
    1677                    
    1678                    ;******************************************************************************
    1679                    ;* TYPE INFORMATION                                                           *
    1680                    ;******************************************************************************
    1681                    
    1682                    $C$DW$T$152     .dwtag  DW_TAG_enumeration_type
    1683                            .dwattr $C$DW$T$152, DW_AT_byte_size(0x01)
    1684                    $C$DW$113       .dwtag  DW_TAG_enumerator
    1685                            .dwattr $C$DW$113, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    1686                            .dwattr $C$DW$113, DW_AT_const_value(0xe0)
    1687                            .dwattr $C$DW$113, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1688                            .dwattr $C$DW$113, DW_AT_decl_line(0x3de)
    1689                            .dwattr $C$DW$113, DW_AT_decl_column(0x04)
    1690                    
    1691                    $C$DW$114       .dwtag  DW_TAG_enumerator
    1692                            .dwattr $C$DW$114, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    1693                            .dwattr $C$DW$114, DW_AT_const_value(0xe1)
    1694                            .dwattr $C$DW$114, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1695                            .dwattr $C$DW$114, DW_AT_decl_line(0x3e0)
    1696                            .dwattr $C$DW$114, DW_AT_decl_column(0x04)
    1697                    
    1698                    $C$DW$115       .dwtag  DW_TAG_enumerator
    1699                            .dwattr $C$DW$115, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    1700                            .dwattr $C$DW$115, DW_AT_const_value(0xe2)
    1701                            .dwattr $C$DW$115, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1702                            .dwattr $C$DW$115, DW_AT_decl_line(0x3e2)
    1703                            .dwattr $C$DW$115, DW_AT_decl_column(0x04)
    1704                    
    1705                    $C$DW$116       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   32

    1706                            .dwattr $C$DW$116, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    1707                            .dwattr $C$DW$116, DW_AT_const_value(0xe3)
    1708                            .dwattr $C$DW$116, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1709                            .dwattr $C$DW$116, DW_AT_decl_line(0x3e4)
    1710                            .dwattr $C$DW$116, DW_AT_decl_column(0x04)
    1711                    
    1712                    $C$DW$117       .dwtag  DW_TAG_enumerator
    1713                            .dwattr $C$DW$117, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    1714                            .dwattr $C$DW$117, DW_AT_const_value(0xe4)
    1715                            .dwattr $C$DW$117, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1716                            .dwattr $C$DW$117, DW_AT_decl_line(0x3e6)
    1717                            .dwattr $C$DW$117, DW_AT_decl_column(0x04)
    1718                    
    1719                    $C$DW$118       .dwtag  DW_TAG_enumerator
    1720                            .dwattr $C$DW$118, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    1721                            .dwattr $C$DW$118, DW_AT_const_value(0xe5)
    1722                            .dwattr $C$DW$118, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1723                            .dwattr $C$DW$118, DW_AT_decl_line(0x3e8)
    1724                            .dwattr $C$DW$118, DW_AT_decl_column(0x04)
    1725                    
    1726                            .dwattr $C$DW$T$152, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154st
    1727                            .dwattr $C$DW$T$152, DW_AT_decl_line(0x3dc)
    1728                            .dwattr $C$DW$T$152, DW_AT_decl_column(0x01)
    1729                            .dwendtag $C$DW$T$152
    1730                    
    1731                    $C$DW$T$153     .dwtag  DW_TAG_typedef
    1732                            .dwattr $C$DW$T$153, DW_AT_name("ICall_RemotiCmdEvent_t")
    1733                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$152)
    1734                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    1735                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154st
    1736                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x3e9)
    1737                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x02)
    1738                    
    1739                    
    1740                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    1741                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
    1742                    $C$DW$119       .dwtag  DW_TAG_member
    1743                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$10)
    1744                            .dwattr $C$DW$119, DW_AT_name("quot")
    1745                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("quot")
    1746                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1747                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1748                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    1749                            .dwattr $C$DW$119, DW_AT_decl_line(0x5c)
    1750                            .dwattr $C$DW$119, DW_AT_decl_column(0x16)
    1751                    
    1752                    $C$DW$120       .dwtag  DW_TAG_member
    1753                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$10)
    1754                            .dwattr $C$DW$120, DW_AT_name("rem")
    1755                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("rem")
    1756                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1757                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1758                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    1759                            .dwattr $C$DW$120, DW_AT_decl_line(0x5c)
    1760                            .dwattr $C$DW$120, DW_AT_decl_column(0x1c)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   33

    1761                    
    1762                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
    1763                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x5c)
    1764                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    1765                            .dwendtag $C$DW$T$19
    1766                    
    1767                    $C$DW$T$154     .dwtag  DW_TAG_typedef
    1768                            .dwattr $C$DW$T$154, DW_AT_name("div_t")
    1769                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$19)
    1770                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    1771                            .dwattr $C$DW$T$154, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include
    1772                            .dwattr $C$DW$T$154, DW_AT_decl_line(0x5c)
    1773                            .dwattr $C$DW$T$154, DW_AT_decl_column(0x23)
    1774                    
    1775                    
    1776                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1777                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    1778                    $C$DW$121       .dwtag  DW_TAG_member
    1779                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$10)
    1780                            .dwattr $C$DW$121, DW_AT_name("quot")
    1781                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("quot")
    1782                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1783                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1784                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    1785                            .dwattr $C$DW$121, DW_AT_decl_line(0x5e)
    1786                            .dwattr $C$DW$121, DW_AT_decl_column(0x16)
    1787                    
    1788                    $C$DW$122       .dwtag  DW_TAG_member
    1789                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$10)
    1790                            .dwattr $C$DW$122, DW_AT_name("rem")
    1791                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("rem")
    1792                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1793                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1794                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    1795                            .dwattr $C$DW$122, DW_AT_decl_line(0x5e)
    1796                            .dwattr $C$DW$122, DW_AT_decl_column(0x1c)
    1797                    
    1798                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
    1799                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5e)
    1800                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    1801                            .dwendtag $C$DW$T$20
    1802                    
    1803                    $C$DW$T$155     .dwtag  DW_TAG_typedef
    1804                            .dwattr $C$DW$T$155, DW_AT_name("ldiv_t")
    1805                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$20)
    1806                            .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    1807                            .dwattr $C$DW$T$155, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include
    1808                            .dwattr $C$DW$T$155, DW_AT_decl_line(0x5e)
    1809                            .dwattr $C$DW$T$155, DW_AT_decl_column(0x23)
    1810                    
    1811                    
    1812                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1813                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    1814                    $C$DW$123       .dwtag  DW_TAG_member
    1815                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$14)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   34

    1816                            .dwattr $C$DW$123, DW_AT_name("quot")
    1817                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("quot")
    1818                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1819                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1820                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    1821                            .dwattr $C$DW$123, DW_AT_decl_line(0x61)
    1822                            .dwattr $C$DW$123, DW_AT_decl_column(0x1c)
    1823                    
    1824                    $C$DW$124       .dwtag  DW_TAG_member
    1825                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$14)
    1826                            .dwattr $C$DW$124, DW_AT_name("rem")
    1827                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("rem")
    1828                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1829                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1830                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    1831                            .dwattr $C$DW$124, DW_AT_decl_line(0x61)
    1832                            .dwattr $C$DW$124, DW_AT_decl_column(0x22)
    1833                    
    1834                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
    1835                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x61)
    1836                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    1837                            .dwendtag $C$DW$T$21
    1838                    
    1839                    $C$DW$T$156     .dwtag  DW_TAG_typedef
    1840                            .dwattr $C$DW$T$156, DW_AT_name("lldiv_t")
    1841                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$21)
    1842                            .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    1843                            .dwattr $C$DW$T$156, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include
    1844                            .dwattr $C$DW$T$156, DW_AT_decl_line(0x61)
    1845                            .dwattr $C$DW$T$156, DW_AT_decl_column(0x29)
    1846                    
    1847                    
    1848                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1849                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    1850                    $C$DW$125       .dwtag  DW_TAG_member
    1851                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$24)
    1852                            .dwattr $C$DW$125, DW_AT_name("pointerStack")
    1853                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("pointerStack")
    1854                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1855                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1856                            .dwattr $C$DW$125, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1857                            .dwattr $C$DW$125, DW_AT_decl_line(0x3f5)
    1858                            .dwattr $C$DW$125, DW_AT_decl_column(0x16)
    1859                    
    1860                    $C$DW$126       .dwtag  DW_TAG_member
    1861                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$25)
    1862                            .dwattr $C$DW$126, DW_AT_name("directAPI")
    1863                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("directAPI")
    1864                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1865                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1866                            .dwattr $C$DW$126, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1867                            .dwattr $C$DW$126, DW_AT_decl_line(0x3f6)
    1868                            .dwattr $C$DW$126, DW_AT_decl_column(0x15)
    1869                    
    1870                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   35

    1871                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x3f4)
    1872                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
    1873                            .dwendtag $C$DW$T$26
    1874                    
    1875                    $C$DW$T$28      .dwtag  DW_TAG_typedef
    1876                            .dwattr $C$DW$T$28, DW_AT_name("icall_directAPIMsg_t")
    1877                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$26)
    1878                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1879                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1880                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f7)
    1881                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x03)
    1882                    
    1883                    
    1884                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1885                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x14)
    1886                    $C$DW$127       .dwtag  DW_TAG_member
    1887                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$27)
    1888                            .dwattr $C$DW$127, DW_AT_name("hdr")
    1889                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("hdr")
    1890                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1891                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1892                            .dwattr $C$DW$127, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1893                            .dwattr $C$DW$127, DW_AT_decl_line(0x3fb)
    1894                            .dwattr $C$DW$127, DW_AT_decl_column(0x10)
    1895                    
    1896                    $C$DW$128       .dwtag  DW_TAG_member
    1897                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$28)
    1898                            .dwattr $C$DW$128, DW_AT_name("msg")
    1899                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("msg")
    1900                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1901                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1902                            .dwattr $C$DW$128, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1903                            .dwattr $C$DW$128, DW_AT_decl_line(0x3fc)
    1904                            .dwattr $C$DW$128, DW_AT_decl_column(0x1a)
    1905                    
    1906                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1907                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3fa)
    1908                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1909                            .dwendtag $C$DW$T$29
    1910                    
    1911                    $C$DW$T$157     .dwtag  DW_TAG_typedef
    1912                            .dwattr $C$DW$T$157, DW_AT_name("icallLiteMsg_t")
    1913                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$29)
    1914                            .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    1915                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154st
    1916                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x3fd)
    1917                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x03)
    1918                    
    1919                    
    1920                    $C$DW$T$36      .dwtag  DW_TAG_union_type
    1921                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1922                    $C$DW$129       .dwtag  DW_TAG_member
    1923                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$32)
    1924                            .dwattr $C$DW$129, DW_AT_name("entityId")
    1925                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("entityId")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   36

    1926                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1927                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1928                            .dwattr $C$DW$129, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1929                            .dwattr $C$DW$129, DW_AT_decl_line(0x1fe)
    1930                            .dwattr $C$DW$129, DW_AT_decl_column(0x14)
    1931                    
    1932                    $C$DW$130       .dwtag  DW_TAG_member
    1933                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$35)
    1934                            .dwattr $C$DW$130, DW_AT_name("servId")
    1935                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("servId")
    1936                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1937                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1938                            .dwattr $C$DW$130, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1939                            .dwattr $C$DW$130, DW_AT_decl_line(0x200)
    1940                            .dwattr $C$DW$130, DW_AT_decl_column(0x17)
    1941                    
    1942                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1943                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x1fc)
    1944                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    1945                            .dwendtag $C$DW$T$36
    1946                    
    1947                    
    1948                    $C$DW$T$37      .dwtag  DW_TAG_union_type
    1949                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1950                    $C$DW$131       .dwtag  DW_TAG_member
    1951                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$35)
    1952                            .dwattr $C$DW$131, DW_AT_name("servId")
    1953                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("servId")
    1954                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1955                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1956                            .dwattr $C$DW$131, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1957                            .dwattr $C$DW$131, DW_AT_decl_line(0x211)
    1958                            .dwattr $C$DW$131, DW_AT_decl_column(0x17)
    1959                    
    1960                    $C$DW$132       .dwtag  DW_TAG_member
    1961                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$32)
    1962                            .dwattr $C$DW$132, DW_AT_name("entityId")
    1963                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("entityId")
    1964                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1965                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1966                            .dwattr $C$DW$132, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154stac
    1967                            .dwattr $C$DW$132, DW_AT_decl_line(0x213)
    1968                            .dwattr $C$DW$132, DW_AT_decl_column(0x14)
    1969                    
    1970                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\ti154sta
    1971                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x20f)
    1972                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    1973                            .dwendtag $C$DW$T$37
    1974                    
    1975                    
    1976                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1977                            .dwattr $C$DW$T$38, DW_AT_name(".ggroup1")
    1978                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    1979                    $C$DW$133       .dwtag  DW_TAG_member
    1980                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$6)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   37

    1981                            .dwattr $C$DW$133, DW_AT_name("ICallPlatform_pwrActivityCount")
    1982                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("ICallPlatform_pwrActivityCount")
    1983                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1984                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1985                    
    1986                    $C$DW$134       .dwtag  DW_TAG_member
    1987                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    1988                            .dwattr $C$DW$134, DW_AT_name("ICallPlatform_pwrCfgACAction")
    1989                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("ICallPlatform_pwrCfgACAction")
    1990                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1991                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1992                    
    1993                            .dwendtag $C$DW$T$38
    1994                    
    1995                    
    1996                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1997                            .dwattr $C$DW$T$39, DW_AT_name("ClockP_FreqHz")
    1998                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    1999                    $C$DW$135       .dwtag  DW_TAG_member
    2000                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$22)
    2001                            .dwattr $C$DW$135, DW_AT_name("hi")
    2002                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("hi")
    2003                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2004                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2005                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2006                            .dwattr $C$DW$135, DW_AT_decl_line(0x5c)
    2007                            .dwattr $C$DW$135, DW_AT_decl_column(0x0e)
    2008                    
    2009                    $C$DW$136       .dwtag  DW_TAG_member
    2010                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
    2011                            .dwattr $C$DW$136, DW_AT_name("lo")
    2012                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("lo")
    2013                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2014                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2015                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2016                            .dwattr $C$DW$136, DW_AT_decl_line(0x5d)
    2017                            .dwattr $C$DW$136, DW_AT_decl_column(0x0e)
    2018                    
    2019                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2020                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x5b)
    2021                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    2022                            .dwendtag $C$DW$T$39
    2023                    
    2024                    $C$DW$T$159     .dwtag  DW_TAG_typedef
    2025                            .dwattr $C$DW$T$159, DW_AT_name("ClockP_FreqHz")
    2026                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$39)
    2027                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    2028                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2029                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x5e)
    2030                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x03)
    2031                    
    2032                    
    2033                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2034                            .dwattr $C$DW$T$42, DW_AT_name("ClockP_Params")
    2035                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x0c)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   38

    2036                    $C$DW$137       .dwtag  DW_TAG_member
    2037                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$40)
    2038                            .dwattr $C$DW$137, DW_AT_name("startFlag")
    2039                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("startFlag")
    2040                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2041                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2042                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2043                            .dwattr $C$DW$137, DW_AT_decl_line(0x8d)
    2044                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    2045                    
    2046                    $C$DW$138       .dwtag  DW_TAG_member
    2047                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$22)
    2048                            .dwattr $C$DW$138, DW_AT_name("period")
    2049                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("period")
    2050                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2051                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2052                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2053                            .dwattr $C$DW$138, DW_AT_decl_line(0x8e)
    2054                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    2055                    
    2056                    $C$DW$139       .dwtag  DW_TAG_member
    2057                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$41)
    2058                            .dwattr $C$DW$139, DW_AT_name("arg")
    2059                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("arg")
    2060                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2061                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2062                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2063                            .dwattr $C$DW$139, DW_AT_decl_line(0x8f)
    2064                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    2065                    
    2066                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2067                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x8c)
    2068                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    2069                            .dwendtag $C$DW$T$42
    2070                    
    2071                    $C$DW$T$160     .dwtag  DW_TAG_typedef
    2072                            .dwattr $C$DW$T$160, DW_AT_name("ClockP_Params")
    2073                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$42)
    2074                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    2075                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2076                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x90)
    2077                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x03)
    2078                    
    2079                    
    2080                    $C$DW$T$161     .dwtag  DW_TAG_enumeration_type
    2081                            .dwattr $C$DW$T$161, DW_AT_name("ClockP_Status")
    2082                            .dwattr $C$DW$T$161, DW_AT_byte_size(0x01)
    2083                    $C$DW$140       .dwtag  DW_TAG_enumerator
    2084                            .dwattr $C$DW$140, DW_AT_name("ClockP_OK")
    2085                            .dwattr $C$DW$140, DW_AT_const_value(0x00)
    2086                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2087                            .dwattr $C$DW$140, DW_AT_decl_line(0x64)
    2088                            .dwattr $C$DW$140, DW_AT_decl_column(0x05)
    2089                    
    2090                    $C$DW$141       .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   39

    2091                            .dwattr $C$DW$141, DW_AT_name("ClockP_FAILURE")
    2092                            .dwattr $C$DW$141, DW_AT_const_value(-1)
    2093                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2094                            .dwattr $C$DW$141, DW_AT_decl_line(0x65)
    2095                            .dwattr $C$DW$141, DW_AT_decl_column(0x05)
    2096                    
    2097                            .dwattr $C$DW$T$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2098                            .dwattr $C$DW$T$161, DW_AT_decl_line(0x63)
    2099                            .dwattr $C$DW$T$161, DW_AT_decl_column(0x0e)
    2100                            .dwendtag $C$DW$T$161
    2101                    
    2102                    $C$DW$T$162     .dwtag  DW_TAG_typedef
    2103                            .dwattr $C$DW$T$162, DW_AT_name("ClockP_Status")
    2104                            .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$161)
    2105                            .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    2106                            .dwattr $C$DW$T$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2107                            .dwattr $C$DW$T$162, DW_AT_decl_line(0x66)
    2108                            .dwattr $C$DW$T$162, DW_AT_decl_column(0x03)
    2109                    
    2110                    
    2111                    $C$DW$T$45      .dwtag  DW_TAG_union_type
    2112                            .dwattr $C$DW$T$45, DW_AT_name("ClockP_Struct")
    2113                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x24)
    2114                    $C$DW$142       .dwtag  DW_TAG_member
    2115                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$22)
    2116                            .dwattr $C$DW$142, DW_AT_name("dummy")
    2117                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("dummy")
    2118                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2119                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2120                            .dwattr $C$DW$142, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2121                            .dwattr $C$DW$142, DW_AT_decl_line(0x54)
    2122                            .dwattr $C$DW$142, DW_AT_decl_column(0x0e)
    2123                    
    2124                    $C$DW$143       .dwtag  DW_TAG_member
    2125                            .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$44)
    2126                            .dwattr $C$DW$143, DW_AT_name("data")
    2127                            .dwattr $C$DW$143, DW_AT_TI_symbol_name("data")
    2128                            .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2129                            .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2130                            .dwattr $C$DW$143, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2131                            .dwattr $C$DW$143, DW_AT_decl_line(0x55)
    2132                            .dwattr $C$DW$143, DW_AT_decl_column(0x0e)
    2133                    
    2134                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2135                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x53)
    2136                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0f)
    2137                            .dwendtag $C$DW$T$45
    2138                    
    2139                    $C$DW$T$62      .dwtag  DW_TAG_typedef
    2140                            .dwattr $C$DW$T$62, DW_AT_name("ClockP_Struct")
    2141                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$45)
    2142                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    2143                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2144                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x56)
    2145                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x03)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   40

    2146                    
    2147                    
    2148                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2149                            .dwattr $C$DW$T$46, DW_AT_name("HwiP_Params")
    2150                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x0c)
    2151                    $C$DW$144       .dwtag  DW_TAG_member
    2152                            .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$41)
    2153                            .dwattr $C$DW$144, DW_AT_name("arg")
    2154                            .dwattr $C$DW$144, DW_AT_TI_symbol_name("arg")
    2155                            .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2156                            .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2157                            .dwattr $C$DW$144, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2158                            .dwattr $C$DW$144, DW_AT_decl_line(0x72)
    2159                            .dwattr $C$DW$144, DW_AT_decl_column(0x10)
    2160                    
    2161                    $C$DW$145       .dwtag  DW_TAG_member
    2162                            .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
    2163                            .dwattr $C$DW$145, DW_AT_name("priority")
    2164                            .dwattr $C$DW$145, DW_AT_TI_symbol_name("priority")
    2165                            .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2166                            .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2167                            .dwattr $C$DW$145, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2168                            .dwattr $C$DW$145, DW_AT_decl_line(0x73)
    2169                            .dwattr $C$DW$145, DW_AT_decl_column(0x10)
    2170                    
    2171                    $C$DW$146       .dwtag  DW_TAG_member
    2172                            .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$40)
    2173                            .dwattr $C$DW$146, DW_AT_name("enableInt")
    2174                            .dwattr $C$DW$146, DW_AT_TI_symbol_name("enableInt")
    2175                            .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2176                            .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2177                            .dwattr $C$DW$146, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2178                            .dwattr $C$DW$146, DW_AT_decl_line(0x74)
    2179                            .dwattr $C$DW$146, DW_AT_decl_column(0x10)
    2180                    
    2181                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2182                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x71)
    2183                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    2184                            .dwendtag $C$DW$T$46
    2185                    
    2186                    $C$DW$T$163     .dwtag  DW_TAG_typedef
    2187                            .dwattr $C$DW$T$163, DW_AT_name("HwiP_Params")
    2188                            .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$46)
    2189                            .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    2190                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2191                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x75)
    2192                            .dwattr $C$DW$T$163, DW_AT_decl_column(0x03)
    2193                    
    2194                    
    2195                    $C$DW$T$164     .dwtag  DW_TAG_enumeration_type
    2196                            .dwattr $C$DW$T$164, DW_AT_name("HwiP_Status")
    2197                            .dwattr $C$DW$T$164, DW_AT_byte_size(0x01)
    2198                    $C$DW$147       .dwtag  DW_TAG_enumerator
    2199                            .dwattr $C$DW$147, DW_AT_name("HwiP_OK")
    2200                            .dwattr $C$DW$147, DW_AT_const_value(0x00)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   41

    2201                            .dwattr $C$DW$147, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2202                            .dwattr $C$DW$147, DW_AT_decl_line(0x5c)
    2203                            .dwattr $C$DW$147, DW_AT_decl_column(0x05)
    2204                    
    2205                    $C$DW$148       .dwtag  DW_TAG_enumerator
    2206                            .dwattr $C$DW$148, DW_AT_name("HwiP_FAILURE")
    2207                            .dwattr $C$DW$148, DW_AT_const_value(-1)
    2208                            .dwattr $C$DW$148, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2209                            .dwattr $C$DW$148, DW_AT_decl_line(0x5d)
    2210                            .dwattr $C$DW$148, DW_AT_decl_column(0x05)
    2211                    
    2212                            .dwattr $C$DW$T$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2213                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x5b)
    2214                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x0e)
    2215                            .dwendtag $C$DW$T$164
    2216                    
    2217                    $C$DW$T$165     .dwtag  DW_TAG_typedef
    2218                            .dwattr $C$DW$T$165, DW_AT_name("HwiP_Status")
    2219                            .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$164)
    2220                            .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    2221                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2222                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x5e)
    2223                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x03)
    2224                    
    2225                    
    2226                    $C$DW$T$48      .dwtag  DW_TAG_union_type
    2227                            .dwattr $C$DW$T$48, DW_AT_name("HwiP_Struct")
    2228                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x1c)
    2229                    $C$DW$149       .dwtag  DW_TAG_member
    2230                            .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$22)
    2231                            .dwattr $C$DW$149, DW_AT_name("dummy")
    2232                            .dwattr $C$DW$149, DW_AT_TI_symbol_name("dummy")
    2233                            .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2234                            .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2235                            .dwattr $C$DW$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2236                            .dwattr $C$DW$149, DW_AT_decl_line(0x4d)
    2237                            .dwattr $C$DW$149, DW_AT_decl_column(0x0e)
    2238                    
    2239                    $C$DW$150       .dwtag  DW_TAG_member
    2240                            .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$47)
    2241                            .dwattr $C$DW$150, DW_AT_name("data")
    2242                            .dwattr $C$DW$150, DW_AT_TI_symbol_name("data")
    2243                            .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2244                            .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2245                            .dwattr $C$DW$150, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/d
    2246                            .dwattr $C$DW$150, DW_AT_decl_line(0x4e)
    2247                            .dwattr $C$DW$150, DW_AT_decl_column(0x0e)
    2248                    
    2249                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2250                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x4c)
    2251                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x0f)
    2252                            .dwendtag $C$DW$T$48
    2253                    
    2254                    $C$DW$T$63      .dwtag  DW_TAG_typedef
    2255                            .dwattr $C$DW$T$63, DW_AT_name("HwiP_Struct")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   42

    2256                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$48)
    2257                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    2258                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2259                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x4f)
    2260                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
    2261                    
    2262                    
    2263                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2264                            .dwattr $C$DW$T$50, DW_AT_name("List_Elem")
    2265                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    2266                    $C$DW$151       .dwtag  DW_TAG_member
    2267                            .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$49)
    2268                            .dwattr $C$DW$151, DW_AT_name("next")
    2269                            .dwattr $C$DW$151, DW_AT_TI_symbol_name("next")
    2270                            .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2271                            .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2272                            .dwattr $C$DW$151, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2273                            .dwattr $C$DW$151, DW_AT_decl_line(0x7f)
    2274                            .dwattr $C$DW$151, DW_AT_decl_column(0x17)
    2275                    
    2276                    $C$DW$152       .dwtag  DW_TAG_member
    2277                            .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$49)
    2278                            .dwattr $C$DW$152, DW_AT_name("prev")
    2279                            .dwattr $C$DW$152, DW_AT_TI_symbol_name("prev")
    2280                            .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2281                            .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2282                            .dwattr $C$DW$152, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2283                            .dwattr $C$DW$152, DW_AT_decl_line(0x80)
    2284                            .dwattr $C$DW$152, DW_AT_decl_column(0x17)
    2285                    
    2286                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2287                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x7e)
    2288                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    2289                            .dwendtag $C$DW$T$50
    2290                    
    2291                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    2292                            .dwattr $C$DW$T$51, DW_AT_name("List_Elem")
    2293                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2294                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2295                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2296                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x81)
    2297                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    2298                    
    2299                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2300                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2301                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    2302                    
    2303                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    2304                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$50)
    2305                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    2306                    
    2307                    
    2308                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2309                            .dwattr $C$DW$T$53, DW_AT_name("List_List")
    2310                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x08)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   43

    2311                    $C$DW$153       .dwtag  DW_TAG_member
    2312                            .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$52)
    2313                            .dwattr $C$DW$153, DW_AT_name("head")
    2314                            .dwattr $C$DW$153, DW_AT_TI_symbol_name("head")
    2315                            .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2316                            .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2317                            .dwattr $C$DW$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2318                            .dwattr $C$DW$153, DW_AT_decl_line(0x84)
    2319                            .dwattr $C$DW$153, DW_AT_decl_column(0x10)
    2320                    
    2321                    $C$DW$154       .dwtag  DW_TAG_member
    2322                            .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$52)
    2323                            .dwattr $C$DW$154, DW_AT_name("tail")
    2324                            .dwattr $C$DW$154, DW_AT_TI_symbol_name("tail")
    2325                            .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2326                            .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2327                            .dwattr $C$DW$154, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/u
    2328                            .dwattr $C$DW$154, DW_AT_decl_line(0x85)
    2329                            .dwattr $C$DW$154, DW_AT_decl_column(0x10)
    2330                    
    2331                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2332                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x83)
    2333                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x10)
    2334                            .dwendtag $C$DW$T$53
    2335                    
    2336                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    2337                            .dwattr $C$DW$T$61, DW_AT_name("List_List")
    2338                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$53)
    2339                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2340                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2341                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x86)
    2342                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
    2343                    
    2344                    
    2345                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    2346                            .dwattr $C$DW$T$60, DW_AT_name("PowerCC26XX_Config")
    2347                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x18)
    2348                    $C$DW$155       .dwtag  DW_TAG_member
    2349                            .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$56)
    2350                            .dwattr $C$DW$155, DW_AT_name("policyInitFxn")
    2351                            .dwattr $C$DW$155, DW_AT_TI_symbol_name("policyInitFxn")
    2352                            .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2353                            .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2354                            .dwattr $C$DW$155, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2355                            .dwattr $C$DW$155, DW_AT_decl_line(0x150)
    2356                            .dwattr $C$DW$155, DW_AT_decl_column(0x19)
    2357                    
    2358                    $C$DW$156       .dwtag  DW_TAG_member
    2359                            .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$57)
    2360                            .dwattr $C$DW$156, DW_AT_name("policyFxn")
    2361                            .dwattr $C$DW$156, DW_AT_TI_symbol_name("policyFxn")
    2362                            .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2363                            .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2364                            .dwattr $C$DW$156, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2365                            .dwattr $C$DW$156, DW_AT_decl_line(0x166)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   44

    2366                            .dwattr $C$DW$156, DW_AT_decl_column(0x15)
    2367                    
    2368                    $C$DW$157       .dwtag  DW_TAG_member
    2369                            .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$59)
    2370                            .dwattr $C$DW$157, DW_AT_name("calibrateFxn")
    2371                            .dwattr $C$DW$157, DW_AT_TI_symbol_name("calibrateFxn")
    2372                            .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2373                            .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2374                            .dwattr $C$DW$157, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2375                            .dwattr $C$DW$157, DW_AT_decl_line(0x172)
    2376                            .dwattr $C$DW$157, DW_AT_decl_column(0x0c)
    2377                    
    2378                    $C$DW$158       .dwtag  DW_TAG_member
    2379                            .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$22)
    2380                            .dwattr $C$DW$158, DW_AT_name("maxStandbyDuration")
    2381                            .dwattr $C$DW$158, DW_AT_TI_symbol_name("maxStandbyDuration")
    2382                            .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2383                            .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2384                            .dwattr $C$DW$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2385                            .dwattr $C$DW$158, DW_AT_decl_line(0x18d)
    2386                            .dwattr $C$DW$158, DW_AT_decl_column(0x0e)
    2387                    
    2388                    $C$DW$159       .dwtag  DW_TAG_member
    2389                            .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$33)
    2390                            .dwattr $C$DW$159, DW_AT_name("vddrRechargeMargin")
    2391                            .dwattr $C$DW$159, DW_AT_TI_symbol_name("vddrRechargeMargin")
    2392                            .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2393                            .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2394                            .dwattr $C$DW$159, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2395                            .dwattr $C$DW$159, DW_AT_decl_line(0x19e)
    2396                            .dwattr $C$DW$159, DW_AT_decl_column(0x0e)
    2397                    
    2398                    $C$DW$160       .dwtag  DW_TAG_member
    2399                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$40)
    2400                            .dwattr $C$DW$160, DW_AT_name("enableMaxStandbyDuration")
    2401                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("enableMaxStandbyDuration")
    2402                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2403                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2404                            .dwattr $C$DW$160, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2405                            .dwattr $C$DW$160, DW_AT_decl_line(0x1ab)
    2406                            .dwattr $C$DW$160, DW_AT_decl_column(0x0a)
    2407                    
    2408                    $C$DW$161       .dwtag  DW_TAG_member
    2409                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$40)
    2410                            .dwattr $C$DW$161, DW_AT_name("enablePolicy")
    2411                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("enablePolicy")
    2412                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2413                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2414                            .dwattr $C$DW$161, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2415                            .dwattr $C$DW$161, DW_AT_decl_line(0x1b8)
    2416                            .dwattr $C$DW$161, DW_AT_decl_column(0x0a)
    2417                    
    2418                    $C$DW$162       .dwtag  DW_TAG_member
    2419                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$40)
    2420                            .dwattr $C$DW$162, DW_AT_name("calibrateRCOSC_LF")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   45

    2421                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("calibrateRCOSC_LF")
    2422                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2423                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2424                            .dwattr $C$DW$162, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2425                            .dwattr $C$DW$162, DW_AT_decl_line(0x1c1)
    2426                            .dwattr $C$DW$162, DW_AT_decl_column(0x0a)
    2427                    
    2428                    $C$DW$163       .dwtag  DW_TAG_member
    2429                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$40)
    2430                            .dwattr $C$DW$163, DW_AT_name("calibrateRCOSC_HF")
    2431                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("calibrateRCOSC_HF")
    2432                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2433                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2434                            .dwattr $C$DW$163, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2435                            .dwattr $C$DW$163, DW_AT_decl_line(0x1ca)
    2436                            .dwattr $C$DW$163, DW_AT_decl_column(0x0a)
    2437                    
    2438                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2439                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x149)
    2440                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x10)
    2441                            .dwendtag $C$DW$T$60
    2442                    
    2443                    $C$DW$T$166     .dwtag  DW_TAG_typedef
    2444                            .dwattr $C$DW$T$166, DW_AT_name("PowerCC26XX_Config")
    2445                            .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$60)
    2446                            .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    2447                            .dwattr $C$DW$T$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2448                            .dwattr $C$DW$T$166, DW_AT_decl_line(0x1cb)
    2449                            .dwattr $C$DW$T$166, DW_AT_decl_column(0x03)
    2450                    
    2451                    
    2452                    $C$DW$T$70      .dwtag  DW_TAG_structure_type
    2453                            .dwattr $C$DW$T$70, DW_AT_name("PowerCC26XX_ModuleState")
    2454                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x114)
    2455                    $C$DW$164       .dwtag  DW_TAG_member
    2456                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$61)
    2457                            .dwattr $C$DW$164, DW_AT_name("notifyList")
    2458                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("notifyList")
    2459                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2460                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2461                            .dwattr $C$DW$164, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2462                            .dwattr $C$DW$164, DW_AT_decl_line(0x1d4)
    2463                            .dwattr $C$DW$164, DW_AT_decl_column(0x0f)
    2464                    
    2465                    $C$DW$165       .dwtag  DW_TAG_member
    2466                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    2467                            .dwattr $C$DW$165, DW_AT_name("constraintMask")
    2468                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("constraintMask")
    2469                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2470                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2471                            .dwattr $C$DW$165, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2472                            .dwattr $C$DW$165, DW_AT_decl_line(0x1d5)
    2473                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    2474                    
    2475                    $C$DW$166       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   46

    2476                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$62)
    2477                            .dwattr $C$DW$166, DW_AT_name("clockObj")
    2478                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("clockObj")
    2479                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2480                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2481                            .dwattr $C$DW$166, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2482                            .dwattr $C$DW$166, DW_AT_decl_line(0x1d6)
    2483                            .dwattr $C$DW$166, DW_AT_decl_column(0x13)
    2484                    
    2485                    $C$DW$167       .dwtag  DW_TAG_member
    2486                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$62)
    2487                            .dwattr $C$DW$167, DW_AT_name("xoscClockObj")
    2488                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("xoscClockObj")
    2489                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2490                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2491                            .dwattr $C$DW$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2492                            .dwattr $C$DW$167, DW_AT_decl_line(0x1d7)
    2493                            .dwattr $C$DW$167, DW_AT_decl_column(0x13)
    2494                    
    2495                    $C$DW$168       .dwtag  DW_TAG_member
    2496                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$62)
    2497                            .dwattr $C$DW$168, DW_AT_name("lfClockObj")
    2498                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("lfClockObj")
    2499                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2500                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2501                            .dwattr $C$DW$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2502                            .dwattr $C$DW$168, DW_AT_decl_line(0x1d8)
    2503                            .dwattr $C$DW$168, DW_AT_decl_column(0x13)
    2504                    
    2505                    $C$DW$169       .dwtag  DW_TAG_member
    2506                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$62)
    2507                            .dwattr $C$DW$169, DW_AT_name("calClockStruct")
    2508                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("calClockStruct")
    2509                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2510                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2511                            .dwattr $C$DW$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2512                            .dwattr $C$DW$169, DW_AT_decl_line(0x1d9)
    2513                            .dwattr $C$DW$169, DW_AT_decl_column(0x13)
    2514                    
    2515                    $C$DW$170       .dwtag  DW_TAG_member
    2516                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$63)
    2517                            .dwattr $C$DW$170, DW_AT_name("hwiStruct")
    2518                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("hwiStruct")
    2519                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    2520                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2521                            .dwattr $C$DW$170, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2522                            .dwattr $C$DW$170, DW_AT_decl_line(0x1da)
    2523                            .dwattr $C$DW$170, DW_AT_decl_column(0x11)
    2524                    
    2525                    $C$DW$171       .dwtag  DW_TAG_member
    2526                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$64)
    2527                            .dwattr $C$DW$171, DW_AT_name("nDeltaFreqCurr")
    2528                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("nDeltaFreqCurr")
    2529                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    2530                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   47

    2531                            .dwattr $C$DW$171, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2532                            .dwattr $C$DW$171, DW_AT_decl_line(0x1db)
    2533                            .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    2534                    
    2535                    $C$DW$172       .dwtag  DW_TAG_member
    2536                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$64)
    2537                            .dwattr $C$DW$172, DW_AT_name("nCtrimCurr")
    2538                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("nCtrimCurr")
    2539                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    2540                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2541                            .dwattr $C$DW$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2542                            .dwattr $C$DW$172, DW_AT_decl_line(0x1dc)
    2543                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    2544                    
    2545                    $C$DW$173       .dwtag  DW_TAG_member
    2546                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$64)
    2547                            .dwattr $C$DW$173, DW_AT_name("nCtrimFractCurr")
    2548                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("nCtrimFractCurr")
    2549                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    2550                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2551                            .dwattr $C$DW$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2552                            .dwattr $C$DW$173, DW_AT_decl_line(0x1dd)
    2553                            .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    2554                    
    2555                    $C$DW$174       .dwtag  DW_TAG_member
    2556                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$64)
    2557                            .dwattr $C$DW$174, DW_AT_name("nCtrimNew")
    2558                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("nCtrimNew")
    2559                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    2560                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2561                            .dwattr $C$DW$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2562                            .dwattr $C$DW$174, DW_AT_decl_line(0x1de)
    2563                            .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    2564                    
    2565                    $C$DW$175       .dwtag  DW_TAG_member
    2566                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$64)
    2567                            .dwattr $C$DW$175, DW_AT_name("nCtrimFractNew")
    2568                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("nCtrimFractNew")
    2569                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    2570                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2571                            .dwattr $C$DW$175, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2572                            .dwattr $C$DW$175, DW_AT_decl_line(0x1df)
    2573                            .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    2574                    
    2575                    $C$DW$176       .dwtag  DW_TAG_member
    2576                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$64)
    2577                            .dwattr $C$DW$176, DW_AT_name("nRtrimNew")
    2578                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("nRtrimNew")
    2579                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    2580                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2581                            .dwattr $C$DW$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2582                            .dwattr $C$DW$176, DW_AT_decl_line(0x1e0)
    2583                            .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    2584                    
    2585                    $C$DW$177       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   48

    2586                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$64)
    2587                            .dwattr $C$DW$177, DW_AT_name("nRtrimCurr")
    2588                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("nRtrimCurr")
    2589                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    2590                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2591                            .dwattr $C$DW$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2592                            .dwattr $C$DW$177, DW_AT_decl_line(0x1e1)
    2593                            .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
    2594                    
    2595                    $C$DW$178       .dwtag  DW_TAG_member
    2596                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$64)
    2597                            .dwattr $C$DW$178, DW_AT_name("nDeltaFreqNew")
    2598                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("nDeltaFreqNew")
    2599                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    2600                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2601                            .dwattr $C$DW$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2602                            .dwattr $C$DW$178, DW_AT_decl_line(0x1e2)
    2603                            .dwattr $C$DW$178, DW_AT_decl_column(0x0d)
    2604                    
    2605                    $C$DW$179       .dwtag  DW_TAG_member
    2606                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$40)
    2607                            .dwattr $C$DW$179, DW_AT_name("bRefine")
    2608                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("bRefine")
    2609                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    2610                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2611                            .dwattr $C$DW$179, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2612                            .dwattr $C$DW$179, DW_AT_decl_line(0x1e3)
    2613                            .dwattr $C$DW$179, DW_AT_decl_column(0x0a)
    2614                    
    2615                    $C$DW$180       .dwtag  DW_TAG_member
    2616                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
    2617                            .dwattr $C$DW$180, DW_AT_name("state")
    2618                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("state")
    2619                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    2620                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2621                            .dwattr $C$DW$180, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2622                            .dwattr $C$DW$180, DW_AT_decl_line(0x1e4)
    2623                            .dwattr $C$DW$180, DW_AT_decl_column(0x0e)
    2624                    
    2625                    $C$DW$181       .dwtag  DW_TAG_member
    2626                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$40)
    2627                            .dwattr $C$DW$181, DW_AT_name("xoscPending")
    2628                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("xoscPending")
    2629                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    2630                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2631                            .dwattr $C$DW$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2632                            .dwattr $C$DW$181, DW_AT_decl_line(0x1e5)
    2633                            .dwattr $C$DW$181, DW_AT_decl_column(0x0a)
    2634                    
    2635                    $C$DW$182       .dwtag  DW_TAG_member
    2636                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$40)
    2637                            .dwattr $C$DW$182, DW_AT_name("calLF")
    2638                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("calLF")
    2639                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xe1]
    2640                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   49

    2641                            .dwattr $C$DW$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2642                            .dwattr $C$DW$182, DW_AT_decl_line(0x1e6)
    2643                            .dwattr $C$DW$182, DW_AT_decl_column(0x0a)
    2644                    
    2645                    $C$DW$183       .dwtag  DW_TAG_member
    2646                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$30)
    2647                            .dwattr $C$DW$183, DW_AT_name("hwiState")
    2648                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("hwiState")
    2649                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    2650                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2651                            .dwattr $C$DW$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2652                            .dwattr $C$DW$183, DW_AT_decl_line(0x1e7)
    2653                            .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    2654                    
    2655                    $C$DW$184       .dwtag  DW_TAG_member
    2656                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$40)
    2657                            .dwattr $C$DW$184, DW_AT_name("busyCal")
    2658                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("busyCal")
    2659                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xe3]
    2660                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2661                            .dwattr $C$DW$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2662                            .dwattr $C$DW$184, DW_AT_decl_line(0x1e8)
    2663                            .dwattr $C$DW$184, DW_AT_decl_column(0x0a)
    2664                    
    2665                    $C$DW$185       .dwtag  DW_TAG_member
    2666                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$30)
    2667                            .dwattr $C$DW$185, DW_AT_name("calStep")
    2668                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("calStep")
    2669                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    2670                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2671                            .dwattr $C$DW$185, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2672                            .dwattr $C$DW$185, DW_AT_decl_line(0x1e9)
    2673                            .dwattr $C$DW$185, DW_AT_decl_column(0x0d)
    2674                    
    2675                    $C$DW$186       .dwtag  DW_TAG_member
    2676                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$40)
    2677                            .dwattr $C$DW$186, DW_AT_name("firstLF")
    2678                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("firstLF")
    2679                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xe5]
    2680                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2681                            .dwattr $C$DW$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2682                            .dwattr $C$DW$186, DW_AT_decl_line(0x1ea)
    2683                            .dwattr $C$DW$186, DW_AT_decl_column(0x0a)
    2684                    
    2685                    $C$DW$187       .dwtag  DW_TAG_member
    2686                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$40)
    2687                            .dwattr $C$DW$187, DW_AT_name("enablePolicy")
    2688                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("enablePolicy")
    2689                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    2690                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2691                            .dwattr $C$DW$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2692                            .dwattr $C$DW$187, DW_AT_decl_line(0x1eb)
    2693                            .dwattr $C$DW$187, DW_AT_decl_column(0x0a)
    2694                    
    2695                    $C$DW$188       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   50

    2696                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$40)
    2697                            .dwattr $C$DW$188, DW_AT_name("initialized")
    2698                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("initialized")
    2699                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xe7]
    2700                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2701                            .dwattr $C$DW$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2702                            .dwattr $C$DW$188, DW_AT_decl_line(0x1ec)
    2703                            .dwattr $C$DW$188, DW_AT_decl_column(0x0a)
    2704                    
    2705                    $C$DW$189       .dwtag  DW_TAG_member
    2706                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$65)
    2707                            .dwattr $C$DW$189, DW_AT_name("constraintCounts")
    2708                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("constraintCounts")
    2709                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    2710                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2711                            .dwattr $C$DW$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2712                            .dwattr $C$DW$189, DW_AT_decl_line(0x1f0)
    2713                            .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    2714                    
    2715                    $C$DW$190       .dwtag  DW_TAG_member
    2716                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$66)
    2717                            .dwattr $C$DW$190, DW_AT_name("resourceCounts")
    2718                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("resourceCounts")
    2719                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xef]
    2720                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2721                            .dwattr $C$DW$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2722                            .dwattr $C$DW$190, DW_AT_decl_line(0x1f2)
    2723                            .dwattr $C$DW$190, DW_AT_decl_column(0x0d)
    2724                    
    2725                    $C$DW$191       .dwtag  DW_TAG_member
    2726                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$69)
    2727                            .dwattr $C$DW$191, DW_AT_name("resourceHandlers")
    2728                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("resourceHandlers")
    2729                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    2730                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2731                            .dwattr $C$DW$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2732                            .dwattr $C$DW$191, DW_AT_decl_line(0x1f4)
    2733                            .dwattr $C$DW$191, DW_AT_decl_column(0x14)
    2734                    
    2735                    $C$DW$192       .dwtag  DW_TAG_member
    2736                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$57)
    2737                            .dwattr $C$DW$192, DW_AT_name("policyFxn")
    2738                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("policyFxn")
    2739                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
    2740                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2741                            .dwattr $C$DW$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2742                            .dwattr $C$DW$192, DW_AT_decl_line(0x1f6)
    2743                            .dwattr $C$DW$192, DW_AT_decl_column(0x15)
    2744                    
    2745                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2746                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x1d3)
    2747                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
    2748                            .dwendtag $C$DW$T$70
    2749                    
    2750                    $C$DW$T$167     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   51

    2751                            .dwattr $C$DW$T$167, DW_AT_name("PowerCC26XX_ModuleState")
    2752                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$70)
    2753                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    2754                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2755                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x1f7)
    2756                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x03)
    2757                    
    2758                    
    2759                    $C$DW$T$71      .dwtag  DW_TAG_structure_type
    2760                            .dwattr $C$DW$T$71, DW_AT_name("PowerCC26XX_ResourceRecord")
    2761                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    2762                    $C$DW$193       .dwtag  DW_TAG_member
    2763                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$30)
    2764                            .dwattr $C$DW$193, DW_AT_name("flags")
    2765                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("flags")
    2766                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2767                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2768                            .dwattr $C$DW$193, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2769                            .dwattr $C$DW$193, DW_AT_decl_line(0x143)
    2770                            .dwattr $C$DW$193, DW_AT_decl_column(0x0d)
    2771                    
    2772                    $C$DW$194       .dwtag  DW_TAG_member
    2773                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$33)
    2774                            .dwattr $C$DW$194, DW_AT_name("driverlibID")
    2775                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("driverlibID")
    2776                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2777                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2778                            .dwattr $C$DW$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/p
    2779                            .dwattr $C$DW$194, DW_AT_decl_line(0x144)
    2780                            .dwattr $C$DW$194, DW_AT_decl_column(0x0e)
    2781                    
    2782                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2783                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x142)
    2784                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
    2785                            .dwendtag $C$DW$T$71
    2786                    
    2787                    $C$DW$T$168     .dwtag  DW_TAG_typedef
    2788                            .dwattr $C$DW$T$168, DW_AT_name("PowerCC26XX_ResourceRecord")
    2789                            .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$71)
    2790                            .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    2791                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2792                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x145)
    2793                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x03)
    2794                    
    2795                    
    2796                    $C$DW$T$77      .dwtag  DW_TAG_structure_type
    2797                            .dwattr $C$DW$T$77, DW_AT_name("Power_NotifyObj_")
    2798                            .dwattr $C$DW$T$77, DW_AT_byte_size(0x14)
    2799                    $C$DW$195       .dwtag  DW_TAG_member
    2800                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$51)
    2801                            .dwattr $C$DW$195, DW_AT_name("link")
    2802                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("link")
    2803                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2804                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2805                            .dwattr $C$DW$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:28 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{3CC89573-5354-4613-9C4F-DCA246EA3A9B} PAGE   52

    2806                            .dwattr $C$DW$195, DW_AT_decl_line(0x7a)
    2807                            .dwattr $C$DW$195, DW_AT_decl_column(0x0f)
    2808                    
    2809                    $C$DW$196       .dwtag  DW_TAG_member
    2810                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$72)
    2811                            .dwattr $C$DW$196, DW_AT_name("eventTypes")
    2812                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("eventTypes")
    2813                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2814                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2815                            .dwattr $C$DW$196, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    2816                            .dwattr $C$DW$196, DW_AT_decl_line(0x7b)
    2817                            .dwattr $C$DW$196, DW_AT_decl_column(0x13)
    2818                    
    2819                    $C$DW$197       .dwtag  DW_TAG_member
    2820                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$76)
    2821                            .dwattr $C$DW$197, DW_AT_name("notifyFxn")
    2822                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("notifyFxn")
    2823                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2824                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2825                            .dwattr $C$DW$197, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    2826                            .dwattr $C$DW$197, DW_AT_decl_line(0x7c)
    2827                            .dwattr $C$DW$197, DW_AT_decl_column(0x15)
    2828                    
    2829                    $C$DW$198       .dwtag  DW_TAG_member
    2830                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$41)
    2831                            .dwattr $C$DW$198, DW_AT_name("clientArg")
    2832                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("clientArg")
    2833                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2834                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2835                            .dwattr $C$DW$198, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/P
    2836                            .dwattr $C$DW$198, DW_AT_decl_line(0x7d)
    2837                            .dwattr $C$DW$198, DW_AT_decl_column(0x0f)
    2838                    
    2839                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    2840                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x79)
    2841                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x10)
    2842                            .dwendtag $C$DW$T$77
    2843                    
    2844                    $C$DW$T$169     .dwtag  DW_TAG_typedef
    2845                            .dwattr $C$DW$T$169, DW_AT_name("Power_NotifyObj")
    2846                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$77)
    2847                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    2848                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
