TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Mon Dec 10 17:47:32 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/LowLevel/lmac_global.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\sensor_c
      13                            .global macTxSlottedDelay
      14 00000000                   .data

    2844                            .dwattr $C$DW$299, DW_AT_decl_column(0x05)
    2845                    
    2846                    $C$DW$300       .dwtag  DW_TAG_enumerator
    2847                            .dwattr $C$DW$300, DW_AT_name("RF_AllowDelayAny")
    2848                            .dwattr $C$DW$300, DW_AT_const_value(-1)
    2849                            .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2850                            .dwattr $C$DW$300, DW_AT_decl_line(0x5ee)
    2851                            .dwattr $C$DW$300, DW_AT_decl_column(0x05)
    2852                    
    2853                            .dwattr $C$DW$T$898, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2854                            .dwattr $C$DW$T$898, DW_AT_decl_line(0x5ec)
    2855                            .dwattr $C$DW$T$898, DW_AT_decl_column(0x0e)
    2856                            .dwendtag $C$DW$T$898
    2857                    
    2858                    $C$DW$T$899     .dwtag  DW_TAG_typedef
    2859                            .dwattr $C$DW$T$899, DW_AT_name("RF_AllowDelay")
    2860                            .dwattr $C$DW$T$899, DW_AT_type(*$C$DW$T$898)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   53

    2861                            .dwattr $C$DW$T$899, DW_AT_language(DW_LANG_C)
    2862                            .dwattr $C$DW$T$899, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2863                            .dwattr $C$DW$T$899, DW_AT_decl_line(0x5ef)
    2864                            .dwattr $C$DW$T$899, DW_AT_decl_column(0x03)
    2865                    
    2866                    
    2867                    $C$DW$T$900     .dwtag  DW_TAG_enumeration_type
    2868                            .dwattr $C$DW$T$900, DW_AT_byte_size(0x01)
    2869                    $C$DW$301       .dwtag  DW_TAG_enumerator
    2870                            .dwattr $C$DW$301, DW_AT_name("RF_RatChannelAny")
    2871                            .dwattr $C$DW$301, DW_AT_const_value(-1)
    2872                            .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2873                            .dwattr $C$DW$301, DW_AT_decl_line(0x60f)
    2874                            .dwattr $C$DW$301, DW_AT_decl_column(0x05)
    2875                    
    2876                    $C$DW$302       .dwtag  DW_TAG_enumerator
    2877                            .dwattr $C$DW$302, DW_AT_name("RF_RatChannel0")
    2878                            .dwattr $C$DW$302, DW_AT_const_value(0x00)
    2879                            .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2880                            .dwattr $C$DW$302, DW_AT_decl_line(0x610)
    2881                            .dwattr $C$DW$302, DW_AT_decl_column(0x05)
    2882                    
    2883                    $C$DW$303       .dwtag  DW_TAG_enumerator
    2884                            .dwattr $C$DW$303, DW_AT_name("RF_RatChannel1")
    2885                            .dwattr $C$DW$303, DW_AT_const_value(0x01)
    2886                            .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2887                            .dwattr $C$DW$303, DW_AT_decl_line(0x611)
    2888                            .dwattr $C$DW$303, DW_AT_decl_column(0x05)
    2889                    
    2890                    $C$DW$304       .dwtag  DW_TAG_enumerator
    2891                            .dwattr $C$DW$304, DW_AT_name("RF_RatChannel2")
    2892                            .dwattr $C$DW$304, DW_AT_const_value(0x02)
    2893                            .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    2894                            .dwattr $C$DW$304, DW_AT_decl_line(0x612)
    2895                            .dwattr $C$DW$304, DW_AT_decl_column(0x05)
    2896                    
    2897                            .dwattr $C$DW$T$900, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2898                            .dwattr $C$DW$T$900, DW_AT_decl_line(0x60e)
    2899                            .dwattr $C$DW$T$900, DW_AT_decl_column(0x0e)
    2900                            .dwendtag $C$DW$T$900
    2901                    
    2902                    $C$DW$T$901     .dwtag  DW_TAG_typedef
    2903                            .dwattr $C$DW$T$901, DW_AT_name("RF_RatSelectChannel")
    2904                            .dwattr $C$DW$T$901, DW_AT_type(*$C$DW$T$900)
    2905                            .dwattr $C$DW$T$901, DW_AT_language(DW_LANG_C)
    2906                            .dwattr $C$DW$T$901, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
    2907                            .dwattr $C$DW$T$901, DW_AT_decl_line(0x613)
    2908                            .dwattr $C$DW$T$901, DW_AT_decl_column(0x03)
    2909                    
    2910                    
    2911                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2912                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x0a)
    2913                    $C$DW$305       .dwtag  DW_TAG_member
    2914                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$408)
    2915                            .dwattr $C$DW$305, DW_AT_name("addr")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   54

    2916                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("addr")
    2917                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2918                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    2919                            .dwattr $C$DW$305, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2920                            .dwattr $C$DW$305, DW_AT_decl_line(0x55)
    2921                            .dwattr $C$DW$305, DW_AT_decl_column(0x05)
    2922                    
    2923                    $C$DW$306       .dwtag  DW_TAG_member
    2924                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    2925                            .dwattr $C$DW$306, DW_AT_name("addrMode")
    2926                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("addrMode")
    2927                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2928                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    2929                            .dwattr $C$DW$306, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2930                            .dwattr $C$DW$306, DW_AT_decl_line(0x56)
    2931                            .dwattr $C$DW$306, DW_AT_decl_column(0x13)
    2932                    
    2933                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    2934                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x50)
    2935                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
    2936                            .dwendtag $C$DW$T$20
    2937                    
    2938                    $C$DW$T$77      .dwtag  DW_TAG_typedef
    2939                            .dwattr $C$DW$T$77, DW_AT_name("sAddr_t")
    2940                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$20)
    2941                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2942                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    2943                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x57)
    2944                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    2945                    
    2946                    
    2947                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2948                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x08)
    2949                    $C$DW$307       .dwtag  DW_TAG_member
    2950                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$22)
    2951                            .dwattr $C$DW$307, DW_AT_name("p")
    2952                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("p")
    2953                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2954                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    2955                            .dwattr $C$DW$307, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2956                            .dwattr $C$DW$307, DW_AT_decl_line(0x3d)
    2957                            .dwattr $C$DW$307, DW_AT_decl_column(0x0e)
    2958                    
    2959                    $C$DW$308       .dwtag  DW_TAG_member
    2960                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$23)
    2961                            .dwattr $C$DW$308, DW_AT_name("len")
    2962                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("len")
    2963                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2964                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    2965                            .dwattr $C$DW$308, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2966                            .dwattr $C$DW$308, DW_AT_decl_line(0x3e)
    2967                            .dwattr $C$DW$308, DW_AT_decl_column(0x0e)
    2968                    
    2969                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    2970                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x3c)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   55

    2971                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
    2972                            .dwendtag $C$DW$T$24
    2973                    
    2974                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    2975                            .dwattr $C$DW$T$80, DW_AT_name("sData_t")
    2976                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$24)
    2977                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2978                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    2979                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x3f)
    2980                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    2981                    
    2982                    
    2983                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2984                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    2985                    $C$DW$309       .dwtag  DW_TAG_member
    2986                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$410)
    2987                            .dwattr $C$DW$309, DW_AT_name("addr")
    2988                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("addr")
    2989                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2990                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    2991                            .dwattr $C$DW$309, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2992                            .dwattr $C$DW$309, DW_AT_decl_line(0x4db)
    2993                            .dwattr $C$DW$309, DW_AT_decl_column(0x07)
    2994                    
    2995                    $C$DW$310       .dwtag  DW_TAG_member
    2996                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$26)
    2997                            .dwattr $C$DW$310, DW_AT_name("addrMode")
    2998                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("addrMode")
    2999                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3000                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3001                            .dwattr $C$DW$310, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    3002                            .dwattr $C$DW$310, DW_AT_decl_line(0x4de)
    3003                            .dwattr $C$DW$310, DW_AT_decl_column(0x17)
    3004                    
    3005                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    3006                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x4d0)
    3007                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    3008                            .dwendtag $C$DW$T$27
    3009                    
    3010                    $C$DW$T$578     .dwtag  DW_TAG_typedef
    3011                            .dwattr $C$DW$T$578, DW_AT_name("ApiMac_sAddr_t")
    3012                            .dwattr $C$DW$T$578, DW_AT_type(*$C$DW$T$27)
    3013                            .dwattr $C$DW$T$578, DW_AT_language(DW_LANG_C)
    3014                            .dwattr $C$DW$T$578, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appl
    3015                            .dwattr $C$DW$T$578, DW_AT_decl_line(0x4df)
    3016                            .dwattr $C$DW$T$578, DW_AT_decl_column(0x03)
    3017                    
    3018                    
    3019                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3020                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    3021                    $C$DW$311       .dwtag  DW_TAG_member
    3022                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$28)
    3023                            .dwattr $C$DW$311, DW_AT_name("frameCounter")
    3024                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("frameCounter")
    3025                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   56

    3026                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3027                            .dwattr $C$DW$311, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    3028                            .dwattr $C$DW$311, DW_AT_decl_line(0x575)
    3029                            .dwattr $C$DW$311, DW_AT_decl_column(0x1a)
    3030                    
    3031                    $C$DW$312       .dwtag  DW_TAG_member
    3032                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$29)
    3033                            .dwattr $C$DW$312, DW_AT_name("keyIdx")
    3034                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("keyIdx")
    3035                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3036                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3037                            .dwattr $C$DW$312, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    3038                            .dwattr $C$DW$312, DW_AT_decl_line(0x576)
    3039                            .dwattr $C$DW$312, DW_AT_decl_column(0x1a)
    3040                    
    3041                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    3042                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x574)
    3043                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    3044                            .dwendtag $C$DW$T$30
    3045                    
    3046                    $C$DW$T$638     .dwtag  DW_TAG_typedef
    3047                            .dwattr $C$DW$T$638, DW_AT_name("ApiMac_frameCntr_t")
    3048                            .dwattr $C$DW$T$638, DW_AT_type(*$C$DW$T$30)
    3049                            .dwattr $C$DW$T$638, DW_AT_language(DW_LANG_C)
    3050                            .dwattr $C$DW$T$638, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appl
    3051                            .dwattr $C$DW$T$638, DW_AT_decl_line(0x577)
    3052                            .dwattr $C$DW$T$638, DW_AT_decl_column(0x03)
    3053                    
    3054                    $C$DW$T$639     .dwtag  DW_TAG_pointer_type
    3055                            .dwattr $C$DW$T$639, DW_AT_type(*$C$DW$T$638)
    3056                            .dwattr $C$DW$T$639, DW_AT_address_class(0x20)
    3057                    
    3058                    
    3059                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3060                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x40)
    3061                    $C$DW$313       .dwtag  DW_TAG_member
    3062                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$32)
    3063                            .dwattr $C$DW$313, DW_AT_name("beaconType")
    3064                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("beaconType")
    3065                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3066                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3067                            .dwattr $C$DW$313, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    3068                            .dwattr $C$DW$313, DW_AT_decl_line(0x886)
    3069                            .dwattr $C$DW$313, DW_AT_decl_column(0x19)
    3070                    
    3071                    $C$DW$314       .dwtag  DW_TAG_member
    3072                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    3073                            .dwattr $C$DW$314, DW_AT_name("bsn")
    3074                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("bsn")
    3075                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3076                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3077                            .dwattr $C$DW$314, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    3078                            .dwattr $C$DW$314, DW_AT_decl_line(0x888)
    3079                            .dwattr $C$DW$314, DW_AT_decl_column(0x0d)
    3080                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   57

    3081                    $C$DW$315       .dwtag  DW_TAG_member
    3082                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$33)
    3083                            .dwattr $C$DW$315, DW_AT_name("panDesc")
    3084                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("panDesc")
    3085                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3086                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3087                            .dwattr $C$DW$315, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    3088                            .dwattr $C$DW$315, DW_AT_decl_line(0x88a)
    3089                            .dwattr $C$DW$315, DW_AT_decl_column(0x16)
    3090                    
    3091                    $C$DW$316       .dwtag  DW_TAG_member
    3092                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$413)
    3093                            .dwattr $C$DW$316, DW_AT_name("beaconData")
    3094                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("beaconData")
    3095                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3096                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3097                            .dwattr $C$DW$316, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    3098                            .dwattr $C$DW$316, DW_AT_decl_line(0x895)
    3099                            .dwattr $C$DW$316, DW_AT_decl_column(0x07)
    3100                    
    3101                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    3102                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x884)
    3103                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    3104                            .dwendtag $C$DW$T$34
    3105                    
    3106                    $C$DW$T$492     .dwtag  DW_TAG_typedef
    3107                            .dwattr $C$DW$T$492, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    3108                            .dwattr $C$DW$T$492, DW_AT_type(*$C$DW$T$34)
    3109                            .dwattr $C$DW$T$492, DW_AT_language(DW_LANG_C)
    3110                            .dwattr $C$DW$T$492, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appl
    3111                            .dwattr $C$DW$T$492, DW_AT_decl_line(0x896)
    3112                            .dwattr $C$DW$T$492, DW_AT_decl_column(0x03)
    3113                    
    3114                    $C$DW$T$493     .dwtag  DW_TAG_pointer_type
    3115                            .dwattr $C$DW$T$493, DW_AT_type(*$C$DW$T$492)
    3116                            .dwattr $C$DW$T$493, DW_AT_address_class(0x20)
    3117                    
    3118                    
    3119                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3120                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    3121                    $C$DW$317       .dwtag  DW_TAG_member
    3122                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$35)
    3123                            .dwattr $C$DW$317, DW_AT_name("firstChCentrFreq")
    3124                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("firstChCentrFreq")
    3125                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3126                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3127                            .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3128                            .dwattr $C$DW$317, DW_AT_decl_line(0x29b)
    3129                            .dwattr $C$DW$317, DW_AT_decl_column(0x0a)
    3130                    
    3131                    $C$DW$318       .dwtag  DW_TAG_member
    3132                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$35)
    3133                            .dwattr $C$DW$318, DW_AT_name("channelSpacing")
    3134                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("channelSpacing")
    3135                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   58

    3136                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3137                            .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3138                            .dwattr $C$DW$318, DW_AT_decl_line(0x29c)
    3139                            .dwattr $C$DW$318, DW_AT_decl_column(0x0a)
    3140                    
    3141                    $C$DW$319       .dwtag  DW_TAG_member
    3142                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$23)
    3143                            .dwattr $C$DW$319, DW_AT_name("noOfChannels")
    3144                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("noOfChannels")
    3145                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3146                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3147                            .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3148                            .dwattr $C$DW$319, DW_AT_decl_line(0x29d)
    3149                            .dwattr $C$DW$319, DW_AT_decl_column(0x0a)
    3150                    
    3151                    $C$DW$320       .dwtag  DW_TAG_member
    3152                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$21)
    3153                            .dwattr $C$DW$320, DW_AT_name("fskModScheme")
    3154                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("fskModScheme")
    3155                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3156                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3157                            .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3158                            .dwattr $C$DW$320, DW_AT_decl_line(0x29f)
    3159                            .dwattr $C$DW$320, DW_AT_decl_column(0x09)
    3160                    
    3161                    $C$DW$321       .dwtag  DW_TAG_member
    3162                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$23)
    3163                            .dwattr $C$DW$321, DW_AT_name("symbolRate")
    3164                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("symbolRate")
    3165                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3166                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3167                            .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3168                            .dwattr $C$DW$321, DW_AT_decl_line(0x2a1)
    3169                            .dwattr $C$DW$321, DW_AT_decl_column(0x0a)
    3170                    
    3171                    $C$DW$322       .dwtag  DW_TAG_member
    3172                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$21)
    3173                            .dwattr $C$DW$322, DW_AT_name("fskModIndex")
    3174                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("fskModIndex")
    3175                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3176                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3177                            .dwattr $C$DW$322, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3178                            .dwattr $C$DW$322, DW_AT_decl_line(0x2a2)
    3179                            .dwattr $C$DW$322, DW_AT_decl_column(0x09)
    3180                    
    3181                    $C$DW$323       .dwtag  DW_TAG_member
    3182                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$21)
    3183                            .dwattr $C$DW$323, DW_AT_name("ccaType")
    3184                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("ccaType")
    3185                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    3186                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3187                            .dwattr $C$DW$323, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3188                            .dwattr $C$DW$323, DW_AT_decl_line(0x2aa)
    3189                            .dwattr $C$DW$323, DW_AT_decl_column(0x09)
    3190                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   59

    3191                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3192                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x29a)
    3193                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    3194                            .dwendtag $C$DW$T$36
    3195                    
    3196                    $C$DW$T$902     .dwtag  DW_TAG_typedef
    3197                            .dwattr $C$DW$T$902, DW_AT_name("macMRFSKPHYDesc_t")
    3198                            .dwattr $C$DW$T$902, DW_AT_type(*$C$DW$T$36)
    3199                            .dwattr $C$DW$T$902, DW_AT_language(DW_LANG_C)
    3200                            .dwattr $C$DW$T$902, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3201                            .dwattr $C$DW$T$902, DW_AT_decl_line(0x2ab)
    3202                            .dwattr $C$DW$T$902, DW_AT_decl_column(0x03)
    3203                    
    3204                    $C$DW$T$903     .dwtag  DW_TAG_typedef
    3205                            .dwattr $C$DW$T$903, DW_AT_name("macPHYDesc_t")
    3206                            .dwattr $C$DW$T$903, DW_AT_type(*$C$DW$T$902)
    3207                            .dwattr $C$DW$T$903, DW_AT_language(DW_LANG_C)
    3208                            .dwattr $C$DW$T$903, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3209                            .dwattr $C$DW$T$903, DW_AT_decl_line(0x2b1)
    3210                            .dwattr $C$DW$T$903, DW_AT_decl_column(0x1b)
    3211                    
    3212                    
    3213                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3214                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    3215                    $C$DW$324       .dwtag  DW_TAG_member
    3216                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$21)
    3217                            .dwattr $C$DW$324, DW_AT_name("event")
    3218                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("event")
    3219                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3220                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3221                            .dwattr $C$DW$324, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3222                            .dwattr $C$DW$324, DW_AT_decl_line(0x2b6)
    3223                            .dwattr $C$DW$324, DW_AT_decl_column(0x0b)
    3224                    
    3225                    $C$DW$325       .dwtag  DW_TAG_member
    3226                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
    3227                            .dwattr $C$DW$325, DW_AT_name("status")
    3228                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("status")
    3229                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3230                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3231                            .dwattr $C$DW$325, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3232                            .dwattr $C$DW$325, DW_AT_decl_line(0x2b7)
    3233                            .dwattr $C$DW$325, DW_AT_decl_column(0x0b)
    3234                    
    3235                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3236                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x2b5)
    3237                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    3238                            .dwendtag $C$DW$T$37
    3239                    
    3240                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    3241                            .dwattr $C$DW$T$79, DW_AT_name("macEventHdr_t")
    3242                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$37)
    3243                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3244                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3245                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x2b8)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   60

    3246                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    3247                    
    3248                    
    3249                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    3250                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x0c)
    3251                    $C$DW$326       .dwtag  DW_TAG_member
    3252                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$38)
    3253                            .dwattr $C$DW$326, DW_AT_name("keySource")
    3254                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("keySource")
    3255                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3256                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3257                            .dwattr $C$DW$326, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3258                            .dwattr $C$DW$326, DW_AT_decl_line(0x2bd)
    3259                            .dwattr $C$DW$326, DW_AT_decl_column(0x0b)
    3260                    
    3261                    $C$DW$327       .dwtag  DW_TAG_member
    3262                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$21)
    3263                            .dwattr $C$DW$327, DW_AT_name("securityLevel")
    3264                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("securityLevel")
    3265                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3266                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3267                            .dwattr $C$DW$327, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3268                            .dwattr $C$DW$327, DW_AT_decl_line(0x2be)
    3269                            .dwattr $C$DW$327, DW_AT_decl_column(0x0b)
    3270                    
    3271                    $C$DW$328       .dwtag  DW_TAG_member
    3272                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$21)
    3273                            .dwattr $C$DW$328, DW_AT_name("keyIdMode")
    3274                            .dwattr $C$DW$328, DW_AT_TI_symbol_name("keyIdMode")
    3275                            .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3276                            .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3277                            .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3278                            .dwattr $C$DW$328, DW_AT_decl_line(0x2bf)
    3279                            .dwattr $C$DW$328, DW_AT_decl_column(0x0b)
    3280                    
    3281                    $C$DW$329       .dwtag  DW_TAG_member
    3282                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$23)
    3283                            .dwattr $C$DW$329, DW_AT_name("keyIndex")
    3284                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("keyIndex")
    3285                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3286                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3287                            .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3288                            .dwattr $C$DW$329, DW_AT_decl_line(0x2c0)
    3289                            .dwattr $C$DW$329, DW_AT_decl_column(0x0b)
    3290                    
    3291                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3292                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x2bc)
    3293                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    3294                            .dwendtag $C$DW$T$39
    3295                    
    3296                    $C$DW$T$904     .dwtag  DW_TAG_typedef
    3297                            .dwattr $C$DW$T$904, DW_AT_name("macSec_t")
    3298                            .dwattr $C$DW$T$904, DW_AT_type(*$C$DW$T$39)
    3299                            .dwattr $C$DW$T$904, DW_AT_language(DW_LANG_C)
    3300                            .dwattr $C$DW$T$904, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   61

    3301                            .dwattr $C$DW$T$904, DW_AT_decl_line(0x2c1)
    3302                            .dwattr $C$DW$T$904, DW_AT_decl_column(0x03)
    3303                    
    3304                    
    3305                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3306                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x0a)
    3307                    $C$DW$330       .dwtag  DW_TAG_member
    3308                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$40)
    3309                            .dwattr $C$DW$330, DW_AT_name("lookupData")
    3310                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("lookupData")
    3311                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3312                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3313                            .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3314                            .dwattr $C$DW$330, DW_AT_decl_line(0x2c6)
    3315                            .dwattr $C$DW$330, DW_AT_decl_column(0x16)
    3316                    
    3317                    $C$DW$331       .dwtag  DW_TAG_member
    3318                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$21)
    3319                            .dwattr $C$DW$331, DW_AT_name("lookupDataSize")
    3320                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("lookupDataSize")
    3321                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3322                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3323                            .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3324                            .dwattr $C$DW$331, DW_AT_decl_line(0x2c7)
    3325                            .dwattr $C$DW$331, DW_AT_decl_column(0x16)
    3326                    
    3327                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3328                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2c5)
    3329                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    3330                            .dwendtag $C$DW$T$41
    3331                    
    3332                    $C$DW$T$45      .dwtag  DW_TAG_typedef
    3333                            .dwattr $C$DW$T$45, DW_AT_name("keyIdLookupDescriptor_t")
    3334                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$41)
    3335                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3336                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3337                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2c8)
    3338                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    3339                    
    3340                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3341                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3342                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3343                    
    3344                    
    3345                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3346                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x04)
    3347                    $C$DW$332       .dwtag  DW_TAG_member
    3348                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$23)
    3349                            .dwattr $C$DW$332, DW_AT_name("deviceDescriptorHandle")
    3350                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    3351                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3352                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3353                            .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3354                            .dwattr $C$DW$332, DW_AT_decl_line(0x2cd)
    3355                            .dwattr $C$DW$332, DW_AT_decl_column(0x16)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   62

    3356                    
    3357                    $C$DW$333       .dwtag  DW_TAG_member
    3358                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$42)
    3359                            .dwattr $C$DW$333, DW_AT_name("uniqueDevice")
    3360                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("uniqueDevice")
    3361                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3362                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3363                            .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3364                            .dwattr $C$DW$333, DW_AT_decl_line(0x2ce)
    3365                            .dwattr $C$DW$333, DW_AT_decl_column(0x16)
    3366                    
    3367                    $C$DW$334       .dwtag  DW_TAG_member
    3368                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$42)
    3369                            .dwattr $C$DW$334, DW_AT_name("blackListed")
    3370                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("blackListed")
    3371                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3372                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3373                            .dwattr $C$DW$334, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3374                            .dwattr $C$DW$334, DW_AT_decl_line(0x2cf)
    3375                            .dwattr $C$DW$334, DW_AT_decl_column(0x16)
    3376                    
    3377                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3378                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2cc)
    3379                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    3380                            .dwendtag $C$DW$T$43
    3381                    
    3382                    $C$DW$T$47      .dwtag  DW_TAG_typedef
    3383                            .dwattr $C$DW$T$47, DW_AT_name("keyDeviceDescriptor_t")
    3384                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$43)
    3385                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3386                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3387                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2d0)
    3388                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    3389                    
    3390                    $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    3391                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3392                            .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    3393                    
    3394                    
    3395                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3396                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    3397                    $C$DW$335       .dwtag  DW_TAG_member
    3398                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$21)
    3399                            .dwattr $C$DW$335, DW_AT_name("frameType")
    3400                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("frameType")
    3401                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3402                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3403                            .dwattr $C$DW$335, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3404                            .dwattr $C$DW$335, DW_AT_decl_line(0x2d5)
    3405                            .dwattr $C$DW$335, DW_AT_decl_column(0x16)
    3406                    
    3407                    $C$DW$336       .dwtag  DW_TAG_member
    3408                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$21)
    3409                            .dwattr $C$DW$336, DW_AT_name("cmdFrameId")
    3410                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("cmdFrameId")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   63

    3411                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3412                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3413                            .dwattr $C$DW$336, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3414                            .dwattr $C$DW$336, DW_AT_decl_line(0x2d6)
    3415                            .dwattr $C$DW$336, DW_AT_decl_column(0x16)
    3416                    
    3417                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3418                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2d4)
    3419                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    3420                            .dwendtag $C$DW$T$44
    3421                    
    3422                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    3423                            .dwattr $C$DW$T$49, DW_AT_name("keyUsageDescriptor_t")
    3424                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$44)
    3425                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3426                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3427                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2d7)
    3428                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    3429                    
    3430                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    3431                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    3432                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    3433                    
    3434                    
    3435                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3436                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x2c)
    3437                    $C$DW$337       .dwtag  DW_TAG_member
    3438                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$46)
    3439                            .dwattr $C$DW$337, DW_AT_name("keyIdLookupList")
    3440                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("keyIdLookupList")
    3441                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3442                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3443                            .dwattr $C$DW$337, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3444                            .dwattr $C$DW$337, DW_AT_decl_line(0x2dc)
    3445                            .dwattr $C$DW$337, DW_AT_decl_column(0x1d)
    3446                    
    3447                    $C$DW$338       .dwtag  DW_TAG_member
    3448                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$21)
    3449                            .dwattr $C$DW$338, DW_AT_name("keyIdLookupEntries")
    3450                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("keyIdLookupEntries")
    3451                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3452                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3453                            .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3454                            .dwattr $C$DW$338, DW_AT_decl_line(0x2dd)
    3455                            .dwattr $C$DW$338, DW_AT_decl_column(0x1c)
    3456                    
    3457                    $C$DW$339       .dwtag  DW_TAG_member
    3458                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$48)
    3459                            .dwattr $C$DW$339, DW_AT_name("keyDeviceList")
    3460                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("keyDeviceList")
    3461                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3462                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3463                            .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3464                            .dwattr $C$DW$339, DW_AT_decl_line(0x2df)
    3465                            .dwattr $C$DW$339, DW_AT_decl_column(0x1d)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   64

    3466                    
    3467                    $C$DW$340       .dwtag  DW_TAG_member
    3468                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
    3469                            .dwattr $C$DW$340, DW_AT_name("keyDeviceListEntries")
    3470                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("keyDeviceListEntries")
    3471                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3472                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3473                            .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3474                            .dwattr $C$DW$340, DW_AT_decl_line(0x2e2)
    3475                            .dwattr $C$DW$340, DW_AT_decl_column(0x1d)
    3476                    
    3477                    $C$DW$341       .dwtag  DW_TAG_member
    3478                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$50)
    3479                            .dwattr $C$DW$341, DW_AT_name("keyUsageList")
    3480                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("keyUsageList")
    3481                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3482                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3483                            .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3484                            .dwattr $C$DW$341, DW_AT_decl_line(0x2e4)
    3485                            .dwattr $C$DW$341, DW_AT_decl_column(0x1d)
    3486                    
    3487                    $C$DW$342       .dwtag  DW_TAG_member
    3488                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$21)
    3489                            .dwattr $C$DW$342, DW_AT_name("keyUsageListEntries")
    3490                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("keyUsageListEntries")
    3491                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3492                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3493                            .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3494                            .dwattr $C$DW$342, DW_AT_decl_line(0x2e6)
    3495                            .dwattr $C$DW$342, DW_AT_decl_column(0x1c)
    3496                    
    3497                    $C$DW$343       .dwtag  DW_TAG_member
    3498                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$51)
    3499                            .dwattr $C$DW$343, DW_AT_name("key")
    3500                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("key")
    3501                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    3502                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3503                            .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3504                            .dwattr $C$DW$343, DW_AT_decl_line(0x2e8)
    3505                            .dwattr $C$DW$343, DW_AT_decl_column(0x1c)
    3506                    
    3507                    $C$DW$344       .dwtag  DW_TAG_member
    3508                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$35)
    3509                            .dwattr $C$DW$344, DW_AT_name("frameCounter")
    3510                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("frameCounter")
    3511                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3512                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3513                            .dwattr $C$DW$344, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3514                            .dwattr $C$DW$344, DW_AT_decl_line(0x2e9)
    3515                            .dwattr $C$DW$344, DW_AT_decl_column(0x1c)
    3516                    
    3517                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3518                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x2db)
    3519                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    3520                            .dwendtag $C$DW$T$52
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   65

    3521                    
    3522                    $C$DW$T$69      .dwtag  DW_TAG_typedef
    3523                            .dwattr $C$DW$T$69, DW_AT_name("keyDescriptor_t")
    3524                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$52)
    3525                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3526                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3527                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x2ec)
    3528                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    3529                    
    3530                    $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    3531                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    3532                            .dwattr $C$DW$T$70, DW_AT_address_class(0x20)
    3533                    
    3534                    
    3535                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3536                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x08)
    3537                    $C$DW$345       .dwtag  DW_TAG_member
    3538                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$35)
    3539                            .dwattr $C$DW$345, DW_AT_name("frameCounter")
    3540                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("frameCounter")
    3541                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3542                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3543                            .dwattr $C$DW$345, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3544                            .dwattr $C$DW$345, DW_AT_decl_line(0x2f1)
    3545                            .dwattr $C$DW$345, DW_AT_decl_column(0x18)
    3546                    
    3547                    $C$DW$346       .dwtag  DW_TAG_member
    3548                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
    3549                            .dwattr $C$DW$346, DW_AT_name("frameCntrIdx")
    3550                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("frameCntrIdx")
    3551                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3552                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3553                            .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3554                            .dwattr $C$DW$346, DW_AT_decl_line(0x2f2)
    3555                            .dwattr $C$DW$346, DW_AT_decl_column(0x18)
    3556                    
    3557                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3558                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2f0)
    3559                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    3560                            .dwendtag $C$DW$T$53
    3561                    
    3562                    $C$DW$T$56      .dwtag  DW_TAG_typedef
    3563                            .dwattr $C$DW$T$56, DW_AT_name("frameCntr_t")
    3564                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$53)
    3565                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3566                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3567                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x2f3)
    3568                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x03)
    3569                    
    3570                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    3571                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    3572                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    3573                    
    3574                    
    3575                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   66

    3576                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x14)
    3577                    $C$DW$347       .dwtag  DW_TAG_member
    3578                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
    3579                            .dwattr $C$DW$347, DW_AT_name("panID")
    3580                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("panID")
    3581                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3582                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3583                            .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3584                            .dwattr $C$DW$347, DW_AT_decl_line(0x2f8)
    3585                            .dwattr $C$DW$347, DW_AT_decl_column(0x16)
    3586                    
    3587                    $C$DW$348       .dwtag  DW_TAG_member
    3588                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$23)
    3589                            .dwattr $C$DW$348, DW_AT_name("shortAddress")
    3590                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("shortAddress")
    3591                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3592                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3593                            .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3594                            .dwattr $C$DW$348, DW_AT_decl_line(0x2f9)
    3595                            .dwattr $C$DW$348, DW_AT_decl_column(0x16)
    3596                    
    3597                    $C$DW$349       .dwtag  DW_TAG_member
    3598                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$55)
    3599                            .dwattr $C$DW$349, DW_AT_name("extAddress")
    3600                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("extAddress")
    3601                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3602                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3603                            .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3604                            .dwattr $C$DW$349, DW_AT_decl_line(0x2fa)
    3605                            .dwattr $C$DW$349, DW_AT_decl_column(0x16)
    3606                    
    3607                    $C$DW$350       .dwtag  DW_TAG_member
    3608                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$57)
    3609                            .dwattr $C$DW$350, DW_AT_name("frameCtr")
    3610                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("frameCtr")
    3611                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3612                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3613                            .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3614                            .dwattr $C$DW$350, DW_AT_decl_line(0x2fd)
    3615                            .dwattr $C$DW$350, DW_AT_decl_column(0x19)
    3616                    
    3617                    $C$DW$351       .dwtag  DW_TAG_member
    3618                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$42)
    3619                            .dwattr $C$DW$351, DW_AT_name("exempt")
    3620                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("exempt")
    3621                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3622                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3623                            .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3624                            .dwattr $C$DW$351, DW_AT_decl_line(0x303)
    3625                            .dwattr $C$DW$351, DW_AT_decl_column(0x16)
    3626                    
    3627                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3628                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x2f7)
    3629                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    3630                            .dwendtag $C$DW$T$58
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   67

    3631                    
    3632                    $C$DW$T$64      .dwtag  DW_TAG_typedef
    3633                            .dwattr $C$DW$T$64, DW_AT_name("deviceDescriptor_t")
    3634                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$58)
    3635                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3636                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3637                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x305)
    3638                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
    3639                    
    3640                    
    3641                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    3642                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x04)
    3643                    $C$DW$352       .dwtag  DW_TAG_member
    3644                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$21)
    3645                            .dwattr $C$DW$352, DW_AT_name("frameType")
    3646                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("frameType")
    3647                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3648                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3649                            .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3650                            .dwattr $C$DW$352, DW_AT_decl_line(0x30a)
    3651                            .dwattr $C$DW$352, DW_AT_decl_column(0x16)
    3652                    
    3653                    $C$DW$353       .dwtag  DW_TAG_member
    3654                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$21)
    3655                            .dwattr $C$DW$353, DW_AT_name("commandFrameIdentifier")
    3656                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("commandFrameIdentifier")
    3657                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3658                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3659                            .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3660                            .dwattr $C$DW$353, DW_AT_decl_line(0x30b)
    3661                            .dwattr $C$DW$353, DW_AT_decl_column(0x16)
    3662                    
    3663                    $C$DW$354       .dwtag  DW_TAG_member
    3664                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$21)
    3665                            .dwattr $C$DW$354, DW_AT_name("securityMinimum")
    3666                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("securityMinimum")
    3667                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3668                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3669                            .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3670                            .dwattr $C$DW$354, DW_AT_decl_line(0x30c)
    3671                            .dwattr $C$DW$354, DW_AT_decl_column(0x16)
    3672                    
    3673                    $C$DW$355       .dwtag  DW_TAG_member
    3674                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$42)
    3675                            .dwattr $C$DW$355, DW_AT_name("securityOverrideSecurityMinimum")
    3676                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("securityOverrideSecurityMinimum")
    3677                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3678                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3679                            .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3680                            .dwattr $C$DW$355, DW_AT_decl_line(0x30e)
    3681                            .dwattr $C$DW$355, DW_AT_decl_column(0x16)
    3682                    
    3683                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3684                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x309)
    3685                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   68

    3686                            .dwendtag $C$DW$T$59
    3687                    
    3688                    $C$DW$T$66      .dwtag  DW_TAG_typedef
    3689                            .dwattr $C$DW$T$66, DW_AT_name("securityLevelDescriptor_t")
    3690                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$59)
    3691                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3692                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3693                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x317)
    3694                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x03)
    3695                    
    3696                    
    3697                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    3698                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x0e)
    3699                    $C$DW$356       .dwtag  DW_TAG_member
    3700                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$23)
    3701                            .dwattr $C$DW$356, DW_AT_name("key_index")
    3702                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("key_index")
    3703                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3704                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3705                            .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3706                            .dwattr $C$DW$356, DW_AT_decl_line(0x31c)
    3707                            .dwattr $C$DW$356, DW_AT_decl_column(0x1b)
    3708                    
    3709                    $C$DW$357       .dwtag  DW_TAG_member
    3710                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$21)
    3711                            .dwattr $C$DW$357, DW_AT_name("key_id_lookup_index")
    3712                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("key_id_lookup_index")
    3713                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3714                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3715                            .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3716                            .dwattr $C$DW$357, DW_AT_decl_line(0x31d)
    3717                            .dwattr $C$DW$357, DW_AT_decl_column(0x1b)
    3718                    
    3719                    $C$DW$358       .dwtag  DW_TAG_member
    3720                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$45)
    3721                            .dwattr $C$DW$358, DW_AT_name("macKeyIdLookupEntry")
    3722                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("macKeyIdLookupEntry")
    3723                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3724                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3725                            .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3726                            .dwattr $C$DW$358, DW_AT_decl_line(0x31e)
    3727                            .dwattr $C$DW$358, DW_AT_decl_column(0x1b)
    3728                    
    3729                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3730                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x31b)
    3731                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
    3732                            .dwendtag $C$DW$T$60
    3733                    
    3734                    $C$DW$T$905     .dwtag  DW_TAG_typedef
    3735                            .dwattr $C$DW$T$905, DW_AT_name("macSecurityPibKeyIdLookupEntry_t")
    3736                            .dwattr $C$DW$T$905, DW_AT_type(*$C$DW$T$60)
    3737                            .dwattr $C$DW$T$905, DW_AT_language(DW_LANG_C)
    3738                            .dwattr $C$DW$T$905, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3739                            .dwattr $C$DW$T$905, DW_AT_decl_line(0x31f)
    3740                            .dwattr $C$DW$T$905, DW_AT_decl_column(0x03)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   69

    3741                    
    3742                    
    3743                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3744                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x08)
    3745                    $C$DW$359       .dwtag  DW_TAG_member
    3746                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
    3747                            .dwattr $C$DW$359, DW_AT_name("key_index")
    3748                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("key_index")
    3749                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3750                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3751                            .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3752                            .dwattr $C$DW$359, DW_AT_decl_line(0x323)
    3753                            .dwattr $C$DW$359, DW_AT_decl_column(0x1b)
    3754                    
    3755                    $C$DW$360       .dwtag  DW_TAG_member
    3756                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$23)
    3757                            .dwattr $C$DW$360, DW_AT_name("key_device_index")
    3758                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("key_device_index")
    3759                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3760                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3761                            .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3762                            .dwattr $C$DW$360, DW_AT_decl_line(0x324)
    3763                            .dwattr $C$DW$360, DW_AT_decl_column(0x1b)
    3764                    
    3765                    $C$DW$361       .dwtag  DW_TAG_member
    3766                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$47)
    3767                            .dwattr $C$DW$361, DW_AT_name("macKeyDeviceEntry")
    3768                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("macKeyDeviceEntry")
    3769                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3770                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3771                            .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3772                            .dwattr $C$DW$361, DW_AT_decl_line(0x325)
    3773                            .dwattr $C$DW$361, DW_AT_decl_column(0x1b)
    3774                    
    3775                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3776                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x322)
    3777                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    3778                            .dwendtag $C$DW$T$61
    3779                    
    3780                    $C$DW$T$906     .dwtag  DW_TAG_typedef
    3781                            .dwattr $C$DW$T$906, DW_AT_name("macSecurityPibKeyDeviceEntry_t")
    3782                            .dwattr $C$DW$T$906, DW_AT_type(*$C$DW$T$61)
    3783                            .dwattr $C$DW$T$906, DW_AT_language(DW_LANG_C)
    3784                            .dwattr $C$DW$T$906, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3785                            .dwattr $C$DW$T$906, DW_AT_decl_line(0x326)
    3786                            .dwattr $C$DW$T$906, DW_AT_decl_column(0x03)
    3787                    
    3788                    
    3789                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
    3790                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x06)
    3791                    $C$DW$362       .dwtag  DW_TAG_member
    3792                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$23)
    3793                            .dwattr $C$DW$362, DW_AT_name("key_index")
    3794                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("key_index")
    3795                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   70

    3796                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3797                            .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3798                            .dwattr $C$DW$362, DW_AT_decl_line(0x32a)
    3799                            .dwattr $C$DW$362, DW_AT_decl_column(0x1b)
    3800                    
    3801                    $C$DW$363       .dwtag  DW_TAG_member
    3802                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$21)
    3803                            .dwattr $C$DW$363, DW_AT_name("key_key_usage_index")
    3804                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("key_key_usage_index")
    3805                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3806                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3807                            .dwattr $C$DW$363, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3808                            .dwattr $C$DW$363, DW_AT_decl_line(0x32b)
    3809                            .dwattr $C$DW$363, DW_AT_decl_column(0x1b)
    3810                    
    3811                    $C$DW$364       .dwtag  DW_TAG_member
    3812                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$49)
    3813                            .dwattr $C$DW$364, DW_AT_name("macKeyUsageEntry")
    3814                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("macKeyUsageEntry")
    3815                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3816                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3817                            .dwattr $C$DW$364, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3818                            .dwattr $C$DW$364, DW_AT_decl_line(0x32c)
    3819                            .dwattr $C$DW$364, DW_AT_decl_column(0x1b)
    3820                    
    3821                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3822                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x329)
    3823                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
    3824                            .dwendtag $C$DW$T$62
    3825                    
    3826                    $C$DW$T$907     .dwtag  DW_TAG_typedef
    3827                            .dwattr $C$DW$T$907, DW_AT_name("macSecurityPibKeyUsageEntry_t")
    3828                            .dwattr $C$DW$T$907, DW_AT_type(*$C$DW$T$62)
    3829                            .dwattr $C$DW$T$907, DW_AT_language(DW_LANG_C)
    3830                            .dwattr $C$DW$T$907, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3831                            .dwattr $C$DW$T$907, DW_AT_decl_line(0x32d)
    3832                            .dwattr $C$DW$T$907, DW_AT_decl_column(0x03)
    3833                    
    3834                    
    3835                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3836                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x18)
    3837                    $C$DW$365       .dwtag  DW_TAG_member
    3838                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
    3839                            .dwattr $C$DW$365, DW_AT_name("key_index")
    3840                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("key_index")
    3841                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3842                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3843                            .dwattr $C$DW$365, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3844                            .dwattr $C$DW$365, DW_AT_decl_line(0x331)
    3845                            .dwattr $C$DW$365, DW_AT_decl_column(0x1b)
    3846                    
    3847                    $C$DW$366       .dwtag  DW_TAG_member
    3848                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$51)
    3849                            .dwattr $C$DW$366, DW_AT_name("keyEntry")
    3850                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("keyEntry")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   71

    3851                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3852                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3853                            .dwattr $C$DW$366, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3854                            .dwattr $C$DW$366, DW_AT_decl_line(0x332)
    3855                            .dwattr $C$DW$366, DW_AT_decl_column(0x1b)
    3856                    
    3857                    $C$DW$367       .dwtag  DW_TAG_member
    3858                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$35)
    3859                            .dwattr $C$DW$367, DW_AT_name("frameCounter")
    3860                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("frameCounter")
    3861                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3862                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3863                            .dwattr $C$DW$367, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3864                            .dwattr $C$DW$367, DW_AT_decl_line(0x333)
    3865                            .dwattr $C$DW$367, DW_AT_decl_column(0x1b)
    3866                    
    3867                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3868                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x330)
    3869                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    3870                            .dwendtag $C$DW$T$63
    3871                    
    3872                    $C$DW$T$908     .dwtag  DW_TAG_typedef
    3873                            .dwattr $C$DW$T$908, DW_AT_name("macSecurityPibKeyEntry_t")
    3874                            .dwattr $C$DW$T$908, DW_AT_type(*$C$DW$T$63)
    3875                            .dwattr $C$DW$T$908, DW_AT_language(DW_LANG_C)
    3876                            .dwattr $C$DW$T$908, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3877                            .dwattr $C$DW$T$908, DW_AT_decl_line(0x334)
    3878                            .dwattr $C$DW$T$908, DW_AT_decl_column(0x03)
    3879                    
    3880                    
    3881                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3882                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x18)
    3883                    $C$DW$368       .dwtag  DW_TAG_member
    3884                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$23)
    3885                            .dwattr $C$DW$368, DW_AT_name("device_index")
    3886                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("device_index")
    3887                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3888                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3889                            .dwattr $C$DW$368, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3890                            .dwattr $C$DW$368, DW_AT_decl_line(0x338)
    3891                            .dwattr $C$DW$368, DW_AT_decl_column(0x1b)
    3892                    
    3893                    $C$DW$369       .dwtag  DW_TAG_member
    3894                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$64)
    3895                            .dwattr $C$DW$369, DW_AT_name("macDeviceEntry")
    3896                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("macDeviceEntry")
    3897                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3898                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3899                            .dwattr $C$DW$369, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3900                            .dwattr $C$DW$369, DW_AT_decl_line(0x339)
    3901                            .dwattr $C$DW$369, DW_AT_decl_column(0x1b)
    3902                    
    3903                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3904                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x337)
    3905                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   72

    3906                            .dwendtag $C$DW$T$65
    3907                    
    3908                    $C$DW$T$909     .dwtag  DW_TAG_typedef
    3909                            .dwattr $C$DW$T$909, DW_AT_name("macSecurityPibDeviceEntry_t")
    3910                            .dwattr $C$DW$T$909, DW_AT_type(*$C$DW$T$65)
    3911                            .dwattr $C$DW$T$909, DW_AT_language(DW_LANG_C)
    3912                            .dwattr $C$DW$T$909, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3913                            .dwattr $C$DW$T$909, DW_AT_decl_line(0x33a)
    3914                            .dwattr $C$DW$T$909, DW_AT_decl_column(0x03)
    3915                    
    3916                    
    3917                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3918                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x05)
    3919                    $C$DW$370       .dwtag  DW_TAG_member
    3920                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$21)
    3921                            .dwattr $C$DW$370, DW_AT_name("security_level_index")
    3922                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("security_level_index")
    3923                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3924                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3925                            .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3926                            .dwattr $C$DW$370, DW_AT_decl_line(0x33e)
    3927                            .dwattr $C$DW$370, DW_AT_decl_column(0x1f)
    3928                    
    3929                    $C$DW$371       .dwtag  DW_TAG_member
    3930                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$66)
    3931                            .dwattr $C$DW$371, DW_AT_name("macSecurityLevelEntry")
    3932                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("macSecurityLevelEntry")
    3933                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3934                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3935                            .dwattr $C$DW$371, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3936                            .dwattr $C$DW$371, DW_AT_decl_line(0x33f)
    3937                            .dwattr $C$DW$371, DW_AT_decl_column(0x1f)
    3938                    
    3939                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3940                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x33d)
    3941                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    3942                            .dwendtag $C$DW$T$67
    3943                    
    3944                    $C$DW$T$910     .dwtag  DW_TAG_typedef
    3945                            .dwattr $C$DW$T$910, DW_AT_name("macSecurityPibSecurityLevelEntry_t")
    3946                            .dwattr $C$DW$T$910, DW_AT_type(*$C$DW$T$67)
    3947                            .dwattr $C$DW$T$910, DW_AT_language(DW_LANG_C)
    3948                            .dwattr $C$DW$T$910, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3949                            .dwattr $C$DW$T$910, DW_AT_decl_line(0x340)
    3950                            .dwattr $C$DW$T$910, DW_AT_decl_column(0x03)
    3951                    
    3952                    
    3953                    $C$DW$T$75      .dwtag  DW_TAG_structure_type
    3954                            .dwattr $C$DW$T$75, DW_AT_byte_size(0x78)
    3955                    $C$DW$372       .dwtag  DW_TAG_member
    3956                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$35)
    3957                            .dwattr $C$DW$372, DW_AT_name("timestamp")
    3958                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("timestamp")
    3959                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3960                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   73

    3961                            .dwattr $C$DW$372, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3962                            .dwattr $C$DW$372, DW_AT_decl_line(0x356)
    3963                            .dwattr $C$DW$372, DW_AT_decl_column(0x19)
    3964                    
    3965                    $C$DW$373       .dwtag  DW_TAG_member
    3966                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    3967                            .dwattr $C$DW$373, DW_AT_name("timestamp2")
    3968                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("timestamp2")
    3969                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3970                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3971                            .dwattr $C$DW$373, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3972                            .dwattr $C$DW$373, DW_AT_decl_line(0x357)
    3973                            .dwattr $C$DW$373, DW_AT_decl_column(0x19)
    3974                    
    3975                    $C$DW$374       .dwtag  DW_TAG_member
    3976                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
    3977                            .dwattr $C$DW$374, DW_AT_name("timeToLive")
    3978                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("timeToLive")
    3979                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3980                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3981                            .dwattr $C$DW$374, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3982                            .dwattr $C$DW$374, DW_AT_decl_line(0x358)
    3983                            .dwattr $C$DW$374, DW_AT_decl_column(0x19)
    3984                    
    3985                    $C$DW$375       .dwtag  DW_TAG_member
    3986                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$21)
    3987                            .dwattr $C$DW$375, DW_AT_name("frameType")
    3988                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("frameType")
    3989                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3990                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3991                            .dwattr $C$DW$375, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3992                            .dwattr $C$DW$375, DW_AT_decl_line(0x359)
    3993                            .dwattr $C$DW$375, DW_AT_decl_column(0x19)
    3994                    
    3995                    $C$DW$376       .dwtag  DW_TAG_member
    3996                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$23)
    3997                            .dwattr $C$DW$376, DW_AT_name("txOptions")
    3998                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("txOptions")
    3999                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4000                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4001                            .dwattr $C$DW$376, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4002                            .dwattr $C$DW$376, DW_AT_decl_line(0x35a)
    4003                            .dwattr $C$DW$376, DW_AT_decl_column(0x19)
    4004                    
    4005                    $C$DW$377       .dwtag  DW_TAG_member
    4006                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$21)
    4007                            .dwattr $C$DW$377, DW_AT_name("txMode")
    4008                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("txMode")
    4009                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4010                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4011                            .dwattr $C$DW$377, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4012                            .dwattr $C$DW$377, DW_AT_decl_line(0x35b)
    4013                            .dwattr $C$DW$377, DW_AT_decl_column(0x19)
    4014                    
    4015                    $C$DW$378       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{9C94100C-69A7-44DE-A646-92CD5042E5E1} PAGE   74

    4016                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$21)
    4017                            .dwattr $C$DW$378, DW_AT_name("txSched")
    4018                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("txSched")
