TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Mon Dec 10 17:47:32 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HighLevel/mac_cfg.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\sensor_c
      13                            .global macCfg
      14 00000000                   .sect   ".data:macCfg", RW

    2206                    
    2207                    $C$DW$T$525     .dwtag  DW_TAG_typedef
    2208                            .dwattr $C$DW$T$525, DW_AT_name("tFlashStateCommandsType")
    2209                            .dwattr $C$DW$T$525, DW_AT_type(*$C$DW$T$524)
    2210                            .dwattr $C$DW$T$525, DW_AT_language(DW_LANG_C)
    2211                            .dwattr $C$DW$T$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    2212                            .dwattr $C$DW$T$525, DW_AT_decl_line(0xb0)
    2213                            .dwattr $C$DW$T$525, DW_AT_decl_column(0x03)
    2214                    
    2215                    
    2216                    $C$DW$T$526     .dwtag  DW_TAG_enumeration_type
    2217                            .dwattr $C$DW$T$526, DW_AT_byte_size(0x01)
    2218                    $C$DW$241       .dwtag  DW_TAG_enumerator
    2219                            .dwattr $C$DW$241, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    2220                            .dwattr $C$DW$241, DW_AT_const_value(0xe0)
    2221                            .dwattr $C$DW$241, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2222                            .dwattr $C$DW$241, DW_AT_decl_line(0x3de)
    2223                            .dwattr $C$DW$241, DW_AT_decl_column(0x04)
    2224                    
    2225                    $C$DW$242       .dwtag  DW_TAG_enumerator
    2226                            .dwattr $C$DW$242, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    2227                            .dwattr $C$DW$242, DW_AT_const_value(0xe1)
    2228                            .dwattr $C$DW$242, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2229                            .dwattr $C$DW$242, DW_AT_decl_line(0x3e0)
    2230                            .dwattr $C$DW$242, DW_AT_decl_column(0x04)
    2231                    
    2232                    $C$DW$243       .dwtag  DW_TAG_enumerator
    2233                            .dwattr $C$DW$243, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    2234                            .dwattr $C$DW$243, DW_AT_const_value(0xe2)
    2235                            .dwattr $C$DW$243, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2236                            .dwattr $C$DW$243, DW_AT_decl_line(0x3e2)
    2237                            .dwattr $C$DW$243, DW_AT_decl_column(0x04)
    2238                    
    2239                    $C$DW$244       .dwtag  DW_TAG_enumerator
    2240                            .dwattr $C$DW$244, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    2241                            .dwattr $C$DW$244, DW_AT_const_value(0xe3)
    2242                            .dwattr $C$DW$244, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2243                            .dwattr $C$DW$244, DW_AT_decl_line(0x3e4)
    2244                            .dwattr $C$DW$244, DW_AT_decl_column(0x04)
    2245                    
    2246                    $C$DW$245       .dwtag  DW_TAG_enumerator
    2247                            .dwattr $C$DW$245, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    2248                            .dwattr $C$DW$245, DW_AT_const_value(0xe4)
    2249                            .dwattr $C$DW$245, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2250                            .dwattr $C$DW$245, DW_AT_decl_line(0x3e6)
    2251                            .dwattr $C$DW$245, DW_AT_decl_column(0x04)
    2252                    
    2253                    $C$DW$246       .dwtag  DW_TAG_enumerator
    2254                            .dwattr $C$DW$246, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    2255                            .dwattr $C$DW$246, DW_AT_const_value(0xe5)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   42

    2256                            .dwattr $C$DW$246, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2257                            .dwattr $C$DW$246, DW_AT_decl_line(0x3e8)
    2258                            .dwattr $C$DW$246, DW_AT_decl_column(0x04)
    2259                    
    2260                            .dwattr $C$DW$T$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2261                            .dwattr $C$DW$T$526, DW_AT_decl_line(0x3dc)
    2262                            .dwattr $C$DW$T$526, DW_AT_decl_column(0x01)
    2263                            .dwendtag $C$DW$T$526
    2264                    
    2265                    $C$DW$T$527     .dwtag  DW_TAG_typedef
    2266                            .dwattr $C$DW$T$527, DW_AT_name("ICall_RemotiCmdEvent_t")
    2267                            .dwattr $C$DW$T$527, DW_AT_type(*$C$DW$T$526)
    2268                            .dwattr $C$DW$T$527, DW_AT_language(DW_LANG_C)
    2269                            .dwattr $C$DW$T$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2270                            .dwattr $C$DW$T$527, DW_AT_decl_line(0x3e9)
    2271                            .dwattr $C$DW$T$527, DW_AT_decl_column(0x02)
    2272                    
    2273                    
    2274                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2275                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x10)
    2276                    $C$DW$247       .dwtag  DW_TAG_member
    2277                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2278                            .dwattr $C$DW$247, DW_AT_name("txDataMax")
    2279                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("txDataMax")
    2280                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2281                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2282                            .dwattr $C$DW$247, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2283                            .dwattr $C$DW$247, DW_AT_decl_line(0x53c)
    2284                            .dwattr $C$DW$247, DW_AT_decl_column(0x11)
    2285                    
    2286                    $C$DW$248       .dwtag  DW_TAG_member
    2287                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$20)
    2288                            .dwattr $C$DW$248, DW_AT_name("txMax")
    2289                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("txMax")
    2290                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2291                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2292                            .dwattr $C$DW$248, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2293                            .dwattr $C$DW$248, DW_AT_decl_line(0x53d)
    2294                            .dwattr $C$DW$248, DW_AT_decl_column(0x11)
    2295                    
    2296                    $C$DW$249       .dwtag  DW_TAG_member
    2297                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$20)
    2298                            .dwattr $C$DW$249, DW_AT_name("rxMax")
    2299                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("rxMax")
    2300                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2301                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2302                            .dwattr $C$DW$249, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2303                            .dwattr $C$DW$249, DW_AT_decl_line(0x53e)
    2304                            .dwattr $C$DW$249, DW_AT_decl_column(0x11)
    2305                    
    2306                    $C$DW$250       .dwtag  DW_TAG_member
    2307                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$20)
    2308                            .dwattr $C$DW$250, DW_AT_name("dataIndOffset")
    2309                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("dataIndOffset")
    2310                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   43

    2311                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2312                            .dwattr $C$DW$250, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2313                            .dwattr $C$DW$250, DW_AT_decl_line(0x53f)
    2314                            .dwattr $C$DW$250, DW_AT_decl_column(0x11)
    2315                    
    2316                    $C$DW$251       .dwtag  DW_TAG_member
    2317                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$22)
    2318                            .dwattr $C$DW$251, DW_AT_name("maxDeviceTableEntries")
    2319                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("maxDeviceTableEntries")
    2320                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2321                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2322                            .dwattr $C$DW$251, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2323                            .dwattr $C$DW$251, DW_AT_decl_line(0x541)
    2324                            .dwattr $C$DW$251, DW_AT_decl_column(0x11)
    2325                    
    2326                    $C$DW$252       .dwtag  DW_TAG_member
    2327                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    2328                            .dwattr $C$DW$252, DW_AT_name("maxKeyDeviceTableEntries")
    2329                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("maxKeyDeviceTableEntries")
    2330                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2331                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2332                            .dwattr $C$DW$252, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2333                            .dwattr $C$DW$252, DW_AT_decl_line(0x542)
    2334                            .dwattr $C$DW$252, DW_AT_decl_column(0x11)
    2335                    
    2336                    $C$DW$253       .dwtag  DW_TAG_member
    2337                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$22)
    2338                            .dwattr $C$DW$253, DW_AT_name("maxKeyTableEntries")
    2339                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("maxKeyTableEntries")
    2340                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2341                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2342                            .dwattr $C$DW$253, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2343                            .dwattr $C$DW$253, DW_AT_decl_line(0x543)
    2344                            .dwattr $C$DW$253, DW_AT_decl_column(0x11)
    2345                    
    2346                    $C$DW$254       .dwtag  DW_TAG_member
    2347                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    2348                            .dwattr $C$DW$254, DW_AT_name("maxNodeKeyTableEntries")
    2349                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("maxNodeKeyTableEntries")
    2350                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2351                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2352                            .dwattr $C$DW$254, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2353                            .dwattr $C$DW$254, DW_AT_decl_line(0x544)
    2354                            .dwattr $C$DW$254, DW_AT_decl_column(0x11)
    2355                    
    2356                    $C$DW$255       .dwtag  DW_TAG_member
    2357                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$20)
    2358                            .dwattr $C$DW$255, DW_AT_name("maxKeyIdLookUpEntries")
    2359                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("maxKeyIdLookUpEntries")
    2360                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2361                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2362                            .dwattr $C$DW$255, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2363                            .dwattr $C$DW$255, DW_AT_decl_line(0x545)
    2364                            .dwattr $C$DW$255, DW_AT_decl_column(0x11)
    2365                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   44

    2366                    $C$DW$256       .dwtag  DW_TAG_member
    2367                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$24)
    2368                            .dwattr $C$DW$256, DW_AT_name("appPendingQueue")
    2369                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("appPendingQueue")
    2370                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2371                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2372                            .dwattr $C$DW$256, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2373                            .dwattr $C$DW$256, DW_AT_decl_line(0x546)
    2374                            .dwattr $C$DW$256, DW_AT_decl_column(0x11)
    2375                    
    2376                    $C$DW$257       .dwtag  DW_TAG_member
    2377                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$21)
    2378                            .dwattr $C$DW$257, DW_AT_name("macMaxFrameSize")
    2379                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("macMaxFrameSize")
    2380                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2381                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2382                            .dwattr $C$DW$257, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2383                            .dwattr $C$DW$257, DW_AT_decl_line(0x548)
    2384                            .dwattr $C$DW$257, DW_AT_decl_column(0x11)
    2385                    
    2386                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2387                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x53b)
    2388                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    2389                            .dwendtag $C$DW$T$25
    2390                    
    2391                    $C$DW$T$528     .dwtag  DW_TAG_typedef
    2392                            .dwattr $C$DW$T$528, DW_AT_name("macCfg_t")
    2393                            .dwattr $C$DW$T$528, DW_AT_type(*$C$DW$T$25)
    2394                            .dwattr $C$DW$T$528, DW_AT_language(DW_LANG_C)
    2395                            .dwattr $C$DW$T$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2396                            .dwattr $C$DW$T$528, DW_AT_decl_line(0x549)
    2397                            .dwattr $C$DW$T$528, DW_AT_decl_column(0x03)
    2398                    
    2399                    
    2400                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2401                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    2402                    $C$DW$258       .dwtag  DW_TAG_member
    2403                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$180)
    2404                            .dwattr $C$DW$258, DW_AT_name("addr")
    2405                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("addr")
    2406                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2407                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2408                            .dwattr $C$DW$258, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2409                            .dwattr $C$DW$258, DW_AT_decl_line(0x55)
    2410                            .dwattr $C$DW$258, DW_AT_decl_column(0x05)
    2411                    
    2412                    $C$DW$259       .dwtag  DW_TAG_member
    2413                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$26)
    2414                            .dwattr $C$DW$259, DW_AT_name("addrMode")
    2415                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("addrMode")
    2416                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2417                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2418                            .dwattr $C$DW$259, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2419                            .dwattr $C$DW$259, DW_AT_decl_line(0x56)
    2420                            .dwattr $C$DW$259, DW_AT_decl_column(0x13)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   45

    2421                    
    2422                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    2423                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x50)
    2424                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    2425                            .dwendtag $C$DW$T$27
    2426                    
    2427                    $C$DW$T$81      .dwtag  DW_TAG_typedef
    2428                            .dwattr $C$DW$T$81, DW_AT_name("sAddr_t")
    2429                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$27)
    2430                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2431                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    2432                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x57)
    2433                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
    2434                    
    2435                    
    2436                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2437                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    2438                    $C$DW$260       .dwtag  DW_TAG_member
    2439                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$28)
    2440                            .dwattr $C$DW$260, DW_AT_name("p")
    2441                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("p")
    2442                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2443                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2444                            .dwattr $C$DW$260, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2445                            .dwattr $C$DW$260, DW_AT_decl_line(0x3d)
    2446                            .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    2447                    
    2448                    $C$DW$261       .dwtag  DW_TAG_member
    2449                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$21)
    2450                            .dwattr $C$DW$261, DW_AT_name("len")
    2451                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("len")
    2452                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2453                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2454                            .dwattr $C$DW$261, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2455                            .dwattr $C$DW$261, DW_AT_decl_line(0x3e)
    2456                            .dwattr $C$DW$261, DW_AT_decl_column(0x0e)
    2457                    
    2458                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    2459                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3c)
    2460                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    2461                            .dwendtag $C$DW$T$29
    2462                    
    2463                    $C$DW$T$84      .dwtag  DW_TAG_typedef
    2464                            .dwattr $C$DW$T$84, DW_AT_name("sData_t")
    2465                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$29)
    2466                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2467                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    2468                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x3f)
    2469                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    2470                    
    2471                    
    2472                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2473                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x0a)
    2474                    $C$DW$262       .dwtag  DW_TAG_member
    2475                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$182)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   46

    2476                            .dwattr $C$DW$262, DW_AT_name("addr")
    2477                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("addr")
    2478                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2480                            .dwattr $C$DW$262, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2481                            .dwattr $C$DW$262, DW_AT_decl_line(0x4db)
    2482                            .dwattr $C$DW$262, DW_AT_decl_column(0x07)
    2483                    
    2484                    $C$DW$263       .dwtag  DW_TAG_member
    2485                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$31)
    2486                            .dwattr $C$DW$263, DW_AT_name("addrMode")
    2487                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("addrMode")
    2488                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2489                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2490                            .dwattr $C$DW$263, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2491                            .dwattr $C$DW$263, DW_AT_decl_line(0x4de)
    2492                            .dwattr $C$DW$263, DW_AT_decl_column(0x17)
    2493                    
    2494                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    2495                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x4d0)
    2496                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    2497                            .dwendtag $C$DW$T$32
    2498                    
    2499                    $C$DW$T$328     .dwtag  DW_TAG_typedef
    2500                            .dwattr $C$DW$T$328, DW_AT_name("ApiMac_sAddr_t")
    2501                            .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$32)
    2502                            .dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
    2503                            .dwattr $C$DW$T$328, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appl
    2504                            .dwattr $C$DW$T$328, DW_AT_decl_line(0x4df)
    2505                            .dwattr $C$DW$T$328, DW_AT_decl_column(0x03)
    2506                    
    2507                    
    2508                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2509                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x08)
    2510                    $C$DW$264       .dwtag  DW_TAG_member
    2511                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$33)
    2512                            .dwattr $C$DW$264, DW_AT_name("frameCounter")
    2513                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("frameCounter")
    2514                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2515                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2516                            .dwattr $C$DW$264, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2517                            .dwattr $C$DW$264, DW_AT_decl_line(0x575)
    2518                            .dwattr $C$DW$264, DW_AT_decl_column(0x1a)
    2519                    
    2520                    $C$DW$265       .dwtag  DW_TAG_member
    2521                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$34)
    2522                            .dwattr $C$DW$265, DW_AT_name("keyIdx")
    2523                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("keyIdx")
    2524                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2525                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2526                            .dwattr $C$DW$265, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2527                            .dwattr $C$DW$265, DW_AT_decl_line(0x576)
    2528                            .dwattr $C$DW$265, DW_AT_decl_column(0x1a)
    2529                    
    2530                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   47

    2531                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x574)
    2532                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    2533                            .dwendtag $C$DW$T$35
    2534                    
    2535                    $C$DW$T$389     .dwtag  DW_TAG_typedef
    2536                            .dwattr $C$DW$T$389, DW_AT_name("ApiMac_frameCntr_t")
    2537                            .dwattr $C$DW$T$389, DW_AT_type(*$C$DW$T$35)
    2538                            .dwattr $C$DW$T$389, DW_AT_language(DW_LANG_C)
    2539                            .dwattr $C$DW$T$389, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appl
    2540                            .dwattr $C$DW$T$389, DW_AT_decl_line(0x577)
    2541                            .dwattr $C$DW$T$389, DW_AT_decl_column(0x03)
    2542                    
    2543                    $C$DW$T$390     .dwtag  DW_TAG_pointer_type
    2544                            .dwattr $C$DW$T$390, DW_AT_type(*$C$DW$T$389)
    2545                            .dwattr $C$DW$T$390, DW_AT_address_class(0x20)
    2546                    
    2547                    
    2548                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2549                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x40)
    2550                    $C$DW$266       .dwtag  DW_TAG_member
    2551                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$37)
    2552                            .dwattr $C$DW$266, DW_AT_name("beaconType")
    2553                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("beaconType")
    2554                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2555                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2556                            .dwattr $C$DW$266, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2557                            .dwattr $C$DW$266, DW_AT_decl_line(0x886)
    2558                            .dwattr $C$DW$266, DW_AT_decl_column(0x19)
    2559                    
    2560                    $C$DW$267       .dwtag  DW_TAG_member
    2561                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$26)
    2562                            .dwattr $C$DW$267, DW_AT_name("bsn")
    2563                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("bsn")
    2564                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2565                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2566                            .dwattr $C$DW$267, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2567                            .dwattr $C$DW$267, DW_AT_decl_line(0x888)
    2568                            .dwattr $C$DW$267, DW_AT_decl_column(0x0d)
    2569                    
    2570                    $C$DW$268       .dwtag  DW_TAG_member
    2571                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$38)
    2572                            .dwattr $C$DW$268, DW_AT_name("panDesc")
    2573                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("panDesc")
    2574                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2575                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2576                            .dwattr $C$DW$268, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2577                            .dwattr $C$DW$268, DW_AT_decl_line(0x88a)
    2578                            .dwattr $C$DW$268, DW_AT_decl_column(0x16)
    2579                    
    2580                    $C$DW$269       .dwtag  DW_TAG_member
    2581                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$185)
    2582                            .dwattr $C$DW$269, DW_AT_name("beaconData")
    2583                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("beaconData")
    2584                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2585                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   48

    2586                            .dwattr $C$DW$269, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    2587                            .dwattr $C$DW$269, DW_AT_decl_line(0x895)
    2588                            .dwattr $C$DW$269, DW_AT_decl_column(0x07)
    2589                    
    2590                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    2591                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x884)
    2592                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    2593                            .dwendtag $C$DW$T$39
    2594                    
    2595                    $C$DW$T$242     .dwtag  DW_TAG_typedef
    2596                            .dwattr $C$DW$T$242, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    2597                            .dwattr $C$DW$T$242, DW_AT_type(*$C$DW$T$39)
    2598                            .dwattr $C$DW$T$242, DW_AT_language(DW_LANG_C)
    2599                            .dwattr $C$DW$T$242, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appl
    2600                            .dwattr $C$DW$T$242, DW_AT_decl_line(0x896)
    2601                            .dwattr $C$DW$T$242, DW_AT_decl_column(0x03)
    2602                    
    2603                    $C$DW$T$243     .dwtag  DW_TAG_pointer_type
    2604                            .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$242)
    2605                            .dwattr $C$DW$T$243, DW_AT_address_class(0x20)
    2606                    
    2607                    
    2608                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2609                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x10)
    2610                    $C$DW$270       .dwtag  DW_TAG_member
    2611                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$40)
    2612                            .dwattr $C$DW$270, DW_AT_name("firstChCentrFreq")
    2613                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("firstChCentrFreq")
    2614                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2615                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    2616                            .dwattr $C$DW$270, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2617                            .dwattr $C$DW$270, DW_AT_decl_line(0x29b)
    2618                            .dwattr $C$DW$270, DW_AT_decl_column(0x0a)
    2619                    
    2620                    $C$DW$271       .dwtag  DW_TAG_member
    2621                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$40)
    2622                            .dwattr $C$DW$271, DW_AT_name("channelSpacing")
    2623                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("channelSpacing")
    2624                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2625                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    2626                            .dwattr $C$DW$271, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2627                            .dwattr $C$DW$271, DW_AT_decl_line(0x29c)
    2628                            .dwattr $C$DW$271, DW_AT_decl_column(0x0a)
    2629                    
    2630                    $C$DW$272       .dwtag  DW_TAG_member
    2631                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$21)
    2632                            .dwattr $C$DW$272, DW_AT_name("noOfChannels")
    2633                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("noOfChannels")
    2634                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2635                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    2636                            .dwattr $C$DW$272, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2637                            .dwattr $C$DW$272, DW_AT_decl_line(0x29d)
    2638                            .dwattr $C$DW$272, DW_AT_decl_column(0x0a)
    2639                    
    2640                    $C$DW$273       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   49

    2641                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    2642                            .dwattr $C$DW$273, DW_AT_name("fskModScheme")
    2643                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("fskModScheme")
    2644                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2645                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    2646                            .dwattr $C$DW$273, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2647                            .dwattr $C$DW$273, DW_AT_decl_line(0x29f)
    2648                            .dwattr $C$DW$273, DW_AT_decl_column(0x09)
    2649                    
    2650                    $C$DW$274       .dwtag  DW_TAG_member
    2651                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$21)
    2652                            .dwattr $C$DW$274, DW_AT_name("symbolRate")
    2653                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("symbolRate")
    2654                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2655                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    2656                            .dwattr $C$DW$274, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2657                            .dwattr $C$DW$274, DW_AT_decl_line(0x2a1)
    2658                            .dwattr $C$DW$274, DW_AT_decl_column(0x0a)
    2659                    
    2660                    $C$DW$275       .dwtag  DW_TAG_member
    2661                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    2662                            .dwattr $C$DW$275, DW_AT_name("fskModIndex")
    2663                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("fskModIndex")
    2664                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2665                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    2666                            .dwattr $C$DW$275, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2667                            .dwattr $C$DW$275, DW_AT_decl_line(0x2a2)
    2668                            .dwattr $C$DW$275, DW_AT_decl_column(0x09)
    2669                    
    2670                    $C$DW$276       .dwtag  DW_TAG_member
    2671                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    2672                            .dwattr $C$DW$276, DW_AT_name("ccaType")
    2673                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("ccaType")
    2674                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2675                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    2676                            .dwattr $C$DW$276, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2677                            .dwattr $C$DW$276, DW_AT_decl_line(0x2aa)
    2678                            .dwattr $C$DW$276, DW_AT_decl_column(0x09)
    2679                    
    2680                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2681                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x29a)
    2682                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2683                            .dwendtag $C$DW$T$41
    2684                    
    2685                    $C$DW$T$529     .dwtag  DW_TAG_typedef
    2686                            .dwattr $C$DW$T$529, DW_AT_name("macMRFSKPHYDesc_t")
    2687                            .dwattr $C$DW$T$529, DW_AT_type(*$C$DW$T$41)
    2688                            .dwattr $C$DW$T$529, DW_AT_language(DW_LANG_C)
    2689                            .dwattr $C$DW$T$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2690                            .dwattr $C$DW$T$529, DW_AT_decl_line(0x2ab)
    2691                            .dwattr $C$DW$T$529, DW_AT_decl_column(0x03)
    2692                    
    2693                    $C$DW$T$530     .dwtag  DW_TAG_typedef
    2694                            .dwattr $C$DW$T$530, DW_AT_name("macPHYDesc_t")
    2695                            .dwattr $C$DW$T$530, DW_AT_type(*$C$DW$T$529)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   50

    2696                            .dwattr $C$DW$T$530, DW_AT_language(DW_LANG_C)
    2697                            .dwattr $C$DW$T$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2698                            .dwattr $C$DW$T$530, DW_AT_decl_line(0x2b1)
    2699                            .dwattr $C$DW$T$530, DW_AT_decl_column(0x1b)
    2700                    
    2701                    
    2702                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2703                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2704                    $C$DW$277       .dwtag  DW_TAG_member
    2705                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    2706                            .dwattr $C$DW$277, DW_AT_name("event")
    2707                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("event")
    2708                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2709                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    2710                            .dwattr $C$DW$277, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2711                            .dwattr $C$DW$277, DW_AT_decl_line(0x2b6)
    2712                            .dwattr $C$DW$277, DW_AT_decl_column(0x0b)
    2713                    
    2714                    $C$DW$278       .dwtag  DW_TAG_member
    2715                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    2716                            .dwattr $C$DW$278, DW_AT_name("status")
    2717                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("status")
    2718                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2719                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    2720                            .dwattr $C$DW$278, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2721                            .dwattr $C$DW$278, DW_AT_decl_line(0x2b7)
    2722                            .dwattr $C$DW$278, DW_AT_decl_column(0x0b)
    2723                    
    2724                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2725                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x2b5)
    2726                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    2727                            .dwendtag $C$DW$T$42
    2728                    
    2729                    $C$DW$T$83      .dwtag  DW_TAG_typedef
    2730                            .dwattr $C$DW$T$83, DW_AT_name("macEventHdr_t")
    2731                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$42)
    2732                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2733                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2734                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x2b8)
    2735                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    2736                    
    2737                    
    2738                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2739                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x0c)
    2740                    $C$DW$279       .dwtag  DW_TAG_member
    2741                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$43)
    2742                            .dwattr $C$DW$279, DW_AT_name("keySource")
    2743                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("keySource")
    2744                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2745                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    2746                            .dwattr $C$DW$279, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2747                            .dwattr $C$DW$279, DW_AT_decl_line(0x2bd)
    2748                            .dwattr $C$DW$279, DW_AT_decl_column(0x0b)
    2749                    
    2750                    $C$DW$280       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   51

    2751                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    2752                            .dwattr $C$DW$280, DW_AT_name("securityLevel")
    2753                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("securityLevel")
    2754                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2755                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    2756                            .dwattr $C$DW$280, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2757                            .dwattr $C$DW$280, DW_AT_decl_line(0x2be)
    2758                            .dwattr $C$DW$280, DW_AT_decl_column(0x0b)
    2759                    
    2760                    $C$DW$281       .dwtag  DW_TAG_member
    2761                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    2762                            .dwattr $C$DW$281, DW_AT_name("keyIdMode")
    2763                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("keyIdMode")
    2764                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2765                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    2766                            .dwattr $C$DW$281, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2767                            .dwattr $C$DW$281, DW_AT_decl_line(0x2bf)
    2768                            .dwattr $C$DW$281, DW_AT_decl_column(0x0b)
    2769                    
    2770                    $C$DW$282       .dwtag  DW_TAG_member
    2771                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$21)
    2772                            .dwattr $C$DW$282, DW_AT_name("keyIndex")
    2773                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("keyIndex")
    2774                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2775                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    2776                            .dwattr $C$DW$282, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2777                            .dwattr $C$DW$282, DW_AT_decl_line(0x2c0)
    2778                            .dwattr $C$DW$282, DW_AT_decl_column(0x0b)
    2779                    
    2780                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2781                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2bc)
    2782                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2783                            .dwendtag $C$DW$T$44
    2784                    
    2785                    $C$DW$T$531     .dwtag  DW_TAG_typedef
    2786                            .dwattr $C$DW$T$531, DW_AT_name("macSec_t")
    2787                            .dwattr $C$DW$T$531, DW_AT_type(*$C$DW$T$44)
    2788                            .dwattr $C$DW$T$531, DW_AT_language(DW_LANG_C)
    2789                            .dwattr $C$DW$T$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    2790                            .dwattr $C$DW$T$531, DW_AT_decl_line(0x2c1)
    2791                            .dwattr $C$DW$T$531, DW_AT_decl_column(0x03)
    2792                    
    2793                    
    2794                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2795                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x0a)
    2796                    $C$DW$283       .dwtag  DW_TAG_member
    2797                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$45)
    2798                            .dwattr $C$DW$283, DW_AT_name("lookupData")
    2799                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("lookupData")
    2800                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2801                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    2802                            .dwattr $C$DW$283, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2803                            .dwattr $C$DW$283, DW_AT_decl_line(0x2c6)
    2804                            .dwattr $C$DW$283, DW_AT_decl_column(0x16)
    2805                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   52

    2806                    $C$DW$284       .dwtag  DW_TAG_member
    2807                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    2808                            .dwattr $C$DW$284, DW_AT_name("lookupDataSize")
    2809                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("lookupDataSize")
    2810                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2811                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    2812                            .dwattr $C$DW$284, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2813                            .dwattr $C$DW$284, DW_AT_decl_line(0x2c7)
    2814                            .dwattr $C$DW$284, DW_AT_decl_column(0x16)
    2815                    
    2816                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2817                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2c5)
    2818                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    2819                            .dwendtag $C$DW$T$46
    2820                    
    2821                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    2822                            .dwattr $C$DW$T$49, DW_AT_name("keyIdLookupDescriptor_t")
    2823                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$46)
    2824                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2825                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2826                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x2c8)
    2827                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
    2828                    
    2829                    $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    2830                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    2831                            .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    2832                    
    2833                    
    2834                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2835                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    2836                    $C$DW$285       .dwtag  DW_TAG_member
    2837                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
    2838                            .dwattr $C$DW$285, DW_AT_name("deviceDescriptorHandle")
    2839                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    2840                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2841                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    2842                            .dwattr $C$DW$285, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2843                            .dwattr $C$DW$285, DW_AT_decl_line(0x2cd)
    2844                            .dwattr $C$DW$285, DW_AT_decl_column(0x16)
    2845                    
    2846                    $C$DW$286       .dwtag  DW_TAG_member
    2847                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$23)
    2848                            .dwattr $C$DW$286, DW_AT_name("uniqueDevice")
    2849                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("uniqueDevice")
    2850                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2851                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    2852                            .dwattr $C$DW$286, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2853                            .dwattr $C$DW$286, DW_AT_decl_line(0x2ce)
    2854                            .dwattr $C$DW$286, DW_AT_decl_column(0x16)
    2855                    
    2856                    $C$DW$287       .dwtag  DW_TAG_member
    2857                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$23)
    2858                            .dwattr $C$DW$287, DW_AT_name("blackListed")
    2859                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("blackListed")
    2860                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   53

    2861                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    2862                            .dwattr $C$DW$287, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2863                            .dwattr $C$DW$287, DW_AT_decl_line(0x2cf)
    2864                            .dwattr $C$DW$287, DW_AT_decl_column(0x16)
    2865                    
    2866                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2867                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2cc)
    2868                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    2869                            .dwendtag $C$DW$T$47
    2870                    
    2871                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    2872                            .dwattr $C$DW$T$51, DW_AT_name("keyDeviceDescriptor_t")
    2873                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$47)
    2874                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2875                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2876                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x2d0)
    2877                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    2878                    
    2879                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    2880                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    2881                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    2882                    
    2883                    
    2884                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2885                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2886                    $C$DW$288       .dwtag  DW_TAG_member
    2887                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    2888                            .dwattr $C$DW$288, DW_AT_name("frameType")
    2889                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("frameType")
    2890                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2891                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    2892                            .dwattr $C$DW$288, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2893                            .dwattr $C$DW$288, DW_AT_decl_line(0x2d5)
    2894                            .dwattr $C$DW$288, DW_AT_decl_column(0x16)
    2895                    
    2896                    $C$DW$289       .dwtag  DW_TAG_member
    2897                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    2898                            .dwattr $C$DW$289, DW_AT_name("cmdFrameId")
    2899                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("cmdFrameId")
    2900                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2901                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    2902                            .dwattr $C$DW$289, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2903                            .dwattr $C$DW$289, DW_AT_decl_line(0x2d6)
    2904                            .dwattr $C$DW$289, DW_AT_decl_column(0x16)
    2905                    
    2906                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    2907                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2d4)
    2908                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    2909                            .dwendtag $C$DW$T$48
    2910                    
    2911                    $C$DW$T$53      .dwtag  DW_TAG_typedef
    2912                            .dwattr $C$DW$T$53, DW_AT_name("keyUsageDescriptor_t")
    2913                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$48)
    2914                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2915                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   54

    2916                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x2d7)
    2917                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
    2918                    
    2919                    $C$DW$T$54      .dwtag  DW_TAG_pointer_type
    2920                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    2921                            .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    2922                    
    2923                    
    2924                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2925                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x2c)
    2926                    $C$DW$290       .dwtag  DW_TAG_member
    2927                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$50)
    2928                            .dwattr $C$DW$290, DW_AT_name("keyIdLookupList")
    2929                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("keyIdLookupList")
    2930                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2931                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    2932                            .dwattr $C$DW$290, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2933                            .dwattr $C$DW$290, DW_AT_decl_line(0x2dc)
    2934                            .dwattr $C$DW$290, DW_AT_decl_column(0x1d)
    2935                    
    2936                    $C$DW$291       .dwtag  DW_TAG_member
    2937                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    2938                            .dwattr $C$DW$291, DW_AT_name("keyIdLookupEntries")
    2939                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("keyIdLookupEntries")
    2940                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2941                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    2942                            .dwattr $C$DW$291, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2943                            .dwattr $C$DW$291, DW_AT_decl_line(0x2dd)
    2944                            .dwattr $C$DW$291, DW_AT_decl_column(0x1c)
    2945                    
    2946                    $C$DW$292       .dwtag  DW_TAG_member
    2947                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$52)
    2948                            .dwattr $C$DW$292, DW_AT_name("keyDeviceList")
    2949                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("keyDeviceList")
    2950                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2951                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    2952                            .dwattr $C$DW$292, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2953                            .dwattr $C$DW$292, DW_AT_decl_line(0x2df)
    2954                            .dwattr $C$DW$292, DW_AT_decl_column(0x1d)
    2955                    
    2956                    $C$DW$293       .dwtag  DW_TAG_member
    2957                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$21)
    2958                            .dwattr $C$DW$293, DW_AT_name("keyDeviceListEntries")
    2959                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("keyDeviceListEntries")
    2960                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2961                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    2962                            .dwattr $C$DW$293, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2963                            .dwattr $C$DW$293, DW_AT_decl_line(0x2e2)
    2964                            .dwattr $C$DW$293, DW_AT_decl_column(0x1d)
    2965                    
    2966                    $C$DW$294       .dwtag  DW_TAG_member
    2967                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$54)
    2968                            .dwattr $C$DW$294, DW_AT_name("keyUsageList")
    2969                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("keyUsageList")
    2970                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   55

    2971                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    2972                            .dwattr $C$DW$294, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2973                            .dwattr $C$DW$294, DW_AT_decl_line(0x2e4)
    2974                            .dwattr $C$DW$294, DW_AT_decl_column(0x1d)
    2975                    
    2976                    $C$DW$295       .dwtag  DW_TAG_member
    2977                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    2978                            .dwattr $C$DW$295, DW_AT_name("keyUsageListEntries")
    2979                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("keyUsageListEntries")
    2980                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2981                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    2982                            .dwattr $C$DW$295, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2983                            .dwattr $C$DW$295, DW_AT_decl_line(0x2e6)
    2984                            .dwattr $C$DW$295, DW_AT_decl_column(0x1c)
    2985                    
    2986                    $C$DW$296       .dwtag  DW_TAG_member
    2987                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$55)
    2988                            .dwattr $C$DW$296, DW_AT_name("key")
    2989                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("key")
    2990                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2991                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    2992                            .dwattr $C$DW$296, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    2993                            .dwattr $C$DW$296, DW_AT_decl_line(0x2e8)
    2994                            .dwattr $C$DW$296, DW_AT_decl_column(0x1c)
    2995                    
    2996                    $C$DW$297       .dwtag  DW_TAG_member
    2997                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$40)
    2998                            .dwattr $C$DW$297, DW_AT_name("frameCounter")
    2999                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("frameCounter")
    3000                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3001                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3002                            .dwattr $C$DW$297, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3003                            .dwattr $C$DW$297, DW_AT_decl_line(0x2e9)
    3004                            .dwattr $C$DW$297, DW_AT_decl_column(0x1c)
    3005                    
    3006                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3007                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x2db)
    3008                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    3009                            .dwendtag $C$DW$T$56
    3010                    
    3011                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    3012                            .dwattr $C$DW$T$73, DW_AT_name("keyDescriptor_t")
    3013                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$56)
    3014                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3015                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3016                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x2ec)
    3017                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    3018                    
    3019                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    3020                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    3021                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    3022                    
    3023                    
    3024                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3025                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x08)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   56

    3026                    $C$DW$298       .dwtag  DW_TAG_member
    3027                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$40)
    3028                            .dwattr $C$DW$298, DW_AT_name("frameCounter")
    3029                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("frameCounter")
    3030                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3031                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3032                            .dwattr $C$DW$298, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3033                            .dwattr $C$DW$298, DW_AT_decl_line(0x2f1)
    3034                            .dwattr $C$DW$298, DW_AT_decl_column(0x18)
    3035                    
    3036                    $C$DW$299       .dwtag  DW_TAG_member
    3037                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$21)
    3038                            .dwattr $C$DW$299, DW_AT_name("frameCntrIdx")
    3039                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("frameCntrIdx")
    3040                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3041                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3042                            .dwattr $C$DW$299, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3043                            .dwattr $C$DW$299, DW_AT_decl_line(0x2f2)
    3044                            .dwattr $C$DW$299, DW_AT_decl_column(0x18)
    3045                    
    3046                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3047                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x2f0)
    3048                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
    3049                            .dwendtag $C$DW$T$57
    3050                    
    3051                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    3052                            .dwattr $C$DW$T$60, DW_AT_name("frameCntr_t")
    3053                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$57)
    3054                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3055                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3056                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x2f3)
    3057                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    3058                    
    3059                    $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    3060                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    3061                            .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    3062                    
    3063                    
    3064                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
    3065                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x14)
    3066                    $C$DW$300       .dwtag  DW_TAG_member
    3067                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$21)
    3068                            .dwattr $C$DW$300, DW_AT_name("panID")
    3069                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("panID")
    3070                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3071                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3072                            .dwattr $C$DW$300, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3073                            .dwattr $C$DW$300, DW_AT_decl_line(0x2f8)
    3074                            .dwattr $C$DW$300, DW_AT_decl_column(0x16)
    3075                    
    3076                    $C$DW$301       .dwtag  DW_TAG_member
    3077                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$21)
    3078                            .dwattr $C$DW$301, DW_AT_name("shortAddress")
    3079                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("shortAddress")
    3080                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   57

    3081                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3082                            .dwattr $C$DW$301, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3083                            .dwattr $C$DW$301, DW_AT_decl_line(0x2f9)
    3084                            .dwattr $C$DW$301, DW_AT_decl_column(0x16)
    3085                    
    3086                    $C$DW$302       .dwtag  DW_TAG_member
    3087                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$59)
    3088                            .dwattr $C$DW$302, DW_AT_name("extAddress")
    3089                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("extAddress")
    3090                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3091                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3092                            .dwattr $C$DW$302, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3093                            .dwattr $C$DW$302, DW_AT_decl_line(0x2fa)
    3094                            .dwattr $C$DW$302, DW_AT_decl_column(0x16)
    3095                    
    3096                    $C$DW$303       .dwtag  DW_TAG_member
    3097                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$61)
    3098                            .dwattr $C$DW$303, DW_AT_name("frameCtr")
    3099                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("frameCtr")
    3100                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3101                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3102                            .dwattr $C$DW$303, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3103                            .dwattr $C$DW$303, DW_AT_decl_line(0x2fd)
    3104                            .dwattr $C$DW$303, DW_AT_decl_column(0x19)
    3105                    
    3106                    $C$DW$304       .dwtag  DW_TAG_member
    3107                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$23)
    3108                            .dwattr $C$DW$304, DW_AT_name("exempt")
    3109                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("exempt")
    3110                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3111                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3112                            .dwattr $C$DW$304, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3113                            .dwattr $C$DW$304, DW_AT_decl_line(0x303)
    3114                            .dwattr $C$DW$304, DW_AT_decl_column(0x16)
    3115                    
    3116                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3117                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x2f7)
    3118                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
    3119                            .dwendtag $C$DW$T$62
    3120                    
    3121                    $C$DW$T$68      .dwtag  DW_TAG_typedef
    3122                            .dwattr $C$DW$T$68, DW_AT_name("deviceDescriptor_t")
    3123                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$62)
    3124                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3125                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3126                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x305)
    3127                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    3128                    
    3129                    $C$DW$T$177     .dwtag  DW_TAG_pointer_type
    3130                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$68)
    3131                            .dwattr $C$DW$T$177, DW_AT_address_class(0x20)
    3132                    
    3133                    
    3134                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3135                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   58

    3136                    $C$DW$305       .dwtag  DW_TAG_member
    3137                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    3138                            .dwattr $C$DW$305, DW_AT_name("frameType")
    3139                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("frameType")
    3140                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3141                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3142                            .dwattr $C$DW$305, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3143                            .dwattr $C$DW$305, DW_AT_decl_line(0x30a)
    3144                            .dwattr $C$DW$305, DW_AT_decl_column(0x16)
    3145                    
    3146                    $C$DW$306       .dwtag  DW_TAG_member
    3147                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    3148                            .dwattr $C$DW$306, DW_AT_name("commandFrameIdentifier")
    3149                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("commandFrameIdentifier")
    3150                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3151                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3152                            .dwattr $C$DW$306, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3153                            .dwattr $C$DW$306, DW_AT_decl_line(0x30b)
    3154                            .dwattr $C$DW$306, DW_AT_decl_column(0x16)
    3155                    
    3156                    $C$DW$307       .dwtag  DW_TAG_member
    3157                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
    3158                            .dwattr $C$DW$307, DW_AT_name("securityMinimum")
    3159                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("securityMinimum")
    3160                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3161                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3162                            .dwattr $C$DW$307, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3163                            .dwattr $C$DW$307, DW_AT_decl_line(0x30c)
    3164                            .dwattr $C$DW$307, DW_AT_decl_column(0x16)
    3165                    
    3166                    $C$DW$308       .dwtag  DW_TAG_member
    3167                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$23)
    3168                            .dwattr $C$DW$308, DW_AT_name("securityOverrideSecurityMinimum")
    3169                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("securityOverrideSecurityMinimum")
    3170                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3171                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3172                            .dwattr $C$DW$308, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3173                            .dwattr $C$DW$308, DW_AT_decl_line(0x30e)
    3174                            .dwattr $C$DW$308, DW_AT_decl_column(0x16)
    3175                    
    3176                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3177                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x309)
    3178                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    3179                            .dwendtag $C$DW$T$63
    3180                    
    3181                    $C$DW$T$70      .dwtag  DW_TAG_typedef
    3182                            .dwattr $C$DW$T$70, DW_AT_name("securityLevelDescriptor_t")
    3183                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$63)
    3184                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3185                            .dwattr $C$DW$T$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3186                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x317)
    3187                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x03)
    3188                    
    3189                    
    3190                    $C$DW$T$178     .dwtag  DW_TAG_array_type
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   59

    3191                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$70)
    3192                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    3193                            .dwattr $C$DW$T$178, DW_AT_byte_size(0x08)
    3194                    $C$DW$309       .dwtag  DW_TAG_subrange_type
    3195                            .dwattr $C$DW$309, DW_AT_upper_bound(0x01)
    3196                    
    3197                            .dwendtag $C$DW$T$178
    3198                    
    3199                    
    3200                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    3201                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x0e)
    3202                    $C$DW$310       .dwtag  DW_TAG_member
    3203                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$21)
    3204                            .dwattr $C$DW$310, DW_AT_name("key_index")
    3205                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("key_index")
    3206                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3207                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3208                            .dwattr $C$DW$310, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3209                            .dwattr $C$DW$310, DW_AT_decl_line(0x31c)
    3210                            .dwattr $C$DW$310, DW_AT_decl_column(0x1b)
    3211                    
    3212                    $C$DW$311       .dwtag  DW_TAG_member
    3213                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    3214                            .dwattr $C$DW$311, DW_AT_name("key_id_lookup_index")
    3215                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("key_id_lookup_index")
    3216                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3217                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3218                            .dwattr $C$DW$311, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3219                            .dwattr $C$DW$311, DW_AT_decl_line(0x31d)
    3220                            .dwattr $C$DW$311, DW_AT_decl_column(0x1b)
    3221                    
    3222                    $C$DW$312       .dwtag  DW_TAG_member
    3223                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$49)
    3224                            .dwattr $C$DW$312, DW_AT_name("macKeyIdLookupEntry")
    3225                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("macKeyIdLookupEntry")
    3226                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3227                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3228                            .dwattr $C$DW$312, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3229                            .dwattr $C$DW$312, DW_AT_decl_line(0x31e)
    3230                            .dwattr $C$DW$312, DW_AT_decl_column(0x1b)
    3231                    
    3232                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3233                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x31b)
    3234                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x01)
    3235                            .dwendtag $C$DW$T$64
    3236                    
    3237                    $C$DW$T$532     .dwtag  DW_TAG_typedef
    3238                            .dwattr $C$DW$T$532, DW_AT_name("macSecurityPibKeyIdLookupEntry_t")
    3239                            .dwattr $C$DW$T$532, DW_AT_type(*$C$DW$T$64)
    3240                            .dwattr $C$DW$T$532, DW_AT_language(DW_LANG_C)
    3241                            .dwattr $C$DW$T$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3242                            .dwattr $C$DW$T$532, DW_AT_decl_line(0x31f)
    3243                            .dwattr $C$DW$T$532, DW_AT_decl_column(0x03)
    3244                    
    3245                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   60

    3246                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3247                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x08)
    3248                    $C$DW$313       .dwtag  DW_TAG_member
    3249                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$21)
    3250                            .dwattr $C$DW$313, DW_AT_name("key_index")
    3251                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("key_index")
    3252                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3253                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3254                            .dwattr $C$DW$313, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3255                            .dwattr $C$DW$313, DW_AT_decl_line(0x323)
    3256                            .dwattr $C$DW$313, DW_AT_decl_column(0x1b)
    3257                    
    3258                    $C$DW$314       .dwtag  DW_TAG_member
    3259                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$21)
    3260                            .dwattr $C$DW$314, DW_AT_name("key_device_index")
    3261                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("key_device_index")
    3262                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3263                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3264                            .dwattr $C$DW$314, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3265                            .dwattr $C$DW$314, DW_AT_decl_line(0x324)
    3266                            .dwattr $C$DW$314, DW_AT_decl_column(0x1b)
    3267                    
    3268                    $C$DW$315       .dwtag  DW_TAG_member
    3269                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$51)
    3270                            .dwattr $C$DW$315, DW_AT_name("macKeyDeviceEntry")
    3271                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("macKeyDeviceEntry")
    3272                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3273                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3274                            .dwattr $C$DW$315, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3275                            .dwattr $C$DW$315, DW_AT_decl_line(0x325)
    3276                            .dwattr $C$DW$315, DW_AT_decl_column(0x1b)
    3277                    
    3278                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3279                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x322)
    3280                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
    3281                            .dwendtag $C$DW$T$65
    3282                    
    3283                    $C$DW$T$533     .dwtag  DW_TAG_typedef
    3284                            .dwattr $C$DW$T$533, DW_AT_name("macSecurityPibKeyDeviceEntry_t")
    3285                            .dwattr $C$DW$T$533, DW_AT_type(*$C$DW$T$65)
    3286                            .dwattr $C$DW$T$533, DW_AT_language(DW_LANG_C)
    3287                            .dwattr $C$DW$T$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3288                            .dwattr $C$DW$T$533, DW_AT_decl_line(0x326)
    3289                            .dwattr $C$DW$T$533, DW_AT_decl_column(0x03)
    3290                    
    3291                    
    3292                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    3293                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x06)
    3294                    $C$DW$316       .dwtag  DW_TAG_member
    3295                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$21)
    3296                            .dwattr $C$DW$316, DW_AT_name("key_index")
    3297                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("key_index")
    3298                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3299                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3300                            .dwattr $C$DW$316, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   61

    3301                            .dwattr $C$DW$316, DW_AT_decl_line(0x32a)
    3302                            .dwattr $C$DW$316, DW_AT_decl_column(0x1b)
    3303                    
    3304                    $C$DW$317       .dwtag  DW_TAG_member
    3305                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    3306                            .dwattr $C$DW$317, DW_AT_name("key_key_usage_index")
    3307                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("key_key_usage_index")
    3308                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3309                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3310                            .dwattr $C$DW$317, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3311                            .dwattr $C$DW$317, DW_AT_decl_line(0x32b)
    3312                            .dwattr $C$DW$317, DW_AT_decl_column(0x1b)
    3313                    
    3314                    $C$DW$318       .dwtag  DW_TAG_member
    3315                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$53)
    3316                            .dwattr $C$DW$318, DW_AT_name("macKeyUsageEntry")
    3317                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("macKeyUsageEntry")
    3318                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3319                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3320                            .dwattr $C$DW$318, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3321                            .dwattr $C$DW$318, DW_AT_decl_line(0x32c)
    3322                            .dwattr $C$DW$318, DW_AT_decl_column(0x1b)
    3323                    
    3324                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3325                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x329)
    3326                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
    3327                            .dwendtag $C$DW$T$66
    3328                    
    3329                    $C$DW$T$534     .dwtag  DW_TAG_typedef
    3330                            .dwattr $C$DW$T$534, DW_AT_name("macSecurityPibKeyUsageEntry_t")
    3331                            .dwattr $C$DW$T$534, DW_AT_type(*$C$DW$T$66)
    3332                            .dwattr $C$DW$T$534, DW_AT_language(DW_LANG_C)
    3333                            .dwattr $C$DW$T$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3334                            .dwattr $C$DW$T$534, DW_AT_decl_line(0x32d)
    3335                            .dwattr $C$DW$T$534, DW_AT_decl_column(0x03)
    3336                    
    3337                    
    3338                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    3339                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x18)
    3340                    $C$DW$319       .dwtag  DW_TAG_member
    3341                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$21)
    3342                            .dwattr $C$DW$319, DW_AT_name("key_index")
    3343                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("key_index")
    3344                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3345                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3346                            .dwattr $C$DW$319, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3347                            .dwattr $C$DW$319, DW_AT_decl_line(0x331)
    3348                            .dwattr $C$DW$319, DW_AT_decl_column(0x1b)
    3349                    
    3350                    $C$DW$320       .dwtag  DW_TAG_member
    3351                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$55)
    3352                            .dwattr $C$DW$320, DW_AT_name("keyEntry")
    3353                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("keyEntry")
    3354                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3355                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:32 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C4F0B2E7-6396-45EB-BDB8-15BE11EEED45} PAGE   62

    3356                            .dwattr $C$DW$320, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3357                            .dwattr $C$DW$320, DW_AT_decl_line(0x332)
    3358                            .dwattr $C$DW$320, DW_AT_decl_column(0x1b)
    3359                    
    3360                    $C$DW$321       .dwtag  DW_TAG_member
    3361                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$40)
    3362                            .dwattr $C$DW$321, DW_AT_name("frameCounter")
    3363                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("frameCounter")
    3364                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3365                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3366                            .dwattr $C$DW$321, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3367                            .dwattr $C$DW$321, DW_AT_decl_line(0x333)
    3368                            .dwattr $C$DW$321, DW_AT_decl_column(0x1b)
    3369                    
    3370                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    3371                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x330)
    3372                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    3373                            .dwendtag $C$DW$T$67
    3374                    
    3375                    $C$DW$T$535     .dwtag  DW_TAG_typedef
    3376                            .dwattr $C$DW$T$535, DW_AT_name("macSecurityPibKeyEntry_t")
    3377                            .dwattr $C$DW$T$535, DW_AT_type(*$C$DW$T$67)
    3378                            .dwattr $C$DW$T$535, DW_AT_language(DW_LANG_C)
    3379                            .dwattr $C$DW$T$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3380                            .dwattr $C$DW$T$535, DW_AT_decl_line(0x334)
    3381                            .dwattr $C$DW$T$535, DW_AT_decl_column(0x03)
    3382                    
