TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Mon Dec 10 17:47:36 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/osaltasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\sensor_c
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4247                            .dwattr $C$DW$430, DW_AT_const_value(0x08)
    4248                            .dwattr $C$DW$430, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4249                            .dwattr $C$DW$430, DW_AT_decl_line(0xa8)
    4250                            .dwattr $C$DW$430, DW_AT_decl_column(0x05)
    4251                    
    4252                    $C$DW$431       .dwtag  DW_TAG_enumerator
    4253                            .dwattr $C$DW$431, DW_AT_name("FAPI_VALIDATE_SECTOR")
    4254                            .dwattr $C$DW$431, DW_AT_const_value(0x0e)
    4255                            .dwattr $C$DW$431, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4256                            .dwattr $C$DW$431, DW_AT_decl_line(0xa9)
    4257                            .dwattr $C$DW$431, DW_AT_decl_column(0x05)
    4258                    
    4259                    $C$DW$432       .dwtag  DW_TAG_enumerator
    4260                            .dwattr $C$DW$432, DW_AT_name("FAPI_CLEAR_STATUS")
    4261                            .dwattr $C$DW$432, DW_AT_const_value(0x10)
    4262                            .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4263                            .dwattr $C$DW$432, DW_AT_decl_line(0xaa)
    4264                            .dwattr $C$DW$432, DW_AT_decl_column(0x05)
    4265                    
    4266                    $C$DW$433       .dwtag  DW_TAG_enumerator
    4267                            .dwattr $C$DW$433, DW_AT_name("FAPI_PROGRAM_RESUME")
    4268                            .dwattr $C$DW$433, DW_AT_const_value(0x14)
    4269                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4270                            .dwattr $C$DW$433, DW_AT_decl_line(0xab)
    4271                            .dwattr $C$DW$433, DW_AT_decl_column(0x05)
    4272                    
    4273                    $C$DW$434       .dwtag  DW_TAG_enumerator
    4274                            .dwattr $C$DW$434, DW_AT_name("FAPI_ERASE_RESUME")
    4275                            .dwattr $C$DW$434, DW_AT_const_value(0x16)
    4276                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4277                            .dwattr $C$DW$434, DW_AT_decl_line(0xac)
    4278                            .dwattr $C$DW$434, DW_AT_decl_column(0x05)
    4279                    
    4280                    $C$DW$435       .dwtag  DW_TAG_enumerator
    4281                            .dwattr $C$DW$435, DW_AT_name("FAPI_CLEAR_MORE")
    4282                            .dwattr $C$DW$435, DW_AT_const_value(0x18)
    4283                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4284                            .dwattr $C$DW$435, DW_AT_decl_line(0xad)
    4285                            .dwattr $C$DW$435, DW_AT_decl_column(0x05)
    4286                    
    4287                    $C$DW$436       .dwtag  DW_TAG_enumerator
    4288                            .dwattr $C$DW$436, DW_AT_name("FAPI_PROGRAM_SECTOR")
    4289                            .dwattr $C$DW$436, DW_AT_const_value(0x20)
    4290                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   79

    4291                            .dwattr $C$DW$436, DW_AT_decl_line(0xae)
    4292                            .dwattr $C$DW$436, DW_AT_decl_column(0x05)
    4293                    
    4294                    $C$DW$437       .dwtag  DW_TAG_enumerator
    4295                            .dwattr $C$DW$437, DW_AT_name("FAPI_ERASE_OTP")
    4296                            .dwattr $C$DW$437, DW_AT_const_value(0x30)
    4297                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4298                            .dwattr $C$DW$437, DW_AT_decl_line(0xaf)
    4299                            .dwattr $C$DW$437, DW_AT_decl_column(0x05)
    4300                    
    4301                            .dwattr $C$DW$T$1058, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4302                            .dwattr $C$DW$T$1058, DW_AT_decl_line(0xa5)
    4303                            .dwattr $C$DW$T$1058, DW_AT_decl_column(0x01)
    4304                            .dwendtag $C$DW$T$1058
    4305                    
    4306                    $C$DW$T$1059    .dwtag  DW_TAG_typedef
    4307                            .dwattr $C$DW$T$1059, DW_AT_name("tFlashStateCommandsType")
    4308                            .dwattr $C$DW$T$1059, DW_AT_type(*$C$DW$T$1058)
    4309                            .dwattr $C$DW$T$1059, DW_AT_language(DW_LANG_C)
    4310                            .dwattr $C$DW$T$1059, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4311                            .dwattr $C$DW$T$1059, DW_AT_decl_line(0xb0)
    4312                            .dwattr $C$DW$T$1059, DW_AT_decl_column(0x03)
    4313                    
    4314                    
    4315                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4316                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    4317                    $C$DW$438       .dwtag  DW_TAG_member
    4318                            .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$19)
    4319                            .dwattr $C$DW$438, DW_AT_name("rfMode")
    4320                            .dwattr $C$DW$438, DW_AT_TI_symbol_name("rfMode")
    4321                            .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4322                            .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    4323                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4324                            .dwattr $C$DW$438, DW_AT_decl_line(0x421)
    4325                            .dwattr $C$DW$438, DW_AT_decl_column(0x0d)
    4326                    
    4327                    $C$DW$439       .dwtag  DW_TAG_member
    4328                            .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$21)
    4329                            .dwattr $C$DW$439, DW_AT_name("cpePatchFxn")
    4330                            .dwattr $C$DW$439, DW_AT_TI_symbol_name("cpePatchFxn")
    4331                            .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4332                            .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    4333                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4334                            .dwattr $C$DW$439, DW_AT_decl_line(0x422)
    4335                            .dwattr $C$DW$439, DW_AT_decl_column(0x0c)
    4336                    
    4337                    $C$DW$440       .dwtag  DW_TAG_member
    4338                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$21)
    4339                            .dwattr $C$DW$440, DW_AT_name("mcePatchFxn")
    4340                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("mcePatchFxn")
    4341                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4342                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4343                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4344                            .dwattr $C$DW$440, DW_AT_decl_line(0x423)
    4345                            .dwattr $C$DW$440, DW_AT_decl_column(0x0c)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   80

    4346                    
    4347                    $C$DW$441       .dwtag  DW_TAG_member
    4348                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$21)
    4349                            .dwattr $C$DW$441, DW_AT_name("rfePatchFxn")
    4350                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("rfePatchFxn")
    4351                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4352                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4353                            .dwattr $C$DW$441, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4354                            .dwattr $C$DW$441, DW_AT_decl_line(0x424)
    4355                            .dwattr $C$DW$441, DW_AT_decl_column(0x0c)
    4356                    
    4357                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4358                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x420)
    4359                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4360                            .dwendtag $C$DW$T$22
    4361                    
    4362                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    4363                            .dwattr $C$DW$T$33, DW_AT_name("RF_Mode")
    4364                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$22)
    4365                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4366                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4367                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x425)
    4368                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x03)
    4369                    
    4370                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4371                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4372                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4373                    
    4374                    
    4375                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4376                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    4377                    $C$DW$442       .dwtag  DW_TAG_member
    4378                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$23)
    4379                            .dwattr $C$DW$442, DW_AT_name("rawValue")
    4380                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("rawValue")
    4381                            .dwattr $C$DW$442, DW_AT_bit_offset(0x0a)
    4382                            .dwattr $C$DW$442, DW_AT_bit_size(0x16)
    4383                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4384                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4385                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4386                            .dwattr $C$DW$442, DW_AT_decl_line(0x3d6)
    4387                            .dwattr $C$DW$442, DW_AT_decl_column(0x0e)
    4388                    
    4389                    $C$DW$443       .dwtag  DW_TAG_member
    4390                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$23)
    4391                            .dwattr $C$DW$443, DW_AT_name("__dummy")
    4392                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("__dummy")
    4393                            .dwattr $C$DW$443, DW_AT_bit_offset(0x01)
    4394                            .dwattr $C$DW$443, DW_AT_bit_size(0x09)
    4395                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4396                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4397                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4398                            .dwattr $C$DW$443, DW_AT_decl_line(0x3da)
    4399                            .dwattr $C$DW$443, DW_AT_decl_column(0x0e)
    4400                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   81

    4401                    $C$DW$444       .dwtag  DW_TAG_member
    4402                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$23)
    4403                            .dwattr $C$DW$444, DW_AT_name("paType")
    4404                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("paType")
    4405                            .dwattr $C$DW$444, DW_AT_bit_offset(0x00)
    4406                            .dwattr $C$DW$444, DW_AT_bit_size(0x01)
    4407                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4408                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4409                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4410                            .dwattr $C$DW$444, DW_AT_decl_line(0x3db)
    4411                            .dwattr $C$DW$444, DW_AT_decl_column(0x0e)
    4412                    
    4413                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4414                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x3d5)
    4415                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    4416                            .dwendtag $C$DW$T$24
    4417                    
    4418                    $C$DW$T$26      .dwtag  DW_TAG_typedef
    4419                            .dwattr $C$DW$T$26, DW_AT_name("RF_TxPowerTable_Value")
    4420                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$24)
    4421                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    4422                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4423                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x3df)
    4424                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
    4425                    
    4426                    
    4427                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4428                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x05)
    4429                    $C$DW$445       .dwtag  DW_TAG_member
    4430                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$25)
    4431                            .dwattr $C$DW$445, DW_AT_name("power")
    4432                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("power")
    4433                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4434                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4435                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4436                            .dwattr $C$DW$445, DW_AT_decl_line(0x3f5)
    4437                            .dwattr $C$DW$445, DW_AT_decl_column(0x0c)
    4438                    
    4439                    $C$DW$446       .dwtag  DW_TAG_member
    4440                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$26)
    4441                            .dwattr $C$DW$446, DW_AT_name("value")
    4442                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("value")
    4443                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4444                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4445                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4446                            .dwattr $C$DW$446, DW_AT_decl_line(0x3f8)
    4447                            .dwattr $C$DW$446, DW_AT_decl_column(0x1b)
    4448                    
    4449                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4450                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x3f4)
    4451                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    4452                            .dwendtag $C$DW$T$27
    4453                    
    4454                    $C$DW$T$28      .dwtag  DW_TAG_typedef
    4455                            .dwattr $C$DW$T$28, DW_AT_name("RF_TxPowerTable_Entry")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   82

    4456                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4457                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    4458                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4459                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f9)
    4460                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x1b)
    4461                    
    4462                    $C$DW$T$29      .dwtag  DW_TAG_const_type
    4463                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    4464                    
    4465                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    4466                            .dwattr $C$DW$T$30, DW_AT_name("macTxPwrVal_t")
    4467                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    4468                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    4469                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    4470                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x144)
    4471                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x25)
    4472                    
    4473                    $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    4474                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    4475                            .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    4476                    
    4477                    
    4478                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4479                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    4480                    $C$DW$447       .dwtag  DW_TAG_member
    4481                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$31)
    4482                            .dwattr $C$DW$447, DW_AT_name("pTxPwrVals")
    4483                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("pTxPwrVals")
    4484                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4485                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4486                            .dwattr $C$DW$447, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4487                            .dwattr $C$DW$447, DW_AT_decl_line(0x148)
    4488                            .dwattr $C$DW$447, DW_AT_decl_column(0x12)
    4489                    
    4490                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    4491                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x147)
    4492                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    4493                            .dwendtag $C$DW$T$32
    4494                    
    4495                    $C$DW$T$36      .dwtag  DW_TAG_const_type
    4496                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$32)
    4497                    
    4498                    $C$DW$T$37      .dwtag  DW_TAG_typedef
    4499                            .dwattr $C$DW$T$37, DW_AT_name("macTxPwrTbl_t")
    4500                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    4501                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4502                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    4503                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x149)
    4504                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    4505                    
    4506                    $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4507                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4508                            .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    4509                    
    4510                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   83

    4511                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4512                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x30)
    4513                    $C$DW$448       .dwtag  DW_TAG_member
    4514                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$23)
    4515                            .dwattr $C$DW$448, DW_AT_name("getHwRevision")
    4516                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("getHwRevision")
    4517                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4518                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4519                            .dwattr $C$DW$448, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4520                            .dwattr $C$DW$448, DW_AT_decl_line(0x155)
    4521                            .dwattr $C$DW$448, DW_AT_decl_column(0x1c)
    4522                    
    4523                    $C$DW$449       .dwtag  DW_TAG_member
    4524                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$34)
    4525                            .dwattr $C$DW$449, DW_AT_name("pRfPatchTable")
    4526                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("pRfPatchTable")
    4527                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4528                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4529                            .dwattr $C$DW$449, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4530                            .dwattr $C$DW$449, DW_AT_decl_line(0x156)
    4531                            .dwattr $C$DW$449, DW_AT_decl_column(0x1d)
    4532                    
    4533                    $C$DW$450       .dwtag  DW_TAG_member
    4534                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$35)
    4535                            .dwattr $C$DW$450, DW_AT_name("pRfDrvTblPtr")
    4536                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    4537                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4538                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4539                            .dwattr $C$DW$450, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4540                            .dwattr $C$DW$450, DW_AT_decl_line(0x157)
    4541                            .dwattr $C$DW$450, DW_AT_decl_column(0x1d)
    4542                    
    4543                    $C$DW$451       .dwtag  DW_TAG_member
    4544                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$35)
    4545                            .dwattr $C$DW$451, DW_AT_name("pCryptoDrvTblPtr")
    4546                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
    4547                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4548                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4549                            .dwattr $C$DW$451, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4550                            .dwattr $C$DW$451, DW_AT_decl_line(0x158)
    4551                            .dwattr $C$DW$451, DW_AT_decl_column(0x1d)
    4552                    
    4553                    $C$DW$452       .dwtag  DW_TAG_member
    4554                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$38)
    4555                            .dwattr $C$DW$452, DW_AT_name("pTxPwrTbl")
    4556                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("pTxPwrTbl")
    4557                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4558                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4559                            .dwattr $C$DW$452, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4560                            .dwattr $C$DW$452, DW_AT_decl_line(0x159)
    4561                            .dwattr $C$DW$452, DW_AT_decl_column(0x20)
    4562                    
    4563                    $C$DW$453       .dwtag  DW_TAG_member
    4564                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$39)
    4565                            .dwattr $C$DW$453, DW_AT_name("pOverrides")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   84

    4566                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("pOverrides")
    4567                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4568                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4569                            .dwattr $C$DW$453, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4570                            .dwattr $C$DW$453, DW_AT_decl_line(0x15a)
    4571                            .dwattr $C$DW$453, DW_AT_decl_column(0x1e)
    4572                    
    4573                    $C$DW$454       .dwtag  DW_TAG_member
    4574                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$40)
    4575                            .dwattr $C$DW$454, DW_AT_name("pLoDivider")
    4576                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("pLoDivider")
    4577                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4578                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4579                            .dwattr $C$DW$454, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4580                            .dwattr $C$DW$454, DW_AT_decl_line(0x15b)
    4581                            .dwattr $C$DW$454, DW_AT_decl_column(0x1d)
    4582                    
    4583                    $C$DW$455       .dwtag  DW_TAG_member
    4584                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$19)
    4585                            .dwattr $C$DW$455, DW_AT_name("rfFeModeBias")
    4586                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("rfFeModeBias")
    4587                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4588                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4589                            .dwattr $C$DW$455, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4590                            .dwattr $C$DW$455, DW_AT_decl_line(0x15c)
    4591                            .dwattr $C$DW$455, DW_AT_decl_column(0x1c)
    4592                    
    4593                    $C$DW$456       .dwtag  DW_TAG_member
    4594                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$19)
    4595                            .dwattr $C$DW$456, DW_AT_name("phyId")
    4596                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("phyId")
    4597                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4598                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4599                            .dwattr $C$DW$456, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4600                            .dwattr $C$DW$456, DW_AT_decl_line(0x15d)
    4601                            .dwattr $C$DW$456, DW_AT_decl_column(0x1c)
    4602                    
    4603                    $C$DW$457       .dwtag  DW_TAG_member
    4604                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
    4605                            .dwattr $C$DW$457, DW_AT_name("last")
    4606                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("last")
    4607                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4608                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4609                            .dwattr $C$DW$457, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4610                            .dwattr $C$DW$457, DW_AT_decl_line(0x15e)
    4611                            .dwattr $C$DW$457, DW_AT_decl_column(0x1c)
    4612                    
    4613                    $C$DW$458       .dwtag  DW_TAG_member
    4614                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$43)
    4615                            .dwattr $C$DW$458, DW_AT_name("pSetRE")
    4616                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("pSetRE")
    4617                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4618                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4619                            .dwattr $C$DW$458, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4620                            .dwattr $C$DW$458, DW_AT_decl_line(0x15f)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   85

    4621                            .dwattr $C$DW$458, DW_AT_decl_column(0x1c)
    4622                    
    4623                    $C$DW$459       .dwtag  DW_TAG_member
    4624                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$44)
    4625                            .dwattr $C$DW$459, DW_AT_name("pAssertFP")
    4626                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("pAssertFP")
    4627                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4628                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4629                            .dwattr $C$DW$459, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4630                            .dwattr $C$DW$459, DW_AT_decl_line(0x160)
    4631                            .dwattr $C$DW$459, DW_AT_decl_column(0x1c)
    4632                    
    4633                    $C$DW$460       .dwtag  DW_TAG_member
    4634                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$47)
    4635                            .dwattr $C$DW$460, DW_AT_name("pAntSwitchFP")
    4636                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("pAntSwitchFP")
    4637                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4638                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4639                            .dwattr $C$DW$460, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4640                            .dwattr $C$DW$460, DW_AT_decl_line(0x161)
    4641                            .dwattr $C$DW$460, DW_AT_decl_column(0x1c)
    4642                    
    4643                    $C$DW$461       .dwtag  DW_TAG_member
    4644                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$48)
    4645                            .dwattr $C$DW$461, DW_AT_name("pAntPwrFP")
    4646                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("pAntPwrFP")
    4647                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4648                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4649                            .dwattr $C$DW$461, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4650                            .dwattr $C$DW$461, DW_AT_decl_line(0x162)
    4651                            .dwattr $C$DW$461, DW_AT_decl_column(0x1c)
    4652                    
    4653                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    4654                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x154)
    4655                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    4656                            .dwendtag $C$DW$T$49
    4657                    
    4658                    $C$DW$T$1061    .dwtag  DW_TAG_typedef
    4659                            .dwattr $C$DW$T$1061, DW_AT_name("macUserCfg_t")
    4660                            .dwattr $C$DW$T$1061, DW_AT_type(*$C$DW$T$49)
    4661                            .dwattr $C$DW$T$1061, DW_AT_language(DW_LANG_C)
    4662                            .dwattr $C$DW$T$1061, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/App
    4663                            .dwattr $C$DW$T$1061, DW_AT_decl_line(0x163)
    4664                            .dwattr $C$DW$T$1061, DW_AT_decl_column(0x03)
    4665                    
    4666                    $C$DW$T$1062    .dwtag  DW_TAG_pointer_type
    4667                            .dwattr $C$DW$T$1062, DW_AT_type(*$C$DW$T$1061)
    4668                            .dwattr $C$DW$T$1062, DW_AT_address_class(0x20)
    4669                    
    4670                    
    4671                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4672                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    4673                    $C$DW$462       .dwtag  DW_TAG_member
    4674                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$10)
    4675                            .dwattr $C$DW$462, DW_AT_name("quot")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   86

    4676                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("quot")
    4677                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4678                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4679                            .dwattr $C$DW$462, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4680                            .dwattr $C$DW$462, DW_AT_decl_line(0x5c)
    4681                            .dwattr $C$DW$462, DW_AT_decl_column(0x16)
    4682                    
    4683                    $C$DW$463       .dwtag  DW_TAG_member
    4684                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$10)
    4685                            .dwattr $C$DW$463, DW_AT_name("rem")
    4686                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("rem")
    4687                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4688                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4689                            .dwattr $C$DW$463, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4690                            .dwattr $C$DW$463, DW_AT_decl_line(0x5c)
    4691                            .dwattr $C$DW$463, DW_AT_decl_column(0x1c)
    4692                    
    4693                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
    4694                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x5c)
    4695                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    4696                            .dwendtag $C$DW$T$50
    4697                    
    4698                    $C$DW$T$1063    .dwtag  DW_TAG_typedef
    4699                            .dwattr $C$DW$T$1063, DW_AT_name("div_t")
    4700                            .dwattr $C$DW$T$1063, DW_AT_type(*$C$DW$T$50)
    4701                            .dwattr $C$DW$T$1063, DW_AT_language(DW_LANG_C)
    4702                            .dwattr $C$DW$T$1063, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/includ
    4703                            .dwattr $C$DW$T$1063, DW_AT_decl_line(0x5c)
    4704                            .dwattr $C$DW$T$1063, DW_AT_decl_column(0x23)
    4705                    
    4706                    
    4707                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4708                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x08)
    4709                    $C$DW$464       .dwtag  DW_TAG_member
    4710                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$10)
    4711                            .dwattr $C$DW$464, DW_AT_name("quot")
    4712                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("quot")
    4713                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4714                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4715                            .dwattr $C$DW$464, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4716                            .dwattr $C$DW$464, DW_AT_decl_line(0x5e)
    4717                            .dwattr $C$DW$464, DW_AT_decl_column(0x16)
    4718                    
    4719                    $C$DW$465       .dwtag  DW_TAG_member
    4720                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$10)
    4721                            .dwattr $C$DW$465, DW_AT_name("rem")
    4722                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("rem")
    4723                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4724                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4725                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4726                            .dwattr $C$DW$465, DW_AT_decl_line(0x5e)
    4727                            .dwattr $C$DW$465, DW_AT_decl_column(0x1c)
    4728                    
    4729                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
    4730                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x5e)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   87

    4731                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    4732                            .dwendtag $C$DW$T$51
    4733                    
    4734                    $C$DW$T$1064    .dwtag  DW_TAG_typedef
    4735                            .dwattr $C$DW$T$1064, DW_AT_name("ldiv_t")
    4736                            .dwattr $C$DW$T$1064, DW_AT_type(*$C$DW$T$51)
    4737                            .dwattr $C$DW$T$1064, DW_AT_language(DW_LANG_C)
    4738                            .dwattr $C$DW$T$1064, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/includ
    4739                            .dwattr $C$DW$T$1064, DW_AT_decl_line(0x5e)
    4740                            .dwattr $C$DW$T$1064, DW_AT_decl_column(0x23)
    4741                    
    4742                    
    4743                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    4744                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x10)
    4745                    $C$DW$466       .dwtag  DW_TAG_member
    4746                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$14)
    4747                            .dwattr $C$DW$466, DW_AT_name("quot")
    4748                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("quot")
    4749                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4750                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4751                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4752                            .dwattr $C$DW$466, DW_AT_decl_line(0x61)
    4753                            .dwattr $C$DW$466, DW_AT_decl_column(0x1c)
    4754                    
    4755                    $C$DW$467       .dwtag  DW_TAG_member
    4756                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$14)
    4757                            .dwattr $C$DW$467, DW_AT_name("rem")
    4758                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("rem")
    4759                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4760                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4761                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4762                            .dwattr $C$DW$467, DW_AT_decl_line(0x61)
    4763                            .dwattr $C$DW$467, DW_AT_decl_column(0x22)
    4764                    
    4765                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
    4766                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x61)
    4767                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    4768                            .dwendtag $C$DW$T$52
    4769                    
    4770                    $C$DW$T$1065    .dwtag  DW_TAG_typedef
    4771                            .dwattr $C$DW$T$1065, DW_AT_name("lldiv_t")
    4772                            .dwattr $C$DW$T$1065, DW_AT_type(*$C$DW$T$52)
    4773                            .dwattr $C$DW$T$1065, DW_AT_language(DW_LANG_C)
    4774                            .dwattr $C$DW$T$1065, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/includ
    4775                            .dwattr $C$DW$T$1065, DW_AT_decl_line(0x61)
    4776                            .dwattr $C$DW$T$1065, DW_AT_decl_column(0x29)
    4777                    
    4778                    
    4779                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4780                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x08)
    4781                    $C$DW$468       .dwtag  DW_TAG_member
    4782                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$54)
    4783                            .dwattr $C$DW$468, DW_AT_name("pointerStack")
    4784                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("pointerStack")
    4785                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   88

    4786                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4787                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4788                            .dwattr $C$DW$468, DW_AT_decl_line(0x3f5)
    4789                            .dwattr $C$DW$468, DW_AT_decl_column(0x16)
    4790                    
    4791                    $C$DW$469       .dwtag  DW_TAG_member
    4792                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$55)
    4793                            .dwattr $C$DW$469, DW_AT_name("directAPI")
    4794                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("directAPI")
    4795                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4796                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4797                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4798                            .dwattr $C$DW$469, DW_AT_decl_line(0x3f6)
    4799                            .dwattr $C$DW$469, DW_AT_decl_column(0x15)
    4800                    
    4801                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4802                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x3f4)
    4803                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    4804                            .dwendtag $C$DW$T$56
    4805                    
    4806                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    4807                            .dwattr $C$DW$T$58, DW_AT_name("icall_directAPIMsg_t")
    4808                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$56)
    4809                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4810                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4811                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x3f7)
    4812                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    4813                    
    4814                    
    4815                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    4816                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x14)
    4817                    $C$DW$470       .dwtag  DW_TAG_member
    4818                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$57)
    4819                            .dwattr $C$DW$470, DW_AT_name("hdr")
    4820                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("hdr")
    4821                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4822                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4823                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4824                            .dwattr $C$DW$470, DW_AT_decl_line(0x3fb)
    4825                            .dwattr $C$DW$470, DW_AT_decl_column(0x10)
    4826                    
    4827                    $C$DW$471       .dwtag  DW_TAG_member
    4828                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$58)
    4829                            .dwattr $C$DW$471, DW_AT_name("msg")
    4830                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("msg")
    4831                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4832                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4833                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4834                            .dwattr $C$DW$471, DW_AT_decl_line(0x3fc)
    4835                            .dwattr $C$DW$471, DW_AT_decl_column(0x1a)
    4836                    
    4837                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4838                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x3fa)
    4839                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    4840                            .dwendtag $C$DW$T$59
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   89

    4841                    
    4842                    $C$DW$T$1066    .dwtag  DW_TAG_typedef
    4843                            .dwattr $C$DW$T$1066, DW_AT_name("icallLiteMsg_t")
    4844                            .dwattr $C$DW$T$1066, DW_AT_type(*$C$DW$T$59)
    4845                            .dwattr $C$DW$T$1066, DW_AT_language(DW_LANG_C)
    4846                            .dwattr $C$DW$T$1066, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4847                            .dwattr $C$DW$T$1066, DW_AT_decl_line(0x3fd)
    4848                            .dwattr $C$DW$T$1066, DW_AT_decl_column(0x03)
    4849                    
    4850                    
    4851                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4852                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x0a)
    4853                    $C$DW$472       .dwtag  DW_TAG_member
    4854                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$482)
    4855                            .dwattr $C$DW$472, DW_AT_name("addr")
    4856                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("addr")
    4857                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4858                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4859                            .dwattr $C$DW$472, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4860                            .dwattr $C$DW$472, DW_AT_decl_line(0x55)
    4861                            .dwattr $C$DW$472, DW_AT_decl_column(0x05)
    4862                    
    4863                    $C$DW$473       .dwtag  DW_TAG_member
    4864                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
    4865                            .dwattr $C$DW$473, DW_AT_name("addrMode")
    4866                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("addrMode")
    4867                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4868                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4869                            .dwattr $C$DW$473, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    4870                            .dwattr $C$DW$473, DW_AT_decl_line(0x56)
    4871                            .dwattr $C$DW$473, DW_AT_decl_column(0x13)
    4872                    
    4873                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    4874                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x50)
    4875                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
    4876                            .dwendtag $C$DW$T$60
    4877                    
    4878                    $C$DW$T$376     .dwtag  DW_TAG_typedef
    4879                            .dwattr $C$DW$T$376, DW_AT_name("sAddr_t")
    4880                            .dwattr $C$DW$T$376, DW_AT_type(*$C$DW$T$60)
    4881                            .dwattr $C$DW$T$376, DW_AT_language(DW_LANG_C)
    4882                            .dwattr $C$DW$T$376, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appl
    4883                            .dwattr $C$DW$T$376, DW_AT_decl_line(0x57)
    4884                            .dwattr $C$DW$T$376, DW_AT_decl_column(0x03)
    4885                    
    4886                    $C$DW$T$432     .dwtag  DW_TAG_pointer_type
    4887                            .dwattr $C$DW$T$432, DW_AT_type(*$C$DW$T$376)
    4888                            .dwattr $C$DW$T$432, DW_AT_address_class(0x20)
    4889                    
    4890                    
    4891                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4892                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x0a)
    4893                    $C$DW$474       .dwtag  DW_TAG_member
    4894                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$485)
    4895                            .dwattr $C$DW$474, DW_AT_name("addr")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   90

    4896                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("addr")
    4897                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4898                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4899                            .dwattr $C$DW$474, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4900                            .dwattr $C$DW$474, DW_AT_decl_line(0x139)
    4901                            .dwattr $C$DW$474, DW_AT_decl_column(0x05)
    4902                    
    4903                    $C$DW$475       .dwtag  DW_TAG_member
    4904                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$62)
    4905                            .dwattr $C$DW$475, DW_AT_name("addrMode")
    4906                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("addrMode")
    4907                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4908                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4909                            .dwattr $C$DW$475, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4910                            .dwattr $C$DW$475, DW_AT_decl_line(0x13a)
    4911                            .dwattr $C$DW$475, DW_AT_decl_column(0x08)
    4912                    
    4913                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4914                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x134)
    4915                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    4916                            .dwendtag $C$DW$T$63
    4917                    
    4918                    $C$DW$T$1067    .dwtag  DW_TAG_typedef
    4919                            .dwattr $C$DW$T$1067, DW_AT_name("zAddrType_t")
    4920                            .dwattr $C$DW$T$1067, DW_AT_type(*$C$DW$T$63)
    4921                            .dwattr $C$DW$T$1067, DW_AT_language(DW_LANG_C)
    4922                            .dwattr $C$DW$T$1067, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4923                            .dwattr $C$DW$T$1067, DW_AT_decl_line(0x13b)
    4924                            .dwattr $C$DW$T$1067, DW_AT_decl_column(0x03)
    4925                    
    4926                    
    4927                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4928                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x0c)
    4929                    $C$DW$476       .dwtag  DW_TAG_member
    4930                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$61)
    4931                            .dwattr $C$DW$476, DW_AT_name("txCounter")
    4932                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("txCounter")
    4933                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4934                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4935                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4936                            .dwattr $C$DW$476, DW_AT_decl_line(0x198)
    4937                            .dwattr $C$DW$476, DW_AT_decl_column(0x0a)
    4938                    
    4939                    $C$DW$477       .dwtag  DW_TAG_member
    4940                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$61)
    4941                            .dwattr $C$DW$477, DW_AT_name("txCost")
    4942                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("txCost")
    4943                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4944                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4945                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4946                            .dwattr $C$DW$477, DW_AT_decl_line(0x199)
    4947                            .dwattr $C$DW$477, DW_AT_decl_column(0x0a)
    4948                    
    4949                    $C$DW$478       .dwtag  DW_TAG_member
    4950                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$61)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   91

    4951                            .dwattr $C$DW$478, DW_AT_name("rxLqi")
    4952                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("rxLqi")
    4953                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4954                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4955                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4956                            .dwattr $C$DW$478, DW_AT_decl_line(0x19b)
    4957                            .dwattr $C$DW$478, DW_AT_decl_column(0x0a)
    4958                    
    4959                    $C$DW$479       .dwtag  DW_TAG_member
    4960                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$61)
    4961                            .dwattr $C$DW$479, DW_AT_name("inKeySeqNum")
    4962                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("inKeySeqNum")
    4963                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4964                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4965                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4966                            .dwattr $C$DW$479, DW_AT_decl_line(0x19d)
    4967                            .dwattr $C$DW$479, DW_AT_decl_column(0x0a)
    4968                    
    4969                    $C$DW$480       .dwtag  DW_TAG_member
    4970                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$64)
    4971                            .dwattr $C$DW$480, DW_AT_name("inFrmCntr")
    4972                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("inFrmCntr")
    4973                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4974                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4975                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4976                            .dwattr $C$DW$480, DW_AT_decl_line(0x19e)
    4977                            .dwattr $C$DW$480, DW_AT_decl_column(0x0a)
    4978                    
    4979                    $C$DW$481       .dwtag  DW_TAG_member
    4980                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$65)
    4981                            .dwattr $C$DW$481, DW_AT_name("txFailure")
    4982                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("txFailure")
    4983                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4984                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4985                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4986                            .dwattr $C$DW$481, DW_AT_decl_line(0x19f)
    4987                            .dwattr $C$DW$481, DW_AT_decl_column(0x0a)
    4988                    
    4989                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4990                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x197)
    4991                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
    4992                            .dwendtag $C$DW$T$66
    4993                    
    4994                    $C$DW$T$1068    .dwtag  DW_TAG_typedef
    4995                            .dwattr $C$DW$T$1068, DW_AT_name("linkInfo_t")
    4996                            .dwattr $C$DW$T$1068, DW_AT_type(*$C$DW$T$66)
    4997                            .dwattr $C$DW$T$1068, DW_AT_language(DW_LANG_C)
    4998                            .dwattr $C$DW$T$1068, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4999                            .dwattr $C$DW$T$1068, DW_AT_decl_line(0x1a0)
    5000                            .dwattr $C$DW$T$1068, DW_AT_decl_column(0x03)
    5001                    
    5002                    
    5003                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    5004                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
    5005                    $C$DW$482       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   92

    5006                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$61)
    5007                            .dwattr $C$DW$482, DW_AT_name("event")
    5008                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("event")
    5009                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5010                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5011                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5012                            .dwattr $C$DW$482, DW_AT_decl_line(0x79)
    5013                            .dwattr $C$DW$482, DW_AT_decl_column(0x0a)
    5014                    
    5015                    $C$DW$483       .dwtag  DW_TAG_member
    5016                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$61)
    5017                            .dwattr $C$DW$483, DW_AT_name("status")
    5018                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("status")
    5019                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5020                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5021                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5022                            .dwattr $C$DW$483, DW_AT_decl_line(0x7a)
    5023                            .dwattr $C$DW$483, DW_AT_decl_column(0x0a)
    5024                    
    5025                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5026                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x78)
    5027                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    5028                            .dwendtag $C$DW$T$67
    5029                    
    5030                    $C$DW$T$1069    .dwtag  DW_TAG_typedef
    5031                            .dwattr $C$DW$T$1069, DW_AT_name("osal_event_hdr_t")
    5032                            .dwattr $C$DW$T$1069, DW_AT_type(*$C$DW$T$67)
    5033                            .dwattr $C$DW$T$1069, DW_AT_language(DW_LANG_C)
    5034                            .dwattr $C$DW$T$1069, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5035                            .dwattr $C$DW$T$1069, DW_AT_decl_line(0x7b)
    5036                            .dwattr $C$DW$T$1069, DW_AT_decl_column(0x03)
    5037                    
    5038                    
    5039                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    5040                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x4c)
    5041                    $C$DW$484       .dwtag  DW_TAG_member
    5042                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$70)
    5043                            .dwattr $C$DW$484, DW_AT_name("Crc32")
    5044                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("Crc32")
    5045                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5046                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5047                            .dwattr $C$DW$484, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5048                            .dwattr $C$DW$484, DW_AT_decl_line(0x76)
    5049                            .dwattr $C$DW$484, DW_AT_decl_column(0x25)
    5050                    
    5051                    $C$DW$485       .dwtag  DW_TAG_member
    5052                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$73)
    5053                            .dwattr $C$DW$485, DW_AT_name("FlashGetSize")
    5054                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("FlashGetSize")
    5055                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5056                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5057                            .dwattr $C$DW$485, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5058                            .dwattr $C$DW$485, DW_AT_decl_line(0x77)
    5059                            .dwattr $C$DW$485, DW_AT_decl_column(0x25)
    5060                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   93

    5061                    $C$DW$486       .dwtag  DW_TAG_member
    5062                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$74)
    5063                            .dwattr $C$DW$486, DW_AT_name("GetChipId")
    5064                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("GetChipId")
    5065                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5066                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5067                            .dwattr $C$DW$486, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5068                            .dwattr $C$DW$486, DW_AT_decl_line(0x78)
    5069                            .dwattr $C$DW$486, DW_AT_decl_column(0x25)
    5070                    
    5071                    $C$DW$487       .dwtag  DW_TAG_member
    5072                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$77)
    5073                            .dwattr $C$DW$487, DW_AT_name("ReservedLocation1")
    5074                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("ReservedLocation1")
    5075                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5076                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5077                            .dwattr $C$DW$487, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5078                            .dwattr $C$DW$487, DW_AT_decl_line(0x79)
    5079                            .dwattr $C$DW$487, DW_AT_decl_column(0x25)
    5080                    
    5081                    $C$DW$488       .dwtag  DW_TAG_member
    5082                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$78)
    5083                            .dwattr $C$DW$488, DW_AT_name("ReservedLocation2")
    5084                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("ReservedLocation2")
    5085                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5086                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5087                            .dwattr $C$DW$488, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5088                            .dwattr $C$DW$488, DW_AT_decl_line(0x7a)
    5089                            .dwattr $C$DW$488, DW_AT_decl_column(0x25)
    5090                    
    5091                    $C$DW$489       .dwtag  DW_TAG_member
    5092                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$79)
    5093                            .dwattr $C$DW$489, DW_AT_name("ReservedLocation3")
    5094                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("ReservedLocation3")
    5095                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5096                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5097                            .dwattr $C$DW$489, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5098                            .dwattr $C$DW$489, DW_AT_decl_line(0x7b)
    5099                            .dwattr $C$DW$489, DW_AT_decl_column(0x25)
    5100                    
    5101                    $C$DW$490       .dwtag  DW_TAG_member
    5102                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$80)
    5103                            .dwattr $C$DW$490, DW_AT_name("ResetDevice")
    5104                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("ResetDevice")
    5105                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5106                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5107                            .dwattr $C$DW$490, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5108                            .dwattr $C$DW$490, DW_AT_decl_line(0x7c)
    5109                            .dwattr $C$DW$490, DW_AT_decl_column(0x25)
    5110                    
    5111                    $C$DW$491       .dwtag  DW_TAG_member
    5112                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$85)
    5113                            .dwattr $C$DW$491, DW_AT_name("Fletcher32")
    5114                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("Fletcher32")
    5115                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   94

    5116                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5117                            .dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5118                            .dwattr $C$DW$491, DW_AT_decl_line(0x7d)
    5119                            .dwattr $C$DW$491, DW_AT_decl_column(0x25)
    5120                    
    5121                    $C$DW$492       .dwtag  DW_TAG_member
    5122                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$88)
    5123                            .dwattr $C$DW$492, DW_AT_name("MinValue")
    5124                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("MinValue")
    5125                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5126                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5127                            .dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5128                            .dwattr $C$DW$492, DW_AT_decl_line(0x7e)
    5129                            .dwattr $C$DW$492, DW_AT_decl_column(0x25)
    5130                    
    5131                    $C$DW$493       .dwtag  DW_TAG_member
    5132                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$89)
    5133                            .dwattr $C$DW$493, DW_AT_name("MaxValue")
    5134                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("MaxValue")
    5135                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5136                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5137                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5138                            .dwattr $C$DW$493, DW_AT_decl_line(0x7f)
    5139                            .dwattr $C$DW$493, DW_AT_decl_column(0x25)
    5140                    
    5141                    $C$DW$494       .dwtag  DW_TAG_member
    5142                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$90)
    5143                            .dwattr $C$DW$494, DW_AT_name("MeanValue")
    5144                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("MeanValue")
    5145                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5146                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5147                            .dwattr $C$DW$494, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5148                            .dwattr $C$DW$494, DW_AT_decl_line(0x80)
    5149                            .dwattr $C$DW$494, DW_AT_decl_column(0x25)
    5150                    
    5151                    $C$DW$495       .dwtag  DW_TAG_member
    5152                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$91)
    5153                            .dwattr $C$DW$495, DW_AT_name("StandDeviationValue")
    5154                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("StandDeviationValue")
    5155                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5156                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5157                            .dwattr $C$DW$495, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5158                            .dwattr $C$DW$495, DW_AT_decl_line(0x81)
    5159                            .dwattr $C$DW$495, DW_AT_decl_column(0x25)
    5160                    
    5161                    $C$DW$496       .dwtag  DW_TAG_member
    5162                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$92)
    5163                            .dwattr $C$DW$496, DW_AT_name("ReservedLocation4")
    5164                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("ReservedLocation4")
    5165                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5166                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5167                            .dwattr $C$DW$496, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5168                            .dwattr $C$DW$496, DW_AT_decl_line(0x82)
    5169                            .dwattr $C$DW$496, DW_AT_decl_column(0x25)
    5170                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   95

    5171                    $C$DW$497       .dwtag  DW_TAG_member
    5172                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$93)
    5173                            .dwattr $C$DW$497, DW_AT_name("ReservedLocation5")
    5174                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("ReservedLocation5")
    5175                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5176                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5177                            .dwattr $C$DW$497, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5178                            .dwattr $C$DW$497, DW_AT_decl_line(0x83)
    5179                            .dwattr $C$DW$497, DW_AT_decl_column(0x25)
    5180                    
    5181                    $C$DW$498       .dwtag  DW_TAG_member
    5182                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$94)
    5183                            .dwattr $C$DW$498, DW_AT_name("HFSourceSafeSwitch")
    5184                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    5185                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5186                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5187                            .dwattr $C$DW$498, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5188                            .dwattr $C$DW$498, DW_AT_decl_line(0x84)
    5189                            .dwattr $C$DW$498, DW_AT_decl_column(0x25)
    5190                    
    5191                    $C$DW$499       .dwtag  DW_TAG_member
    5192                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$95)
    5193                            .dwattr $C$DW$499, DW_AT_name("SelectCompAInput")
    5194                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("SelectCompAInput")
    5195                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5196                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5197                            .dwattr $C$DW$499, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5198                            .dwattr $C$DW$499, DW_AT_decl_line(0x85)
    5199                            .dwattr $C$DW$499, DW_AT_decl_column(0x25)
    5200                    
    5201                    $C$DW$500       .dwtag  DW_TAG_member
    5202                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$96)
    5203                            .dwattr $C$DW$500, DW_AT_name("SelectCompARef")
    5204                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("SelectCompARef")
    5205                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    5206                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5207                            .dwattr $C$DW$500, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5208                            .dwattr $C$DW$500, DW_AT_decl_line(0x86)
    5209                            .dwattr $C$DW$500, DW_AT_decl_column(0x25)
    5210                    
    5211                    $C$DW$501       .dwtag  DW_TAG_member
    5212                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$97)
    5213                            .dwattr $C$DW$501, DW_AT_name("SelectADCCompBInput")
    5214                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("SelectADCCompBInput")
    5215                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5216                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5217                            .dwattr $C$DW$501, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5218                            .dwattr $C$DW$501, DW_AT_decl_line(0x87)
    5219                            .dwattr $C$DW$501, DW_AT_decl_column(0x25)
    5220                    
    5221                    $C$DW$502       .dwtag  DW_TAG_member
    5222                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$98)
    5223                            .dwattr $C$DW$502, DW_AT_name("SelectCompBRef")
    5224                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("SelectCompBRef")
    5225                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   96

    5226                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5227                            .dwattr $C$DW$502, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5228                            .dwattr $C$DW$502, DW_AT_decl_line(0x88)
    5229                            .dwattr $C$DW$502, DW_AT_decl_column(0x25)
    5230                    
    5231                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    5232                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x75)
    5233                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x01)
    5234                            .dwendtag $C$DW$T$99
    5235                    
    5236                    $C$DW$T$1070    .dwtag  DW_TAG_typedef
    5237                            .dwattr $C$DW$T$1070, DW_AT_name("HARD_API_T")
    5238                            .dwattr $C$DW$T$1070, DW_AT_type(*$C$DW$T$99)
    5239                            .dwattr $C$DW$T$1070, DW_AT_language(DW_LANG_C)
    5240                            .dwattr $C$DW$T$1070, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\device
    5241                            .dwattr $C$DW$T$1070, DW_AT_decl_line(0x89)
    5242                            .dwattr $C$DW$T$1070, DW_AT_decl_column(0x03)
    5243                    
    5244                    
    5245                    $C$DW$T$102     .dwtag  DW_TAG_structure_type
    5246                            .dwattr $C$DW$T$102, DW_AT_byte_size(0x0a)
    5247                    $C$DW$503       .dwtag  DW_TAG_member
    5248                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$486)
    5249                            .dwattr $C$DW$503, DW_AT_name("addr")
    5250                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("addr")
    5251                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5252                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5253                            .dwattr $C$DW$503, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Applic
    5254                            .dwattr $C$DW$503, DW_AT_decl_line(0x4db)
    5255                            .dwattr $C$DW$503, DW_AT_decl_column(0x07)
    5256                    
    5257                    $C$DW$504       .dwtag  DW_TAG_member
    5258                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$101)
    5259                            .dwattr $C$DW$504, DW_AT_name("addrMode")
    5260                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("addrMode")
    5261                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5262                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5263                            .dwattr $C$DW$504, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Applic
    5264                            .dwattr $C$DW$504, DW_AT_decl_line(0x4de)
    5265                            .dwattr $C$DW$504, DW_AT_decl_column(0x17)
    5266                    
    5267                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Appl
    5268                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x4d0)
    5269                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x01)
    5270                            .dwendtag $C$DW$T$102
    5271                    
    5272                    $C$DW$T$721     .dwtag  DW_TAG_typedef
    5273                            .dwattr $C$DW$T$721, DW_AT_name("ApiMac_sAddr_t")
    5274                            .dwattr $C$DW$T$721, DW_AT_type(*$C$DW$T$102)
    5275                            .dwattr $C$DW$T$721, DW_AT_language(DW_LANG_C)
    5276                            .dwattr $C$DW$T$721, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Appl
    5277                            .dwattr $C$DW$T$721, DW_AT_decl_line(0x4df)
    5278                            .dwattr $C$DW$T$721, DW_AT_decl_column(0x03)
    5279                    
    5280                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   97

    5281                    $C$DW$T$103     .dwtag  DW_TAG_structure_type
    5282                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x08)
    5283                    $C$DW$505       .dwtag  DW_TAG_member
    5284                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$23)
    5285                            .dwattr $C$DW$505, DW_AT_name("frameCounter")
    5286                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("frameCounter")
    5287                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5288                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5289                            .dwattr $C$DW$505, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Applic
    5290                            .dwattr $C$DW$505, DW_AT_decl_line(0x575)
    5291                            .dwattr $C$DW$505, DW_AT_decl_column(0x1a)
    5292                    
    5293                    $C$DW$506       .dwtag  DW_TAG_member
    5294                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$81)
    5295                            .dwattr $C$DW$506, DW_AT_name("keyIdx")
    5296                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("keyIdx")
    5297                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5298                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5299                            .dwattr $C$DW$506, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Applic
    5300                            .dwattr $C$DW$506, DW_AT_decl_line(0x576)
    5301                            .dwattr $C$DW$506, DW_AT_decl_column(0x1a)
    5302                    
    5303                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Appl
    5304                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x574)
    5305                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x01)
    5306                            .dwendtag $C$DW$T$103
    5307                    
    5308                    $C$DW$T$781     .dwtag  DW_TAG_typedef
    5309                            .dwattr $C$DW$T$781, DW_AT_name("ApiMac_frameCntr_t")
    5310                            .dwattr $C$DW$T$781, DW_AT_type(*$C$DW$T$103)
    5311                            .dwattr $C$DW$T$781, DW_AT_language(DW_LANG_C)
    5312                            .dwattr $C$DW$T$781, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Appl
    5313                            .dwattr $C$DW$T$781, DW_AT_decl_line(0x577)
    5314                            .dwattr $C$DW$T$781, DW_AT_decl_column(0x03)
    5315                    
    5316                    $C$DW$T$782     .dwtag  DW_TAG_pointer_type
    5317                            .dwattr $C$DW$T$782, DW_AT_type(*$C$DW$T$781)
    5318                            .dwattr $C$DW$T$782, DW_AT_address_class(0x20)
    5319                    
    5320                    
    5321                    $C$DW$T$107     .dwtag  DW_TAG_structure_type
    5322                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x40)
    5323                    $C$DW$507       .dwtag  DW_TAG_member
    5324                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$105)
    5325                            .dwattr $C$DW$507, DW_AT_name("beaconType")
    5326                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("beaconType")
    5327                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5328                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5329                            .dwattr $C$DW$507, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Applic
    5330                            .dwattr $C$DW$507, DW_AT_decl_line(0x886)
    5331                            .dwattr $C$DW$507, DW_AT_decl_column(0x19)
    5332                    
    5333                    $C$DW$508       .dwtag  DW_TAG_member
    5334                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
    5335                            .dwattr $C$DW$508, DW_AT_name("bsn")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   98

    5336                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("bsn")
    5337                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5338                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5339                            .dwattr $C$DW$508, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Applic
    5340                            .dwattr $C$DW$508, DW_AT_decl_line(0x888)
    5341                            .dwattr $C$DW$508, DW_AT_decl_column(0x0d)
    5342                    
    5343                    $C$DW$509       .dwtag  DW_TAG_member
    5344                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$106)
    5345                            .dwattr $C$DW$509, DW_AT_name("panDesc")
    5346                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("panDesc")
    5347                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5348                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5349                            .dwattr $C$DW$509, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Applic
    5350                            .dwattr $C$DW$509, DW_AT_decl_line(0x88a)
    5351                            .dwattr $C$DW$509, DW_AT_decl_column(0x16)
    5352                    
    5353                    $C$DW$510       .dwtag  DW_TAG_member
    5354                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$489)
    5355                            .dwattr $C$DW$510, DW_AT_name("beaconData")
    5356                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("beaconData")
    5357                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5358                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5359                            .dwattr $C$DW$510, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Applic
    5360                            .dwattr $C$DW$510, DW_AT_decl_line(0x895)
    5361                            .dwattr $C$DW$510, DW_AT_decl_column(0x07)
    5362                    
    5363                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Appl
    5364                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x884)
    5365                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x01)
    5366                            .dwendtag $C$DW$T$107
    5367                    
    5368                    $C$DW$T$635     .dwtag  DW_TAG_typedef
    5369                            .dwattr $C$DW$T$635, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    5370                            .dwattr $C$DW$T$635, DW_AT_type(*$C$DW$T$107)
    5371                            .dwattr $C$DW$T$635, DW_AT_language(DW_LANG_C)
    5372                            .dwattr $C$DW$T$635, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\Appl
    5373                            .dwattr $C$DW$T$635, DW_AT_decl_line(0x896)
    5374                            .dwattr $C$DW$T$635, DW_AT_decl_column(0x03)
    5375                    
    5376                    $C$DW$T$636     .dwtag  DW_TAG_pointer_type
    5377                            .dwattr $C$DW$T$636, DW_AT_type(*$C$DW$T$635)
    5378                            .dwattr $C$DW$T$636, DW_AT_address_class(0x20)
    5379                    
    5380                    
    5381                    $C$DW$T$108     .dwtag  DW_TAG_structure_type
    5382                            .dwattr $C$DW$T$108, DW_AT_byte_size(0x08)
    5383                    $C$DW$511       .dwtag  DW_TAG_member
    5384                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$40)
    5385                            .dwattr $C$DW$511, DW_AT_name("pCurrEntry")
    5386                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("pCurrEntry")
    5387                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5388                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5389                            .dwattr $C$DW$511, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5390                            .dwattr $C$DW$511, DW_AT_decl_line(0x41)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:36 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{7D953B6E-A1AE-4B01-94E4-D92084B776E5} PAGE   99

    5391                            .dwattr $C$DW$511, DW_AT_decl_column(0x0d)
    5392                    
    5393                    $C$DW$512       .dwtag  DW_TAG_member
    5394                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$40)
    5395                            .dwattr $C$DW$512, DW_AT_name("pLastEntry")
    5396                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("pLastEntry")
    5397                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5398                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5399                            .dwattr $C$DW$512, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5400                            .dwattr $C$DW$512, DW_AT_decl_line(0x42)
    5401                            .dwattr $C$DW$512, DW_AT_decl_column(0x0d)
    5402                    
    5403                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    5404                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x40)
    5405                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x10)
    5406                            .dwendtag $C$DW$T$108
    5407                    
    5408                    $C$DW$T$877     .dwtag  DW_TAG_typedef
    5409                            .dwattr $C$DW$T$877, DW_AT_name("dataQueue_t")
    5410                            .dwattr $C$DW$T$877, DW_AT_type(*$C$DW$T$108)
    5411                            .dwattr $C$DW$T$877, DW_AT_language(DW_LANG_C)
    5412                            .dwattr $C$DW$T$877, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    5413                            .dwattr $C$DW$T$877, DW_AT_decl_line(0x43)
    5414                            .dwattr $C$DW$T$877, DW_AT_decl_column(0x03)
    5415                    
    5416                    $C$DW$T$878     .dwtag  DW_TAG_pointer_type
    5417                            .dwattr $C$DW$T$878, DW_AT_type(*$C$DW$T$877)
    5418                            .dwattr $C$DW$T$878, DW_AT_address_class(0x20)
    5419                    
    5420                    
    5421                    $C$DW$T$109     .dwtag  DW_TAG_structure_type
    5422                            .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    5423                    $C$DW$513       .dwtag  DW_TAG_member
    5424                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$19)
    5425                            .dwattr $C$DW$513, DW_AT_name("triggerType")
    5426                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("triggerType")
