TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Mon Dec 10 17:47:34 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal_pwrmgr.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\sensor_c
      13                    $C$DW$1 .dwtag  DW_TAG_variable
      14                            .dwattr $C$DW$1, DW_AT_name("ICall_dispatcher")

TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   12

     602                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$171)
     603                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
     604                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
     605                            .dwattr $C$DW$T$172, DW_AT_decl_line(0xb0)
     606                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x03)
     607                    
     608                    
     609                    $C$DW$T$173     .dwtag  DW_TAG_enumeration_type
     610                            .dwattr $C$DW$T$173, DW_AT_byte_size(0x01)
     611                    $C$DW$39        .dwtag  DW_TAG_enumerator
     612                            .dwattr $C$DW$39, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
     613                            .dwattr $C$DW$39, DW_AT_const_value(0xe0)
     614                            .dwattr $C$DW$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     615                            .dwattr $C$DW$39, DW_AT_decl_line(0x3de)
     616                            .dwattr $C$DW$39, DW_AT_decl_column(0x04)
     617                    
     618                    $C$DW$40        .dwtag  DW_TAG_enumerator
     619                            .dwattr $C$DW$40, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
     620                            .dwattr $C$DW$40, DW_AT_const_value(0xe1)
     621                            .dwattr $C$DW$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     622                            .dwattr $C$DW$40, DW_AT_decl_line(0x3e0)
     623                            .dwattr $C$DW$40, DW_AT_decl_column(0x04)
     624                    
     625                    $C$DW$41        .dwtag  DW_TAG_enumerator
     626                            .dwattr $C$DW$41, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
     627                            .dwattr $C$DW$41, DW_AT_const_value(0xe2)
     628                            .dwattr $C$DW$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     629                            .dwattr $C$DW$41, DW_AT_decl_line(0x3e2)
     630                            .dwattr $C$DW$41, DW_AT_decl_column(0x04)
     631                    
     632                    $C$DW$42        .dwtag  DW_TAG_enumerator
     633                            .dwattr $C$DW$42, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
     634                            .dwattr $C$DW$42, DW_AT_const_value(0xe3)
     635                            .dwattr $C$DW$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     636                            .dwattr $C$DW$42, DW_AT_decl_line(0x3e4)
     637                            .dwattr $C$DW$42, DW_AT_decl_column(0x04)
     638                    
     639                    $C$DW$43        .dwtag  DW_TAG_enumerator
     640                            .dwattr $C$DW$43, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
     641                            .dwattr $C$DW$43, DW_AT_const_value(0xe4)
     642                            .dwattr $C$DW$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     643                            .dwattr $C$DW$43, DW_AT_decl_line(0x3e6)
     644                            .dwattr $C$DW$43, DW_AT_decl_column(0x04)
     645                    
     646                    $C$DW$44        .dwtag  DW_TAG_enumerator
     647                            .dwattr $C$DW$44, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
     648                            .dwattr $C$DW$44, DW_AT_const_value(0xe5)
     649                            .dwattr $C$DW$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
     650                            .dwattr $C$DW$44, DW_AT_decl_line(0x3e8)
     651                            .dwattr $C$DW$44, DW_AT_decl_column(0x04)
     652                    
     653                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
     654                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x3dc)
     655                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x01)
     656                            .dwendtag $C$DW$T$173
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   13

     657                    
     658                    $C$DW$T$174     .dwtag  DW_TAG_typedef
     659                            .dwattr $C$DW$T$174, DW_AT_name("ICall_RemotiCmdEvent_t")
     660                            .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$173)
     661                            .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
     662                            .dwattr $C$DW$T$174, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
     663                            .dwattr $C$DW$T$174, DW_AT_decl_line(0x3e9)
     664                            .dwattr $C$DW$T$174, DW_AT_decl_column(0x02)
     665                    
     666                    
     667                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     668                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     669                    $C$DW$45        .dwtag  DW_TAG_member
     670                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     671                            .dwattr $C$DW$45, DW_AT_name("pwrmgr_task_state")
     672                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("pwrmgr_task_state")
     673                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     675                            .dwattr $C$DW$45, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     676                            .dwattr $C$DW$45, DW_AT_decl_line(0x48)
     677                            .dwattr $C$DW$45, DW_AT_decl_column(0x0a)
     678                    
     679                            .dwattr $C$DW$T$20, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     680                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x47)
     681                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
     682                            .dwendtag $C$DW$T$20
     683                    
     684                    $C$DW$T$176     .dwtag  DW_TAG_typedef
     685                            .dwattr $C$DW$T$176, DW_AT_name("pwrmgr_attribute_t")
     686                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$20)
     687                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
     688                            .dwattr $C$DW$T$176, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
     689                            .dwattr $C$DW$T$176, DW_AT_decl_line(0x4e)
     690                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x03)
     691                    
     692                    
     693                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
     694                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x4c)
     695                    $C$DW$46        .dwtag  DW_TAG_member
     696                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$26)
     697                            .dwattr $C$DW$46, DW_AT_name("Crc32")
     698                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("Crc32")
     699                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     700                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     701                            .dwattr $C$DW$46, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     702                            .dwattr $C$DW$46, DW_AT_decl_line(0x76)
     703                            .dwattr $C$DW$46, DW_AT_decl_column(0x25)
     704                    
     705                    $C$DW$47        .dwtag  DW_TAG_member
     706                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$29)
     707                            .dwattr $C$DW$47, DW_AT_name("FlashGetSize")
     708                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("FlashGetSize")
     709                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     710                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     711                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   14

     712                            .dwattr $C$DW$47, DW_AT_decl_line(0x77)
     713                            .dwattr $C$DW$47, DW_AT_decl_column(0x25)
     714                    
     715                    $C$DW$48        .dwtag  DW_TAG_member
     716                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$30)
     717                            .dwattr $C$DW$48, DW_AT_name("GetChipId")
     718                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("GetChipId")
     719                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     720                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     721                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     722                            .dwattr $C$DW$48, DW_AT_decl_line(0x78)
     723                            .dwattr $C$DW$48, DW_AT_decl_column(0x25)
     724                    
     725                    $C$DW$49        .dwtag  DW_TAG_member
     726                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$33)
     727                            .dwattr $C$DW$49, DW_AT_name("ReservedLocation1")
     728                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("ReservedLocation1")
     729                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     730                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     731                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     732                            .dwattr $C$DW$49, DW_AT_decl_line(0x79)
     733                            .dwattr $C$DW$49, DW_AT_decl_column(0x25)
     734                    
     735                    $C$DW$50        .dwtag  DW_TAG_member
     736                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$34)
     737                            .dwattr $C$DW$50, DW_AT_name("ReservedLocation2")
     738                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("ReservedLocation2")
     739                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     740                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     741                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     742                            .dwattr $C$DW$50, DW_AT_decl_line(0x7a)
     743                            .dwattr $C$DW$50, DW_AT_decl_column(0x25)
     744                    
     745                    $C$DW$51        .dwtag  DW_TAG_member
     746                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$35)
     747                            .dwattr $C$DW$51, DW_AT_name("ReservedLocation3")
     748                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("ReservedLocation3")
     749                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     750                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     751                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     752                            .dwattr $C$DW$51, DW_AT_decl_line(0x7b)
     753                            .dwattr $C$DW$51, DW_AT_decl_column(0x25)
     754                    
     755                    $C$DW$52        .dwtag  DW_TAG_member
     756                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$38)
     757                            .dwattr $C$DW$52, DW_AT_name("ResetDevice")
     758                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("ResetDevice")
     759                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     760                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     761                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     762                            .dwattr $C$DW$52, DW_AT_decl_line(0x7c)
     763                            .dwattr $C$DW$52, DW_AT_decl_column(0x25)
     764                    
     765                    $C$DW$53        .dwtag  DW_TAG_member
     766                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$43)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   15

     767                            .dwattr $C$DW$53, DW_AT_name("Fletcher32")
     768                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("Fletcher32")
     769                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     770                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     771                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     772                            .dwattr $C$DW$53, DW_AT_decl_line(0x7d)
     773                            .dwattr $C$DW$53, DW_AT_decl_column(0x25)
     774                    
     775                    $C$DW$54        .dwtag  DW_TAG_member
     776                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$47)
     777                            .dwattr $C$DW$54, DW_AT_name("MinValue")
     778                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("MinValue")
     779                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     780                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     781                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     782                            .dwattr $C$DW$54, DW_AT_decl_line(0x7e)
     783                            .dwattr $C$DW$54, DW_AT_decl_column(0x25)
     784                    
     785                    $C$DW$55        .dwtag  DW_TAG_member
     786                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$48)
     787                            .dwattr $C$DW$55, DW_AT_name("MaxValue")
     788                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("MaxValue")
     789                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     790                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     791                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     792                            .dwattr $C$DW$55, DW_AT_decl_line(0x7f)
     793                            .dwattr $C$DW$55, DW_AT_decl_column(0x25)
     794                    
     795                    $C$DW$56        .dwtag  DW_TAG_member
     796                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$49)
     797                            .dwattr $C$DW$56, DW_AT_name("MeanValue")
     798                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("MeanValue")
     799                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     800                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     801                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     802                            .dwattr $C$DW$56, DW_AT_decl_line(0x80)
     803                            .dwattr $C$DW$56, DW_AT_decl_column(0x25)
     804                    
     805                    $C$DW$57        .dwtag  DW_TAG_member
     806                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$50)
     807                            .dwattr $C$DW$57, DW_AT_name("StandDeviationValue")
     808                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("StandDeviationValue")
     809                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     810                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     811                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     812                            .dwattr $C$DW$57, DW_AT_decl_line(0x81)
     813                            .dwattr $C$DW$57, DW_AT_decl_column(0x25)
     814                    
     815                    $C$DW$58        .dwtag  DW_TAG_member
     816                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$53)
     817                            .dwattr $C$DW$58, DW_AT_name("ReservedLocation4")
     818                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("ReservedLocation4")
     819                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     820                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     821                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   16

     822                            .dwattr $C$DW$58, DW_AT_decl_line(0x82)
     823                            .dwattr $C$DW$58, DW_AT_decl_column(0x25)
     824                    
     825                    $C$DW$59        .dwtag  DW_TAG_member
     826                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$54)
     827                            .dwattr $C$DW$59, DW_AT_name("ReservedLocation5")
     828                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("ReservedLocation5")
     829                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     830                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     831                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     832                            .dwattr $C$DW$59, DW_AT_decl_line(0x83)
     833                            .dwattr $C$DW$59, DW_AT_decl_column(0x25)
     834                    
     835                    $C$DW$60        .dwtag  DW_TAG_member
     836                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$55)
     837                            .dwattr $C$DW$60, DW_AT_name("HFSourceSafeSwitch")
     838                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
     839                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     840                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     841                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     842                            .dwattr $C$DW$60, DW_AT_decl_line(0x84)
     843                            .dwattr $C$DW$60, DW_AT_decl_column(0x25)
     844                    
     845                    $C$DW$61        .dwtag  DW_TAG_member
     846                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$58)
     847                            .dwattr $C$DW$61, DW_AT_name("SelectCompAInput")
     848                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("SelectCompAInput")
     849                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     850                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     851                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     852                            .dwattr $C$DW$61, DW_AT_decl_line(0x85)
     853                            .dwattr $C$DW$61, DW_AT_decl_column(0x25)
     854                    
     855                    $C$DW$62        .dwtag  DW_TAG_member
     856                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$59)
     857                            .dwattr $C$DW$62, DW_AT_name("SelectCompARef")
     858                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("SelectCompARef")
     859                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     860                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     861                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     862                            .dwattr $C$DW$62, DW_AT_decl_line(0x86)
     863                            .dwattr $C$DW$62, DW_AT_decl_column(0x25)
     864                    
     865                    $C$DW$63        .dwtag  DW_TAG_member
     866                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$60)
     867                            .dwattr $C$DW$63, DW_AT_name("SelectADCCompBInput")
     868                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("SelectADCCompBInput")
     869                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     870                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     871                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     872                            .dwattr $C$DW$63, DW_AT_decl_line(0x87)
     873                            .dwattr $C$DW$63, DW_AT_decl_column(0x25)
     874                    
     875                    $C$DW$64        .dwtag  DW_TAG_member
     876                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$61)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   17

     877                            .dwattr $C$DW$64, DW_AT_name("SelectCompBRef")
     878                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("SelectCompBRef")
     879                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     880                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     881                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     882                            .dwattr $C$DW$64, DW_AT_decl_line(0x88)
     883                            .dwattr $C$DW$64, DW_AT_decl_column(0x25)
     884                    
     885                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     886                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x75)
     887                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
     888                            .dwendtag $C$DW$T$62
     889                    
     890                    $C$DW$T$177     .dwtag  DW_TAG_typedef
     891                            .dwattr $C$DW$T$177, DW_AT_name("HARD_API_T")
     892                            .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$62)
     893                            .dwattr $C$DW$T$177, DW_AT_language(DW_LANG_C)
     894                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
     895                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x89)
     896                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x03)
     897                    
     898                    
     899                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
     900                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
     901                    $C$DW$65        .dwtag  DW_TAG_member
     902                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$10)
     903                            .dwattr $C$DW$65, DW_AT_name("quot")
     904                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("quot")
     905                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     907                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/st
     908                            .dwattr $C$DW$65, DW_AT_decl_line(0x5c)
     909                            .dwattr $C$DW$65, DW_AT_decl_column(0x16)
     910                    
     911                    $C$DW$66        .dwtag  DW_TAG_member
     912                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$10)
     913                            .dwattr $C$DW$66, DW_AT_name("rem")
     914                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("rem")
     915                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     916                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     917                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/st
     918                            .dwattr $C$DW$66, DW_AT_decl_line(0x5c)
     919                            .dwattr $C$DW$66, DW_AT_decl_column(0x1c)
     920                    
     921                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
     922                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x5c)
     923                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
     924                            .dwendtag $C$DW$T$63
     925                    
     926                    $C$DW$T$178     .dwtag  DW_TAG_typedef
     927                            .dwattr $C$DW$T$178, DW_AT_name("div_t")
     928                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$63)
     929                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
     930                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include
     931                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x5c)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   18

     932                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x23)
     933                    
     934                    
     935                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
     936                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x08)
     937                    $C$DW$67        .dwtag  DW_TAG_member
     938                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$10)
     939                            .dwattr $C$DW$67, DW_AT_name("quot")
     940                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("quot")
     941                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     943                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/st
     944                            .dwattr $C$DW$67, DW_AT_decl_line(0x5e)
     945                            .dwattr $C$DW$67, DW_AT_decl_column(0x16)
     946                    
     947                    $C$DW$68        .dwtag  DW_TAG_member
     948                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$10)
     949                            .dwattr $C$DW$68, DW_AT_name("rem")
     950                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("rem")
     951                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     952                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     953                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/st
     954                            .dwattr $C$DW$68, DW_AT_decl_line(0x5e)
     955                            .dwattr $C$DW$68, DW_AT_decl_column(0x1c)
     956                    
     957                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
     958                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x5e)
     959                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x10)
     960                            .dwendtag $C$DW$T$64
     961                    
     962                    $C$DW$T$179     .dwtag  DW_TAG_typedef
     963                            .dwattr $C$DW$T$179, DW_AT_name("ldiv_t")
     964                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$64)
     965                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
     966                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include
     967                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x5e)
     968                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x23)
     969                    
     970                    
     971                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
     972                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
     973                    $C$DW$69        .dwtag  DW_TAG_member
     974                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$14)
     975                            .dwattr $C$DW$69, DW_AT_name("quot")
     976                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("quot")
     977                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     978                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     979                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/st
     980                            .dwattr $C$DW$69, DW_AT_decl_line(0x61)
     981                            .dwattr $C$DW$69, DW_AT_decl_column(0x1c)
     982                    
     983                    $C$DW$70        .dwtag  DW_TAG_member
     984                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$14)
     985                            .dwattr $C$DW$70, DW_AT_name("rem")
     986                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("rem")
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   19

     987                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     988                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     989                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/st
     990                            .dwattr $C$DW$70, DW_AT_decl_line(0x61)
     991                            .dwattr $C$DW$70, DW_AT_decl_column(0x22)
     992                    
     993                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
     994                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x61)
     995                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
     996                            .dwendtag $C$DW$T$65
     997                    
     998                    $C$DW$T$180     .dwtag  DW_TAG_typedef
     999                            .dwattr $C$DW$T$180, DW_AT_name("lldiv_t")
    1000                            .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$65)
    1001                            .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    1002                            .dwattr $C$DW$T$180, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include
    1003                            .dwattr $C$DW$T$180, DW_AT_decl_line(0x61)
    1004                            .dwattr $C$DW$T$180, DW_AT_decl_column(0x29)
    1005                    
    1006                    
    1007                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    1008                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x08)
    1009                    $C$DW$71        .dwtag  DW_TAG_member
    1010                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$67)
    1011                            .dwattr $C$DW$71, DW_AT_name("pointerStack")
    1012                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("pointerStack")
    1013                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1015                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1016                            .dwattr $C$DW$71, DW_AT_decl_line(0x3f5)
    1017                            .dwattr $C$DW$71, DW_AT_decl_column(0x16)
    1018                    
    1019                    $C$DW$72        .dwtag  DW_TAG_member
    1020                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$68)
    1021                            .dwattr $C$DW$72, DW_AT_name("directAPI")
    1022                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("directAPI")
    1023                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1024                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1025                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1026                            .dwattr $C$DW$72, DW_AT_decl_line(0x3f6)
    1027                            .dwattr $C$DW$72, DW_AT_decl_column(0x15)
    1028                    
    1029                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1030                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x3f4)
    1031                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
    1032                            .dwendtag $C$DW$T$69
    1033                    
    1034                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    1035                            .dwattr $C$DW$T$71, DW_AT_name("icall_directAPIMsg_t")
    1036                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$69)
    1037                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1038                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1039                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x3f7)
    1040                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    1041                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   20

    1042                    
    1043                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    1044                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x14)
    1045                    $C$DW$73        .dwtag  DW_TAG_member
    1046                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$70)
    1047                            .dwattr $C$DW$73, DW_AT_name("hdr")
    1048                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("hdr")
    1049                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1051                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1052                            .dwattr $C$DW$73, DW_AT_decl_line(0x3fb)
    1053                            .dwattr $C$DW$73, DW_AT_decl_column(0x10)
    1054                    
    1055                    $C$DW$74        .dwtag  DW_TAG_member
    1056                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$71)
    1057                            .dwattr $C$DW$74, DW_AT_name("msg")
    1058                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("msg")
    1059                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1060                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1061                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1062                            .dwattr $C$DW$74, DW_AT_decl_line(0x3fc)
    1063                            .dwattr $C$DW$74, DW_AT_decl_column(0x1a)
    1064                    
    1065                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1066                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x3fa)
    1067                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
    1068                            .dwendtag $C$DW$T$72
    1069                    
    1070                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1071                            .dwattr $C$DW$T$181, DW_AT_name("icallLiteMsg_t")
    1072                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$72)
    1073                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    1074                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1075                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x3fd)
    1076                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    1077                    
    1078                    
    1079                    $C$DW$T$76      .dwtag  DW_TAG_structure_type
    1080                            .dwattr $C$DW$T$76, DW_AT_byte_size(0x0c)
    1081                    $C$DW$75        .dwtag  DW_TAG_member
    1082                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$73)
    1083                            .dwattr $C$DW$75, DW_AT_name("bufferHead")
    1084                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("bufferHead")
    1085                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1086                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1087                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1088                            .dwattr $C$DW$75, DW_AT_decl_line(0x80)
    1089                            .dwattr $C$DW$75, DW_AT_decl_column(0x13)
    1090                    
    1091                    $C$DW$76        .dwtag  DW_TAG_member
    1092                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$73)
    1093                            .dwattr $C$DW$76, DW_AT_name("bufferTail")
    1094                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("bufferTail")
    1095                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1096                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   21

    1097                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1098                            .dwattr $C$DW$76, DW_AT_decl_line(0x81)
    1099                            .dwattr $C$DW$76, DW_AT_decl_column(0x13)
    1100                    
    1101                    $C$DW$77        .dwtag  DW_TAG_member
    1102                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1103                            .dwattr $C$DW$77, DW_AT_name("maxBufSize")
    1104                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("maxBufSize")
    1105                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1106                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1107                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1108                            .dwattr $C$DW$77, DW_AT_decl_line(0x82)
    1109                            .dwattr $C$DW$77, DW_AT_decl_column(0x0a)
    1110                    
    1111                    $C$DW$78        .dwtag  DW_TAG_member
    1112                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$75)
    1113                            .dwattr $C$DW$78, DW_AT_name("pBuffer")
    1114                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("pBuffer")
    1115                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1116                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1117                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1118                            .dwattr $C$DW$78, DW_AT_decl_line(0x83)
    1119                            .dwattr $C$DW$78, DW_AT_decl_column(0x0a)
    1120                    
    1121                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1122                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x7e)
    1123                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
    1124                            .dwendtag $C$DW$T$76
    1125                    
    1126                    $C$DW$T$78      .dwtag  DW_TAG_typedef
    1127                            .dwattr $C$DW$T$78, DW_AT_name("halUARTBufControl_t")
    1128                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$76)
    1129                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1130                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1131                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x84)
    1132                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    1133                    
    1134                    
    1135                    $C$DW$T$83      .dwtag  DW_TAG_structure_type
    1136                            .dwattr $C$DW$T$83, DW_AT_byte_size(0x2c)
    1137                    $C$DW$79        .dwtag  DW_TAG_member
    1138                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$77)
    1139                            .dwattr $C$DW$79, DW_AT_name("configured")
    1140                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("configured")
    1141                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1143                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1144                            .dwattr $C$DW$79, DW_AT_decl_line(0x88)
    1145                            .dwattr $C$DW$79, DW_AT_decl_column(0x17)
    1146                    
    1147                    $C$DW$80        .dwtag  DW_TAG_member
    1148                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$74)
    1149                            .dwattr $C$DW$80, DW_AT_name("baudRate")
    1150                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("baudRate")
    1151                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   22

    1152                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1153                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1154                            .dwattr $C$DW$80, DW_AT_decl_line(0x89)
    1155                            .dwattr $C$DW$80, DW_AT_decl_column(0x17)
    1156                    
    1157                    $C$DW$81        .dwtag  DW_TAG_member
    1158                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$77)
    1159                            .dwattr $C$DW$81, DW_AT_name("flowControl")
    1160                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("flowControl")
    1161                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1162                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1163                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1164                            .dwattr $C$DW$81, DW_AT_decl_line(0x8a)
    1165                            .dwattr $C$DW$81, DW_AT_decl_column(0x17)
    1166                    
    1167                    $C$DW$82        .dwtag  DW_TAG_member
    1168                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1169                            .dwattr $C$DW$82, DW_AT_name("flowControlThreshold")
    1170                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("flowControlThreshold")
    1171                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1172                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1173                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1174                            .dwattr $C$DW$82, DW_AT_decl_line(0x8b)
    1175                            .dwattr $C$DW$82, DW_AT_decl_column(0x17)
    1176                    
    1177                    $C$DW$83        .dwtag  DW_TAG_member
    1178                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$74)
    1179                            .dwattr $C$DW$83, DW_AT_name("idleTimeout")
    1180                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("idleTimeout")
    1181                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1182                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1183                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1184                            .dwattr $C$DW$83, DW_AT_decl_line(0x8c)
    1185                            .dwattr $C$DW$83, DW_AT_decl_column(0x17)
    1186                    
    1187                    $C$DW$84        .dwtag  DW_TAG_member
    1188                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$78)
    1189                            .dwattr $C$DW$84, DW_AT_name("rx")
    1190                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("rx")
    1191                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1192                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1193                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1194                            .dwattr $C$DW$84, DW_AT_decl_line(0x8d)
    1195                            .dwattr $C$DW$84, DW_AT_decl_column(0x17)
    1196                    
    1197                    $C$DW$85        .dwtag  DW_TAG_member
    1198                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$78)
    1199                            .dwattr $C$DW$85, DW_AT_name("tx")
    1200                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("tx")
    1201                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1202                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1203                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1204                            .dwattr $C$DW$85, DW_AT_decl_line(0x8e)
    1205                            .dwattr $C$DW$85, DW_AT_decl_column(0x17)
    1206                    
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   23

    1207                    $C$DW$86        .dwtag  DW_TAG_member
    1208                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$77)
    1209                            .dwattr $C$DW$86, DW_AT_name("intEnable")
    1210                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("intEnable")
    1211                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1212                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1213                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1214                            .dwattr $C$DW$86, DW_AT_decl_line(0x8f)
    1215                            .dwattr $C$DW$86, DW_AT_decl_column(0x17)
    1216                    
    1217                    $C$DW$87        .dwtag  DW_TAG_member
    1218                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$79)
    1219                            .dwattr $C$DW$87, DW_AT_name("rxChRvdTime")
    1220                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("rxChRvdTime")
    1221                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1222                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1223                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1224                            .dwattr $C$DW$87, DW_AT_decl_line(0x90)
    1225                            .dwattr $C$DW$87, DW_AT_decl_column(0x17)
    1226                    
    1227                    $C$DW$88        .dwtag  DW_TAG_member
    1228                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$82)
    1229                            .dwattr $C$DW$88, DW_AT_name("callBackFunc")
    1230                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("callBackFunc")
    1231                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1232                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1233                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1234                            .dwattr $C$DW$88, DW_AT_decl_line(0x91)
    1235                            .dwattr $C$DW$88, DW_AT_decl_column(0x17)
    1236                    
    1237                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1238                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x87)
    1239                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x01)
    1240                            .dwendtag $C$DW$T$83
    1241                    
    1242                    $C$DW$T$182     .dwtag  DW_TAG_typedef
    1243                            .dwattr $C$DW$T$182, DW_AT_name("halUARTCfg_t")
    1244                            .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$83)
    1245                            .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    1246                            .dwattr $C$DW$T$182, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1247                            .dwattr $C$DW$T$182, DW_AT_decl_line(0x92)
    1248                            .dwattr $C$DW$T$182, DW_AT_decl_column(0x02)
    1249                    
    1250                    
    1251                    $C$DW$T$84      .dwtag  DW_TAG_structure_type
    1252                            .dwattr $C$DW$T$84, DW_AT_byte_size(0x02)
    1253                    $C$DW$89        .dwtag  DW_TAG_member
    1254                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$74)
    1255                            .dwattr $C$DW$89, DW_AT_name("event")
    1256                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("event")
    1257                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1258                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1259                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1260                            .dwattr $C$DW$89, DW_AT_decl_line(0x79)
    1261                            .dwattr $C$DW$89, DW_AT_decl_column(0x0a)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   24

    1262                    
    1263                    $C$DW$90        .dwtag  DW_TAG_member
    1264                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$74)
    1265                            .dwattr $C$DW$90, DW_AT_name("status")
    1266                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("status")
    1267                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1268                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1269                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1270                            .dwattr $C$DW$90, DW_AT_decl_line(0x7a)
    1271                            .dwattr $C$DW$90, DW_AT_decl_column(0x0a)
    1272                    
    1273                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1274                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x78)
    1275                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x01)
    1276                            .dwendtag $C$DW$T$84
    1277                    
    1278                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    1279                            .dwattr $C$DW$T$85, DW_AT_name("osal_event_hdr_t")
    1280                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    1281                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1282                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1283                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x7b)
    1284                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x03)
    1285                    
    1286                    
    1287                    $C$DW$T$86      .dwtag  DW_TAG_structure_type
    1288                            .dwattr $C$DW$T$86, DW_AT_byte_size(0x04)
    1289                    $C$DW$91        .dwtag  DW_TAG_member
    1290                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$85)
    1291                            .dwattr $C$DW$91, DW_AT_name("hdr")
    1292                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("hdr")
    1293                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1295                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1350
    1296                            .dwattr $C$DW$91, DW_AT_decl_line(0xbc)
    1297                            .dwattr $C$DW$91, DW_AT_decl_column(0x14)
    1298                    
    1299                    $C$DW$92        .dwtag  DW_TAG_member
    1300                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$74)
    1301                            .dwattr $C$DW$92, DW_AT_name("state")
    1302                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("state")
    1303                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1304                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1305                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1350
    1306                            .dwattr $C$DW$92, DW_AT_decl_line(0xbd)
    1307                            .dwattr $C$DW$92, DW_AT_decl_column(0x09)
    1308                    
    1309                    $C$DW$93        .dwtag  DW_TAG_member
    1310                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$74)
    1311                            .dwattr $C$DW$93, DW_AT_name("keys")
    1312                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("keys")
    1313                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1314                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1315                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1350
    1316                            .dwattr $C$DW$93, DW_AT_decl_line(0xbe)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   25

    1317                            .dwattr $C$DW$93, DW_AT_decl_column(0x09)
    1318                    
    1319                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    1320                            .dwattr $C$DW$T$86, DW_AT_decl_line(0xbb)
    1321                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x01)
    1322                            .dwendtag $C$DW$T$86
    1323                    
    1324                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1325                            .dwattr $C$DW$T$183, DW_AT_name("keyChange_t")
    1326                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$86)
    1327                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1328                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    1329                            .dwattr $C$DW$T$183, DW_AT_decl_line(0xbf)
    1330                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    1331                    
    1332                    
    1333                    $C$DW$T$91      .dwtag  DW_TAG_union_type
    1334                            .dwattr $C$DW$T$91, DW_AT_byte_size(0x02)
    1335                    $C$DW$94        .dwtag  DW_TAG_member
    1336                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$88)
    1337                            .dwattr $C$DW$94, DW_AT_name("entityId")
    1338                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("entityId")
    1339                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1341                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1342                            .dwattr $C$DW$94, DW_AT_decl_line(0x1fe)
    1343                            .dwattr $C$DW$94, DW_AT_decl_column(0x14)
    1344                    
    1345                    $C$DW$95        .dwtag  DW_TAG_member
    1346                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$90)
    1347                            .dwattr $C$DW$95, DW_AT_name("servId")
    1348                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("servId")
    1349                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1350                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1351                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1352                            .dwattr $C$DW$95, DW_AT_decl_line(0x200)
    1353                            .dwattr $C$DW$95, DW_AT_decl_column(0x17)
    1354                    
    1355                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1356                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x1fc)
    1357                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    1358                            .dwendtag $C$DW$T$91
    1359                    
    1360                    
    1361                    $C$DW$T$92      .dwtag  DW_TAG_union_type
    1362                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
    1363                    $C$DW$96        .dwtag  DW_TAG_member
    1364                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$90)
    1365                            .dwattr $C$DW$96, DW_AT_name("servId")
    1366                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("servId")
    1367                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1369                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1370                            .dwattr $C$DW$96, DW_AT_decl_line(0x211)
    1371                            .dwattr $C$DW$96, DW_AT_decl_column(0x17)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   26

    1372                    
    1373                    $C$DW$97        .dwtag  DW_TAG_member
    1374                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$88)
    1375                            .dwattr $C$DW$97, DW_AT_name("entityId")
    1376                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("entityId")
    1377                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1379                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1380                            .dwattr $C$DW$97, DW_AT_decl_line(0x213)
    1381                            .dwattr $C$DW$97, DW_AT_decl_column(0x14)
    1382                    
    1383                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1384                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x20f)
    1385                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    1386                            .dwendtag $C$DW$T$92
    1387                    
    1388                    
    1389                    $C$DW$T$93      .dwtag  DW_TAG_union_type
    1390                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x02)
    1391                    $C$DW$98        .dwtag  DW_TAG_member
    1392                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$77)
    1393                            .dwattr $C$DW$98, DW_AT_name("paramCTS")
    1394                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("paramCTS")
    1395                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1396                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1397                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1398                            .dwattr $C$DW$98, DW_AT_decl_line(0x96)
    1399                            .dwattr $C$DW$98, DW_AT_decl_column(0x08)
    1400                    
    1401                    $C$DW$99        .dwtag  DW_TAG_member
    1402                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$77)
    1403                            .dwattr $C$DW$99, DW_AT_name("paramRTS")
    1404                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("paramRTS")
    1405                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1407                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stack
    1408                            .dwattr $C$DW$99, DW_AT_decl_line(0x97)
    1409                            .dwattr $C$DW$99, DW_AT_decl_column(0x08)
    1410                    
    1411                    $C$DW$100       .dwtag  DW_TAG_member
    1412                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$77)
    1413                            .dwattr $C$DW$100, DW_AT_name("paramDSR")
    1414                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("paramDSR")
    1415                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1417                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1418                            .dwattr $C$DW$100, DW_AT_decl_line(0x98)
    1419                            .dwattr $C$DW$100, DW_AT_decl_column(0x08)
    1420                    
    1421                    $C$DW$101       .dwtag  DW_TAG_member
    1422                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$77)
    1423                            .dwattr $C$DW$101, DW_AT_name("paramDTR")
    1424                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("paramDTR")
    1425                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1426                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   27

    1427                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1428                            .dwattr $C$DW$101, DW_AT_decl_line(0x99)
    1429                            .dwattr $C$DW$101, DW_AT_decl_column(0x08)
    1430                    
    1431                    $C$DW$102       .dwtag  DW_TAG_member
    1432                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$77)
    1433                            .dwattr $C$DW$102, DW_AT_name("paramCD")
    1434                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("paramCD")
    1435                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1437                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1438                            .dwattr $C$DW$102, DW_AT_decl_line(0x9a)
    1439                            .dwattr $C$DW$102, DW_AT_decl_column(0x08)
    1440                    
    1441                    $C$DW$103       .dwtag  DW_TAG_member
    1442                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$77)
    1443                            .dwattr $C$DW$103, DW_AT_name("paramRI")
    1444                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("paramRI")
    1445                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1446                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1447                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1448                            .dwattr $C$DW$103, DW_AT_decl_line(0x9b)
    1449                            .dwattr $C$DW$103, DW_AT_decl_column(0x08)
    1450                    
    1451                    $C$DW$104       .dwtag  DW_TAG_member
    1452                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1453                            .dwattr $C$DW$104, DW_AT_name("baudRate")
    1454                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("baudRate")
    1455                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1456                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1457                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1458                            .dwattr $C$DW$104, DW_AT_decl_line(0x9c)
    1459                            .dwattr $C$DW$104, DW_AT_decl_column(0x0a)
    1460                    
    1461                    $C$DW$105       .dwtag  DW_TAG_member
    1462                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$77)
    1463                            .dwattr $C$DW$105, DW_AT_name("flowControl")
    1464                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("flowControl")
    1465                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1467                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1468                            .dwattr $C$DW$105, DW_AT_decl_line(0x9d)
    1469                            .dwattr $C$DW$105, DW_AT_decl_column(0x08)
    1470                    
    1471                    $C$DW$106       .dwtag  DW_TAG_member
    1472                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$77)
    1473                            .dwattr $C$DW$106, DW_AT_name("flushControl")
    1474                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("flushControl")
    1475                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1477                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1478                            .dwattr $C$DW$106, DW_AT_decl_line(0x9e)
    1479                            .dwattr $C$DW$106, DW_AT_decl_column(0x08)
    1480                    
    1481                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   28

    1482                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x95)
    1483                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    1484                            .dwendtag $C$DW$T$93
    1485                    
    1486                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    1487                            .dwattr $C$DW$T$184, DW_AT_name("halUARTIoctl_t")
    1488                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$93)
    1489                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    1490                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1491                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x9f)
    1492                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x02)
    1493                    
    1494                    
    1495                    $C$DW$T$94      .dwtag  DW_TAG_structure_type
    1496                            .dwattr $C$DW$T$94, DW_AT_name(".ggroup1")
    1497                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x04)
    1498                    $C$DW$107       .dwtag  DW_TAG_member
    1499                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$6)
    1500                            .dwattr $C$DW$107, DW_AT_name("pwrmgr_initialized")
    1501                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("pwrmgr_initialized")
    1502                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1503                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1504                    
    1505                    $C$DW$108       .dwtag  DW_TAG_member
    1506                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1507                            .dwattr $C$DW$108, DW_AT_name("pwrmgr_attribute")
    1508                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("pwrmgr_attribute")
    1509                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1510                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1511                    
    1512                            .dwendtag $C$DW$T$94
    1513                    
    1514                    
    1515                    $C$DW$T$95      .dwtag  DW_TAG_structure_type
    1516                            .dwattr $C$DW$T$95, DW_AT_name("_ICall_LiteCmdStatus_")
    1517                            .dwattr $C$DW$T$95, DW_AT_byte_size(0x01)
    1518                    $C$DW$109       .dwtag  DW_TAG_member
    1519                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$87)
    1520                            .dwattr $C$DW$109, DW_AT_name("cmdId")
    1521                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("cmdId")
    1522                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1524                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    1525                            .dwattr $C$DW$109, DW_AT_decl_line(0x3f0)
    1526                            .dwattr $C$DW$109, DW_AT_decl_column(0x11)
    1527                    
    1528                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1529                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x3ee)
    1530                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x10)
    1531                            .dwendtag $C$DW$T$95
    1532                    
    1533                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    1534                            .dwattr $C$DW$T$186, DW_AT_name("ICall_LiteCmdStatus")
    1535                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$95)
    1536                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   29

    1537                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1538                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x3f1)
    1539                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x03)
    1540                    
    1541                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1542                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1543                    
    1544                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1545                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1546                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1547                    
    1548                    $C$DW$T$187     .dwtag  DW_TAG_typedef
    1549                            .dwattr $C$DW$T$187, DW_AT_name("ICall_Semaphore")
    1550                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$3)
    1551                            .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    1552                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1553                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x1ac)
    1554                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x0f)
    1555                    
    1556                    $C$DW$T$109     .dwtag  DW_TAG_typedef
    1557                            .dwattr $C$DW$T$109, DW_AT_name("ICall_SyncHandle")
    1558                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$3)
    1559                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    1560                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1561                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x1aa)
    1562                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x0f)
    1563                    
    1564                    $C$DW$T$153     .dwtag  DW_TAG_typedef
    1565                            .dwattr $C$DW$T$153, DW_AT_name("ICall_TimerID")
    1566                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$3)
    1567                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    1568                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1569                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x1b7)
    1570                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x0f)
    1571                    
    1572                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    1573                            .dwattr $C$DW$T$188, DW_AT_name("osal_msg_q_t")
    1574                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$3)
    1575                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    1576                            .dwattr $C$DW$T$188, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1577                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x7d)
    1578                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x10)
    1579                    
    1580                    
    1581                    $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    1582                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1583                            .dwendtag $C$DW$T$36
    1584                    
    1585                    $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    1586                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1587                            .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    1588                    
    1589                    $C$DW$T$169     .dwtag  DW_TAG_typedef
    1590                            .dwattr $C$DW$T$169, DW_AT_name("APPASRTINTF_callAssrtHndler")
    1591                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$37)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   30

    1592                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    1593                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1594                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x43)
    1595                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x10)
    1596                    
    1597                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    1598                            .dwattr $C$DW$T$55, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    1599                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$37)
    1600                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1601                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1602                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x5f)
    1603                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x19)
    1604                    
    1605                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    1606                            .dwattr $C$DW$T$38, DW_AT_name("FPTR_RESETDEV_T")
    1607                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1608                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1609                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1610                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x4d)
    1611                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x19)
    1612                    
    1613                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    1614                            .dwattr $C$DW$T$189, DW_AT_name("FPTR_VOID_VOID_T")
    1615                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$37)
    1616                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    1617                            .dwattr $C$DW$T$189, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    1618                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x33)
    1619                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x11)
    1620                    
    1621                    $C$DW$T$190     .dwtag  DW_TAG_typedef
    1622                            .dwattr $C$DW$T$190, DW_AT_name("__TI_atexit_fn")
    1623                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$37)
    1624                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    1625                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include
    1626                            .dwattr $C$DW$T$190, DW_AT_decl_line(0xb9)
    1627                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x14)
    1628                    
    1629                    
    1630                    $C$DW$T$51      .dwtag  DW_TAG_subroutine_type
    1631                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    1632                    $C$DW$110       .dwtag  DW_TAG_formal_parameter
    1633                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
    1634                    
    1635                            .dwendtag $C$DW$T$51
    1636                    
    1637                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    1638                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    1639                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    1640                    
    1641                    $C$DW$T$53      .dwtag  DW_TAG_typedef
    1642                            .dwattr $C$DW$T$53, DW_AT_name("FPTR_RESERVED4_T")
    1643                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1644                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    1645                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1646                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x61)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   31

    1647                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x19)
    1648                    
    1649                    $C$DW$T$54      .dwtag  DW_TAG_typedef
    1650                            .dwattr $C$DW$T$54, DW_AT_name("FPTR_RESERVED5_T")
    1651                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$52)
    1652                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1653                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1654                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x63)
    1655                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x19)
    1656                    
    1657                    
    1658                    $C$DW$T$56      .dwtag  DW_TAG_subroutine_type
    1659                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1660                    $C$DW$111       .dwtag  DW_TAG_formal_parameter
    1661                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
    1662                    
    1663                            .dwendtag $C$DW$T$56
    1664                    
    1665                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    1666                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    1667                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    1668                    
    1669                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    1670                            .dwattr $C$DW$T$60, DW_AT_name("FPTR_ADCCOMPBIN_T")
    1671                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$57)
    1672                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1673                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1674                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x69)
    1675                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
    1676                    
    1677                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    1678                            .dwattr $C$DW$T$58, DW_AT_name("FPTR_COMPAIN_T")
    1679                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1680                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1681                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1682                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x65)
    1683                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x19)
    1684                    
    1685                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    1686                            .dwattr $C$DW$T$59, DW_AT_name("FPTR_COMPAREF_T")
    1687                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$57)
    1688                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1689                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1690                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x67)
    1691                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x19)
    1692                    
    1693                    $C$DW$T$61      .dwtag  DW_TAG_typedef
    1694                            .dwattr $C$DW$T$61, DW_AT_name("FPTR_COMPBREF_T")
    1695                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$57)
    1696                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1697                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    1698                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x6b)
    1699                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x19)
    1700                    
    1701                    $C$DW$T$191     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   32

    1702                            .dwattr $C$DW$T$191, DW_AT_name("FPTR_VOID_UINT8_T")
    1703                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$57)
    1704                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    1705                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    1706                            .dwattr $C$DW$T$191, DW_AT_decl_line(0x34)
    1707                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x11)
    1708                    
    1709                    
    1710                    $C$DW$T$80      .dwtag  DW_TAG_subroutine_type
    1711                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1712                    $C$DW$112       .dwtag  DW_TAG_formal_parameter
    1713                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$74)
    1714                    
    1715                    $C$DW$113       .dwtag  DW_TAG_formal_parameter
    1716                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$74)
    1717                    
    1718                            .dwendtag $C$DW$T$80
    1719                    
    1720                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    1721                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    1722                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    1723                    
    1724                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    1725                            .dwattr $C$DW$T$192, DW_AT_name("assertCback_t")
    1726                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$81)
    1727                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    1728                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1729                            .dwattr $C$DW$T$192, DW_AT_decl_line(0xd3)
    1730                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x10)
    1731                    
    1732                    $C$DW$T$82      .dwtag  DW_TAG_typedef
    1733                            .dwattr $C$DW$T$82, DW_AT_name("halUARTCBack_t")
    1734                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$81)
    1735                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1736                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    1737                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x7b)
    1738                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x10)
    1739                    
    1740                    
    1741                    $C$DW$T$99      .dwtag  DW_TAG_subroutine_type
    1742                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1743                    $C$DW$114       .dwtag  DW_TAG_formal_parameter
    1744                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$97)
    1745                    
    1746                            .dwendtag $C$DW$T$99
    1747                    
    1748                    $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    1749                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    1750                            .dwattr $C$DW$T$100, DW_AT_address_class(0x20)
    1751                    
    1752                    
    1753                    $C$DW$T$131     .dwtag  DW_TAG_subroutine_type
    1754                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    1755                    $C$DW$115       .dwtag  DW_TAG_formal_parameter
    1756                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$129)
TI ARM Assembler PC v16.9.8 Mon Dec 10 17:47:35 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{E889D948-C539-4090-9214-4DB066A44C59} PAGE   33

    1757                    
    1758                    $C$DW$116       .dwtag  DW_TAG_formal_parameter
    1759                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$130)
    1760                    
    1761                            .dwendtag $C$DW$T$131
    1762                    
    1763                    $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    1764                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    1765                            .dwattr $C$DW$T$132, DW_AT_address_class(0x20)
    1766                    
    1767                    $C$DW$T$133     .dwtag  DW_TAG_typedef
    1768                            .dwattr $C$DW$T$133, DW_AT_name("ICall_PwrNotifyFn")
    1769                            .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$132)
    1770                            .dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
    1771                            .dwattr $C$DW$T$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1772                            .dwattr $C$DW$T$133, DW_AT_decl_line(0x333)
    1773                            .dwattr $C$DW$T$133, DW_AT_decl_column(0x10)
    1774                    
    1775                    
    1776                    $C$DW$T$147     .dwtag  DW_TAG_subroutine_type
    1777                            .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
    1778                    $C$DW$117       .dwtag  DW_TAG_formal_parameter
    1779                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$143)
    1780                    
    1781                            .dwendtag $C$DW$T$147
    1782                    
    1783                    $C$DW$T$148     .dwtag  DW_TAG_pointer_type
    1784                            .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$147)
    1785                            .dwattr $C$DW$T$148, DW_AT_address_class(0x20)
    1786                    
    1787                    $C$DW$T$149     .dwtag  DW_TAG_typedef
    1788                            .dwattr $C$DW$T$149, DW_AT_name("ICall_LeaveCS")
    1789                            .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$148)
    1790                            .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    1791                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    1792                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x37e)
    1793                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x10)
    1794                    
    1795                    
    1796                    $C$DW$T$154     .dwtag  DW_TAG_subroutine_type
    1797                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    1798                    $C$DW$118       .dwtag  DW_TAG_formal_parameter
    1799                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$3)
    1800                    
    1801                            .dwendtag $C$DW$T$154
    1802                    
    1803                    $C$DW$T$155     .dwtag  DW_TAG_pointer_type
    1804                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$154)
    1805                            .dwattr $C$DW$T$155, DW_AT_address_class(0x20)
