TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:25 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{33D0DD5A-39F9-4717-B50B-F11BEC8474BE} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Thu Nov 22 09:17:24 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/ccfg.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\colle
      13                            .global __ccfg
      14 00000000                   .sect   ".ccfg:retain"
      15                            .retain
      16                            .align  4
      17                            .elfsym __ccfg,SYM_SIZE(88)
      18 00000000           __ccfg:
      19 00000000 01800000          .bits   25165824,32                     ; __ccfg.CCFG_EXT_LF_CLK @ 0
      20 00000004 FF880010          .bits   -7864304,32                     ; __ccfg.CCFG_MODE_CONF_1 @ 32
      21 00000008 0058FFFD          .bits   5832701,32                      ; __ccfg.CCFG_SIZE_AND_DIS_FLAGS @ 64
      22 0000000c F3BFFF3A          .bits   -205521094,32                   ; __ccfg.CCFG_MODE_CONF @ 96
      23 00000010 FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_VOLT_LOAD_0 @ 128
      24 00000014 FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_VOLT_LOAD_1 @ 160
      25 00000018 FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_RTC_OFFSET @ 192
      26 0000001c FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_FREQ_OFFSET @ 224
      27 00000020 FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_IEEE_MAC_0 @ 256
      28 00000024 FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_IEEE_MAC_1 @ 288
      29 00000028 FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_IEEE_BLE_0 @ 320
      30 0000002c FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_IEEE_BLE_1 @ 352
      31 00000030 C5FE0DC5          .bits   -973206075,32                   ; __ccfg.CCFG_BL_CONFIG @ 384
      32 00000034 FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_ERASE_CONF @ 416
      33 00000038 FFFFFF00          .bits   -256,32                 ; __ccfg.CCFG_CCFG_TI_OPTIONS @ 448
      34 0000003c FFC500C5          .bits   -3866427,32                     ; __ccfg.CCFG_CCFG_TAP_DAP_0 @ 480
      35 00000040 FF000000          .bits   -16777216,32                    ; __ccfg.CCFG_CCFG_TAP_DAP_1 @ 512
      36 00000044 00000000          .bits   0,32                    ; __ccfg.CCFG_IMAGE_VALID_CONF @ 544
      37 00000048 FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_CCFG_PROT_31_0 @ 576
      38 0000004c FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_CCFG_PROT_63_32 @ 608
      39 00000050 FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_CCFG_PROT_95_64 @ 640
      40 00000054 FFFFFFFF          .bits   -1,32                   ; __ccfg.CCFG_CCFG_PROT_127_96 @ 672
      41                    
      42                    $C$DW$1 .dwtag  DW_TAG_variable
      43                            .dwattr $C$DW$1, DW_AT_name("__ccfg")
      44                            .dwattr $C$DW$1, DW_AT_TI_symbol_name("__ccfg")
      45                            .dwattr $C$DW$1, DW_AT_location[DW_OP_addr __ccfg]
      46                            .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$22)
      47                            .dwattr $C$DW$1, DW_AT_external
      48                            .dwattr $C$DW$1, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc1
      49                            .dwattr $C$DW$1, DW_AT_decl_line(0x1f4)
      50                            .dwattr $C$DW$1, DW_AT_decl_column(0x0e)
      51                    
      52                    ;       C:\ti\ccsv7\tools\compiler\ti-cgt-arm_16.9.8.LTS\bin\armopt.exe C:/Users/Einstein/MyWorkspaceC
      53                    
      54                    ;******************************************************************************
      55                    ;* BUILD ATTRIBUTES                                                           *
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:25 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{33D0DD5A-39F9-4717-B50B-F11BEC8474BE} PAGE    2

      56                    ;******************************************************************************
      57                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
      58                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
      59                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
      60                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
      61                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
      62                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
      63                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(0)
      64                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
      65                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
      66                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
      67                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
      68                    
      69                    ;******************************************************************************
      70                    ;* TYPE INFORMATION                                                           *
      71                    ;******************************************************************************
      72                    
      73                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
      74                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x58)
      75                    $C$DW$2 .dwtag  DW_TAG_member
      76                            .dwattr $C$DW$2, DW_AT_type(*$C$DW$T$19)
      77                            .dwattr $C$DW$2, DW_AT_name("CCFG_EXT_LF_CLK")
      78                            .dwattr $C$DW$2, DW_AT_TI_symbol_name("CCFG_EXT_LF_CLK")
      79                            .dwattr $C$DW$2, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
      80                            .dwattr $C$DW$2, DW_AT_accessibility(DW_ACCESS_public)
      81                            .dwattr $C$DW$2, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc1
      82                            .dwattr $C$DW$2, DW_AT_decl_line(0x31)
      83                            .dwattr $C$DW$2, DW_AT_decl_column(0x10)
      84                    
      85                    $C$DW$3 .dwtag  DW_TAG_member
      86                            .dwattr $C$DW$3, DW_AT_type(*$C$DW$T$19)
      87                            .dwattr $C$DW$3, DW_AT_name("CCFG_MODE_CONF_1")
      88                            .dwattr $C$DW$3, DW_AT_TI_symbol_name("CCFG_MODE_CONF_1")
      89                            .dwattr $C$DW$3, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
      90                            .dwattr $C$DW$3, DW_AT_accessibility(DW_ACCESS_public)
      91                            .dwattr $C$DW$3, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc1
      92                            .dwattr $C$DW$3, DW_AT_decl_line(0x32)
      93                            .dwattr $C$DW$3, DW_AT_decl_column(0x10)
      94                    
      95                    $C$DW$4 .dwtag  DW_TAG_member
      96                            .dwattr $C$DW$4, DW_AT_type(*$C$DW$T$19)
      97                            .dwattr $C$DW$4, DW_AT_name("CCFG_SIZE_AND_DIS_FLAGS")
      98                            .dwattr $C$DW$4, DW_AT_TI_symbol_name("CCFG_SIZE_AND_DIS_FLAGS")
      99                            .dwattr $C$DW$4, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     100                            .dwattr $C$DW$4, DW_AT_accessibility(DW_ACCESS_public)
     101                            .dwattr $C$DW$4, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc1
     102                            .dwattr $C$DW$4, DW_AT_decl_line(0x33)
     103                            .dwattr $C$DW$4, DW_AT_decl_column(0x10)
     104                    
     105                    $C$DW$5 .dwtag  DW_TAG_member
     106                            .dwattr $C$DW$5, DW_AT_type(*$C$DW$T$19)
     107                            .dwattr $C$DW$5, DW_AT_name("CCFG_MODE_CONF")
     108                            .dwattr $C$DW$5, DW_AT_TI_symbol_name("CCFG_MODE_CONF")
     109                            .dwattr $C$DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     110                            .dwattr $C$DW$5, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:25 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{33D0DD5A-39F9-4717-B50B-F11BEC8474BE} PAGE    3

     111                            .dwattr $C$DW$5, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc1
     112                            .dwattr $C$DW$5, DW_AT_decl_line(0x34)
     113                            .dwattr $C$DW$5, DW_AT_decl_column(0x10)
     114                    
     115                    $C$DW$6 .dwtag  DW_TAG_member
     116                            .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$19)
     117                            .dwattr $C$DW$6, DW_AT_name("CCFG_VOLT_LOAD_0")
     118                            .dwattr $C$DW$6, DW_AT_TI_symbol_name("CCFG_VOLT_LOAD_0")
     119                            .dwattr $C$DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     120                            .dwattr $C$DW$6, DW_AT_accessibility(DW_ACCESS_public)
     121                            .dwattr $C$DW$6, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc1
     122                            .dwattr $C$DW$6, DW_AT_decl_line(0x35)
     123                            .dwattr $C$DW$6, DW_AT_decl_column(0x10)
     124                    
     125                    $C$DW$7 .dwtag  DW_TAG_member
     126                            .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$19)
     127                            .dwattr $C$DW$7, DW_AT_name("CCFG_VOLT_LOAD_1")
     128                            .dwattr $C$DW$7, DW_AT_TI_symbol_name("CCFG_VOLT_LOAD_1")
     129                            .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     130                            .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     131                            .dwattr $C$DW$7, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc1
     132                            .dwattr $C$DW$7, DW_AT_decl_line(0x36)
     133                            .dwattr $C$DW$7, DW_AT_decl_column(0x10)
     134                    
     135                    $C$DW$8 .dwtag  DW_TAG_member
     136                            .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$19)
     137                            .dwattr $C$DW$8, DW_AT_name("CCFG_RTC_OFFSET")
     138                            .dwattr $C$DW$8, DW_AT_TI_symbol_name("CCFG_RTC_OFFSET")
     139                            .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     140                            .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     141                            .dwattr $C$DW$8, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc1
     142                            .dwattr $C$DW$8, DW_AT_decl_line(0x37)
     143                            .dwattr $C$DW$8, DW_AT_decl_column(0x10)
     144                    
     145                    $C$DW$9 .dwtag  DW_TAG_member
     146                            .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     147                            .dwattr $C$DW$9, DW_AT_name("CCFG_FREQ_OFFSET")
     148                            .dwattr $C$DW$9, DW_AT_TI_symbol_name("CCFG_FREQ_OFFSET")
     149                            .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     150                            .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     151                            .dwattr $C$DW$9, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc1
     152                            .dwattr $C$DW$9, DW_AT_decl_line(0x38)
     153                            .dwattr $C$DW$9, DW_AT_decl_column(0x10)
     154                    
     155                    $C$DW$10        .dwtag  DW_TAG_member
     156                            .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     157                            .dwattr $C$DW$10, DW_AT_name("CCFG_IEEE_MAC_0")
     158                            .dwattr $C$DW$10, DW_AT_TI_symbol_name("CCFG_IEEE_MAC_0")
     159                            .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     160                            .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     161                            .dwattr $C$DW$10, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     162                            .dwattr $C$DW$10, DW_AT_decl_line(0x39)
     163                            .dwattr $C$DW$10, DW_AT_decl_column(0x10)
     164                    
     165                    $C$DW$11        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:25 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{33D0DD5A-39F9-4717-B50B-F11BEC8474BE} PAGE    4

     166                            .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     167                            .dwattr $C$DW$11, DW_AT_name("CCFG_IEEE_MAC_1")
     168                            .dwattr $C$DW$11, DW_AT_TI_symbol_name("CCFG_IEEE_MAC_1")
     169                            .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     170                            .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     171                            .dwattr $C$DW$11, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     172                            .dwattr $C$DW$11, DW_AT_decl_line(0x3a)
     173                            .dwattr $C$DW$11, DW_AT_decl_column(0x10)
     174                    
     175                    $C$DW$12        .dwtag  DW_TAG_member
     176                            .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     177                            .dwattr $C$DW$12, DW_AT_name("CCFG_IEEE_BLE_0")
     178                            .dwattr $C$DW$12, DW_AT_TI_symbol_name("CCFG_IEEE_BLE_0")
     179                            .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     180                            .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     181                            .dwattr $C$DW$12, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     182                            .dwattr $C$DW$12, DW_AT_decl_line(0x3b)
     183                            .dwattr $C$DW$12, DW_AT_decl_column(0x10)
     184                    
     185                    $C$DW$13        .dwtag  DW_TAG_member
     186                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     187                            .dwattr $C$DW$13, DW_AT_name("CCFG_IEEE_BLE_1")
     188                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("CCFG_IEEE_BLE_1")
     189                            .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     190                            .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     191                            .dwattr $C$DW$13, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     192                            .dwattr $C$DW$13, DW_AT_decl_line(0x3c)
     193                            .dwattr $C$DW$13, DW_AT_decl_column(0x10)
     194                    
     195                    $C$DW$14        .dwtag  DW_TAG_member
     196                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     197                            .dwattr $C$DW$14, DW_AT_name("CCFG_BL_CONFIG")
     198                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("CCFG_BL_CONFIG")
     199                            .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     200                            .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     201                            .dwattr $C$DW$14, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     202                            .dwattr $C$DW$14, DW_AT_decl_line(0x3d)
     203                            .dwattr $C$DW$14, DW_AT_decl_column(0x10)
     204                    
     205                    $C$DW$15        .dwtag  DW_TAG_member
     206                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     207                            .dwattr $C$DW$15, DW_AT_name("CCFG_ERASE_CONF")
     208                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("CCFG_ERASE_CONF")
     209                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     210                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     211                            .dwattr $C$DW$15, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     212                            .dwattr $C$DW$15, DW_AT_decl_line(0x3e)
     213                            .dwattr $C$DW$15, DW_AT_decl_column(0x10)
     214                    
     215                    $C$DW$16        .dwtag  DW_TAG_member
     216                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     217                            .dwattr $C$DW$16, DW_AT_name("CCFG_CCFG_TI_OPTIONS")
     218                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("CCFG_CCFG_TI_OPTIONS")
     219                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     220                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:25 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{33D0DD5A-39F9-4717-B50B-F11BEC8474BE} PAGE    5

     221                            .dwattr $C$DW$16, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     222                            .dwattr $C$DW$16, DW_AT_decl_line(0x3f)
     223                            .dwattr $C$DW$16, DW_AT_decl_column(0x10)
     224                    
     225                    $C$DW$17        .dwtag  DW_TAG_member
     226                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     227                            .dwattr $C$DW$17, DW_AT_name("CCFG_CCFG_TAP_DAP_0")
     228                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("CCFG_CCFG_TAP_DAP_0")
     229                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     230                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     231                            .dwattr $C$DW$17, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     232                            .dwattr $C$DW$17, DW_AT_decl_line(0x40)
     233                            .dwattr $C$DW$17, DW_AT_decl_column(0x10)
     234                    
     235                    $C$DW$18        .dwtag  DW_TAG_member
     236                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     237                            .dwattr $C$DW$18, DW_AT_name("CCFG_CCFG_TAP_DAP_1")
     238                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("CCFG_CCFG_TAP_DAP_1")
     239                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     240                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     241                            .dwattr $C$DW$18, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     242                            .dwattr $C$DW$18, DW_AT_decl_line(0x41)
     243                            .dwattr $C$DW$18, DW_AT_decl_column(0x10)
     244                    
     245                    $C$DW$19        .dwtag  DW_TAG_member
     246                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     247                            .dwattr $C$DW$19, DW_AT_name("CCFG_IMAGE_VALID_CONF")
     248                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("CCFG_IMAGE_VALID_CONF")
     249                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     250                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     251                            .dwattr $C$DW$19, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     252                            .dwattr $C$DW$19, DW_AT_decl_line(0x42)
     253                            .dwattr $C$DW$19, DW_AT_decl_column(0x10)
     254                    
     255                    $C$DW$20        .dwtag  DW_TAG_member
     256                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     257                            .dwattr $C$DW$20, DW_AT_name("CCFG_CCFG_PROT_31_0")
     258                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_31_0")
     259                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     260                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     261                            .dwattr $C$DW$20, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     262                            .dwattr $C$DW$20, DW_AT_decl_line(0x43)
     263                            .dwattr $C$DW$20, DW_AT_decl_column(0x10)
     264                    
     265                    $C$DW$21        .dwtag  DW_TAG_member
     266                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     267                            .dwattr $C$DW$21, DW_AT_name("CCFG_CCFG_PROT_63_32")
     268                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_63_32")
     269                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     270                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     271                            .dwattr $C$DW$21, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     272                            .dwattr $C$DW$21, DW_AT_decl_line(0x44)
     273                            .dwattr $C$DW$21, DW_AT_decl_column(0x10)
     274                    
     275                    $C$DW$22        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:25 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{33D0DD5A-39F9-4717-B50B-F11BEC8474BE} PAGE    6

     276                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     277                            .dwattr $C$DW$22, DW_AT_name("CCFG_CCFG_PROT_95_64")
     278                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_95_64")
     279                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     280                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     281                            .dwattr $C$DW$22, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     282                            .dwattr $C$DW$22, DW_AT_decl_line(0x45)
     283                            .dwattr $C$DW$22, DW_AT_decl_column(0x10)
     284                    
     285                    $C$DW$23        .dwtag  DW_TAG_member
     286                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     287                            .dwattr $C$DW$23, DW_AT_name("CCFG_CCFG_PROT_127_96")
     288                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("CCFG_CCFG_PROT_127_96")
     289                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     290                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     291                            .dwattr $C$DW$23, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     292                            .dwattr $C$DW$23, DW_AT_decl_line(0x46)
     293                            .dwattr $C$DW$23, DW_AT_decl_column(0x10)
     294                    
     295                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     296                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x30)
     297                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
     298                            .dwendtag $C$DW$T$20
     299                    
     300                    $C$DW$T$21      .dwtag  DW_TAG_typedef
     301                            .dwattr $C$DW$T$21, DW_AT_name("ccfg_t")
     302                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     303                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
     304                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     305                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x47)
     306                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x03)
     307                    
     308                    $C$DW$T$22      .dwtag  DW_TAG_const_type
     309                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     310                    
     311                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     312                            .dwattr $C$DW$T$2, DW_AT_name("void")
     313                    
     314                    
     315                    $C$DW$T$23      .dwtag  DW_TAG_subroutine_type
     316                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     317                            .dwendtag $C$DW$T$23
     318                    
     319                    $C$DW$T$24      .dwtag  DW_TAG_pointer_type
     320                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     321                            .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
     322                    
     323                    $C$DW$T$25      .dwtag  DW_TAG_typedef
     324                            .dwattr $C$DW$T$25, DW_AT_name("FPTR_VOID_VOID_T")
     325                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     326                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     327                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     328                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x33)
     329                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x11)
     330                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:25 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{33D0DD5A-39F9-4717-B50B-F11BEC8474BE} PAGE    7

     331                    
     332                    $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
     333                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     334                    $C$DW$24        .dwtag  DW_TAG_formal_parameter
     335                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$26)
     336                    
     337                            .dwendtag $C$DW$T$27
     338                    
     339                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
     340                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
     341                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
     342                    
     343                    $C$DW$T$29      .dwtag  DW_TAG_typedef
