TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Thu Nov 22 09:17:19 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HAL/target/dbg.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\colle
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   62

    3354                            .dwattr $C$DW$T$899, DW_AT_name("tFlashStateCommandsType")
    3355                            .dwattr $C$DW$T$899, DW_AT_type(*$C$DW$T$898)
    3356                            .dwattr $C$DW$T$899, DW_AT_language(DW_LANG_C)
    3357                            .dwattr $C$DW$T$899, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    3358                            .dwattr $C$DW$T$899, DW_AT_decl_line(0xb0)
    3359                            .dwattr $C$DW$T$899, DW_AT_decl_column(0x03)
    3360                    
    3361                    
    3362                    $C$DW$T$900     .dwtag  DW_TAG_enumeration_type
    3363                            .dwattr $C$DW$T$900, DW_AT_byte_size(0x01)
    3364                    $C$DW$328       .dwtag  DW_TAG_enumerator
    3365                            .dwattr $C$DW$328, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    3366                            .dwattr $C$DW$328, DW_AT_const_value(0xe0)
    3367                            .dwattr $C$DW$328, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3368                            .dwattr $C$DW$328, DW_AT_decl_line(0x3de)
    3369                            .dwattr $C$DW$328, DW_AT_decl_column(0x04)
    3370                    
    3371                    $C$DW$329       .dwtag  DW_TAG_enumerator
    3372                            .dwattr $C$DW$329, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    3373                            .dwattr $C$DW$329, DW_AT_const_value(0xe1)
    3374                            .dwattr $C$DW$329, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3375                            .dwattr $C$DW$329, DW_AT_decl_line(0x3e0)
    3376                            .dwattr $C$DW$329, DW_AT_decl_column(0x04)
    3377                    
    3378                    $C$DW$330       .dwtag  DW_TAG_enumerator
    3379                            .dwattr $C$DW$330, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    3380                            .dwattr $C$DW$330, DW_AT_const_value(0xe2)
    3381                            .dwattr $C$DW$330, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3382                            .dwattr $C$DW$330, DW_AT_decl_line(0x3e2)
    3383                            .dwattr $C$DW$330, DW_AT_decl_column(0x04)
    3384                    
    3385                    $C$DW$331       .dwtag  DW_TAG_enumerator
    3386                            .dwattr $C$DW$331, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    3387                            .dwattr $C$DW$331, DW_AT_const_value(0xe3)
    3388                            .dwattr $C$DW$331, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3389                            .dwattr $C$DW$331, DW_AT_decl_line(0x3e4)
    3390                            .dwattr $C$DW$331, DW_AT_decl_column(0x04)
    3391                    
    3392                    $C$DW$332       .dwtag  DW_TAG_enumerator
    3393                            .dwattr $C$DW$332, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    3394                            .dwattr $C$DW$332, DW_AT_const_value(0xe4)
    3395                            .dwattr $C$DW$332, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3396                            .dwattr $C$DW$332, DW_AT_decl_line(0x3e6)
    3397                            .dwattr $C$DW$332, DW_AT_decl_column(0x04)
    3398                    
    3399                    $C$DW$333       .dwtag  DW_TAG_enumerator
    3400                            .dwattr $C$DW$333, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    3401                            .dwattr $C$DW$333, DW_AT_const_value(0xe5)
    3402                            .dwattr $C$DW$333, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    3403                            .dwattr $C$DW$333, DW_AT_decl_line(0x3e8)
    3404                            .dwattr $C$DW$333, DW_AT_decl_column(0x04)
    3405                    
    3406                            .dwattr $C$DW$T$900, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3407                            .dwattr $C$DW$T$900, DW_AT_decl_line(0x3dc)
    3408                            .dwattr $C$DW$T$900, DW_AT_decl_column(0x01)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   63

    3409                            .dwendtag $C$DW$T$900
    3410                    
    3411                    $C$DW$T$901     .dwtag  DW_TAG_typedef
    3412                            .dwattr $C$DW$T$901, DW_AT_name("ICall_RemotiCmdEvent_t")
    3413                            .dwattr $C$DW$T$901, DW_AT_type(*$C$DW$T$900)
    3414                            .dwattr $C$DW$T$901, DW_AT_language(DW_LANG_C)
    3415                            .dwattr $C$DW$T$901, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    3416                            .dwattr $C$DW$T$901, DW_AT_decl_line(0x3e9)
    3417                            .dwattr $C$DW$T$901, DW_AT_decl_column(0x02)
    3418                    
    3419                    
    3420                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3421                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    3422                    $C$DW$334       .dwtag  DW_TAG_member
    3423                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$20)
    3424                            .dwattr $C$DW$334, DW_AT_name("pCurrEntry")
    3425                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("pCurrEntry")
    3426                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3427                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3428                            .dwattr $C$DW$334, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3429                            .dwattr $C$DW$334, DW_AT_decl_line(0x41)
    3430                            .dwattr $C$DW$334, DW_AT_decl_column(0x0d)
    3431                    
    3432                    $C$DW$335       .dwtag  DW_TAG_member
    3433                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$20)
    3434                            .dwattr $C$DW$335, DW_AT_name("pLastEntry")
    3435                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("pLastEntry")
    3436                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3437                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3438                            .dwattr $C$DW$335, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    3439                            .dwattr $C$DW$335, DW_AT_decl_line(0x42)
    3440                            .dwattr $C$DW$335, DW_AT_decl_column(0x0d)
    3441                    
    3442                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    3443                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x40)
    3444                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3445                            .dwendtag $C$DW$T$21
    3446                    
    3447                    $C$DW$T$738     .dwtag  DW_TAG_typedef
    3448                            .dwattr $C$DW$T$738, DW_AT_name("dataQueue_t")
    3449                            .dwattr $C$DW$T$738, DW_AT_type(*$C$DW$T$21)
    3450                            .dwattr $C$DW$T$738, DW_AT_language(DW_LANG_C)
    3451                            .dwattr $C$DW$T$738, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    3452                            .dwattr $C$DW$T$738, DW_AT_decl_line(0x43)
    3453                            .dwattr $C$DW$T$738, DW_AT_decl_column(0x03)
    3454                    
    3455                    $C$DW$T$739     .dwtag  DW_TAG_pointer_type
    3456                            .dwattr $C$DW$T$739, DW_AT_type(*$C$DW$T$738)
    3457                            .dwattr $C$DW$T$739, DW_AT_address_class(0x20)
    3458                    
    3459                    
    3460                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3461                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    3462                    $C$DW$336       .dwtag  DW_TAG_member
    3463                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   64

    3464                            .dwattr $C$DW$336, DW_AT_name("triggerType")
    3465                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("triggerType")
    3466                            .dwattr $C$DW$336, DW_AT_bit_offset(0x04)
    3467                            .dwattr $C$DW$336, DW_AT_bit_size(0x04)
    3468                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3469                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3470                            .dwattr $C$DW$336, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3471                            .dwattr $C$DW$336, DW_AT_decl_line(0x7d)
    3472                            .dwattr $C$DW$336, DW_AT_decl_column(0x0f)
    3473                    
    3474                    $C$DW$337       .dwtag  DW_TAG_member
    3475                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
    3476                            .dwattr $C$DW$337, DW_AT_name("bEnaCmd")
    3477                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("bEnaCmd")
    3478                            .dwattr $C$DW$337, DW_AT_bit_offset(0x03)
    3479                            .dwattr $C$DW$337, DW_AT_bit_size(0x01)
    3480                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3481                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3482                            .dwattr $C$DW$337, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3483                            .dwattr $C$DW$337, DW_AT_decl_line(0x7e)
    3484                            .dwattr $C$DW$337, DW_AT_decl_column(0x0f)
    3485                    
    3486                    $C$DW$338       .dwtag  DW_TAG_member
    3487                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    3488                            .dwattr $C$DW$338, DW_AT_name("triggerNo")
    3489                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("triggerNo")
    3490                            .dwattr $C$DW$338, DW_AT_bit_offset(0x01)
    3491                            .dwattr $C$DW$338, DW_AT_bit_size(0x02)
    3492                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3493                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3494                            .dwattr $C$DW$338, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3495                            .dwattr $C$DW$338, DW_AT_decl_line(0x80)
    3496                            .dwattr $C$DW$338, DW_AT_decl_column(0x0f)
    3497                    
    3498                    $C$DW$339       .dwtag  DW_TAG_member
    3499                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    3500                            .dwattr $C$DW$339, DW_AT_name("pastTrig")
    3501                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("pastTrig")
    3502                            .dwattr $C$DW$339, DW_AT_bit_offset(0x00)
    3503                            .dwattr $C$DW$339, DW_AT_bit_size(0x01)
    3504                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3505                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3506                            .dwattr $C$DW$339, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3507                            .dwattr $C$DW$339, DW_AT_decl_line(0x81)
    3508                            .dwattr $C$DW$339, DW_AT_decl_column(0x0f)
    3509                    
    3510                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3511                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x7c)
    3512                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x0b)
    3513                            .dwendtag $C$DW$T$22
    3514                    
    3515                    
    3516                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3517                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    3518                    $C$DW$340       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   65

    3519                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    3520                            .dwattr $C$DW$340, DW_AT_name("rule")
    3521                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("rule")
    3522                            .dwattr $C$DW$340, DW_AT_bit_offset(0x04)
    3523                            .dwattr $C$DW$340, DW_AT_bit_size(0x04)
    3524                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3525                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3526                            .dwattr $C$DW$340, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3527                            .dwattr $C$DW$340, DW_AT_decl_line(0x85)
    3528                            .dwattr $C$DW$340, DW_AT_decl_column(0x0f)
    3529                    
    3530                    $C$DW$341       .dwtag  DW_TAG_member
    3531                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    3532                            .dwattr $C$DW$341, DW_AT_name("nSkip")
    3533                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("nSkip")
    3534                            .dwattr $C$DW$341, DW_AT_bit_offset(0x00)
    3535                            .dwattr $C$DW$341, DW_AT_bit_size(0x04)
    3536                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3537                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3538                            .dwattr $C$DW$341, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3539                            .dwattr $C$DW$341, DW_AT_decl_line(0x86)
    3540                            .dwattr $C$DW$341, DW_AT_decl_column(0x0f)
    3541                    
    3542                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3543                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x84)
    3544                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0b)
    3545                            .dwendtag $C$DW$T$23
    3546                    
    3547                    
    3548                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3549                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    3550                    $C$DW$342       .dwtag  DW_TAG_member
    3551                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    3552                            .dwattr $C$DW$342, DW_AT_name("triggerType")
    3553                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("triggerType")
    3554                            .dwattr $C$DW$342, DW_AT_bit_offset(0x04)
    3555                            .dwattr $C$DW$342, DW_AT_bit_size(0x04)
    3556                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3557                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3558                            .dwattr $C$DW$342, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3559                            .dwattr $C$DW$342, DW_AT_decl_line(0x98)
    3560                            .dwattr $C$DW$342, DW_AT_decl_column(0x0f)
    3561                    
    3562                    $C$DW$343       .dwtag  DW_TAG_member
    3563                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    3564                            .dwattr $C$DW$343, DW_AT_name("bEnaCmd")
    3565                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("bEnaCmd")
    3566                            .dwattr $C$DW$343, DW_AT_bit_offset(0x03)
    3567                            .dwattr $C$DW$343, DW_AT_bit_size(0x01)
    3568                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3569                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    3570                            .dwattr $C$DW$343, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3571                            .dwattr $C$DW$343, DW_AT_decl_line(0x99)
    3572                            .dwattr $C$DW$343, DW_AT_decl_column(0x0f)
    3573                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   66

    3574                    $C$DW$344       .dwtag  DW_TAG_member
    3575                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    3576                            .dwattr $C$DW$344, DW_AT_name("triggerNo")
    3577                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("triggerNo")
    3578                            .dwattr $C$DW$344, DW_AT_bit_offset(0x01)
    3579                            .dwattr $C$DW$344, DW_AT_bit_size(0x02)
    3580                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3581                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3582                            .dwattr $C$DW$344, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3583                            .dwattr $C$DW$344, DW_AT_decl_line(0x9b)
    3584                            .dwattr $C$DW$344, DW_AT_decl_column(0x0f)
    3585                    
    3586                    $C$DW$345       .dwtag  DW_TAG_member
    3587                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    3588                            .dwattr $C$DW$345, DW_AT_name("pastTrig")
    3589                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("pastTrig")
    3590                            .dwattr $C$DW$345, DW_AT_bit_offset(0x00)
    3591                            .dwattr $C$DW$345, DW_AT_bit_size(0x01)
    3592                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3593                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3594                            .dwattr $C$DW$345, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3595                            .dwattr $C$DW$345, DW_AT_decl_line(0x9c)
    3596                            .dwattr $C$DW$345, DW_AT_decl_column(0x0f)
    3597                    
    3598                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3599                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x97)
    3600                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x0b)
    3601                            .dwendtag $C$DW$T$24
    3602                    
    3603                    
    3604                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3605                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    3606                    $C$DW$346       .dwtag  DW_TAG_member
    3607                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    3608                            .dwattr $C$DW$346, DW_AT_name("rule")
    3609                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("rule")
    3610                            .dwattr $C$DW$346, DW_AT_bit_offset(0x04)
    3611                            .dwattr $C$DW$346, DW_AT_bit_size(0x04)
    3612                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3613                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3614                            .dwattr $C$DW$346, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3615                            .dwattr $C$DW$346, DW_AT_decl_line(0xa0)
    3616                            .dwattr $C$DW$346, DW_AT_decl_column(0x0f)
    3617                    
    3618                    $C$DW$347       .dwtag  DW_TAG_member
    3619                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    3620                            .dwattr $C$DW$347, DW_AT_name("nSkip")
    3621                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("nSkip")
    3622                            .dwattr $C$DW$347, DW_AT_bit_offset(0x00)
    3623                            .dwattr $C$DW$347, DW_AT_bit_size(0x04)
    3624                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3625                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3626                            .dwattr $C$DW$347, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3627                            .dwattr $C$DW$347, DW_AT_decl_line(0xa1)
    3628                            .dwattr $C$DW$347, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   67

    3629                    
    3630                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3631                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x9f)
    3632                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x0b)
    3633                            .dwendtag $C$DW$T$25
    3634                    
    3635                    
    3636                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3637                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    3638                    $C$DW$348       .dwtag  DW_TAG_member
    3639                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    3640                            .dwattr $C$DW$348, DW_AT_name("triggerType")
    3641                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("triggerType")
    3642                            .dwattr $C$DW$348, DW_AT_bit_offset(0x04)
    3643                            .dwattr $C$DW$348, DW_AT_bit_size(0x04)
    3644                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3645                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3646                            .dwattr $C$DW$348, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3647                            .dwattr $C$DW$348, DW_AT_decl_line(0xb3)
    3648                            .dwattr $C$DW$348, DW_AT_decl_column(0x0f)
    3649                    
    3650                    $C$DW$349       .dwtag  DW_TAG_member
    3651                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    3652                            .dwattr $C$DW$349, DW_AT_name("bEnaCmd")
    3653                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("bEnaCmd")
    3654                            .dwattr $C$DW$349, DW_AT_bit_offset(0x03)
    3655                            .dwattr $C$DW$349, DW_AT_bit_size(0x01)
    3656                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3657                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3658                            .dwattr $C$DW$349, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3659                            .dwattr $C$DW$349, DW_AT_decl_line(0xb4)
    3660                            .dwattr $C$DW$349, DW_AT_decl_column(0x0f)
    3661                    
    3662                    $C$DW$350       .dwtag  DW_TAG_member
    3663                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    3664                            .dwattr $C$DW$350, DW_AT_name("triggerNo")
    3665                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("triggerNo")
    3666                            .dwattr $C$DW$350, DW_AT_bit_offset(0x01)
    3667                            .dwattr $C$DW$350, DW_AT_bit_size(0x02)
    3668                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3669                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    3670                            .dwattr $C$DW$350, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3671                            .dwattr $C$DW$350, DW_AT_decl_line(0xb6)
    3672                            .dwattr $C$DW$350, DW_AT_decl_column(0x0f)
    3673                    
    3674                    $C$DW$351       .dwtag  DW_TAG_member
    3675                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
    3676                            .dwattr $C$DW$351, DW_AT_name("pastTrig")
    3677                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("pastTrig")
    3678                            .dwattr $C$DW$351, DW_AT_bit_offset(0x00)
    3679                            .dwattr $C$DW$351, DW_AT_bit_size(0x01)
    3680                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3681                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    3682                            .dwattr $C$DW$351, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3683                            .dwattr $C$DW$351, DW_AT_decl_line(0xb7)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   68

    3684                            .dwattr $C$DW$351, DW_AT_decl_column(0x0f)
    3685                    
    3686                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3687                            .dwattr $C$DW$T$26, DW_AT_decl_line(0xb2)
    3688                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    3689                            .dwendtag $C$DW$T$26
    3690                    
    3691                    
    3692                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3693                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    3694                    $C$DW$352       .dwtag  DW_TAG_member
    3695                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$19)
    3696                            .dwattr $C$DW$352, DW_AT_name("rule")
    3697                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("rule")
    3698                            .dwattr $C$DW$352, DW_AT_bit_offset(0x04)
    3699                            .dwattr $C$DW$352, DW_AT_bit_size(0x04)
    3700                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3701                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    3702                            .dwattr $C$DW$352, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3703                            .dwattr $C$DW$352, DW_AT_decl_line(0xbb)
    3704                            .dwattr $C$DW$352, DW_AT_decl_column(0x0f)
    3705                    
    3706                    $C$DW$353       .dwtag  DW_TAG_member
    3707                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$19)
    3708                            .dwattr $C$DW$353, DW_AT_name("nSkip")
    3709                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("nSkip")
    3710                            .dwattr $C$DW$353, DW_AT_bit_offset(0x00)
    3711                            .dwattr $C$DW$353, DW_AT_bit_size(0x04)
    3712                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3713                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    3714                            .dwattr $C$DW$353, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3715                            .dwattr $C$DW$353, DW_AT_decl_line(0xbc)
    3716                            .dwattr $C$DW$353, DW_AT_decl_column(0x0f)
    3717                    
    3718                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3719                            .dwattr $C$DW$T$27, DW_AT_decl_line(0xba)
    3720                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    3721                            .dwendtag $C$DW$T$27
    3722                    
    3723                    
    3724                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3725                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    3726                    $C$DW$354       .dwtag  DW_TAG_member
    3727                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$28)
    3728                            .dwattr $C$DW$354, DW_AT_name("frontEndMode")
    3729                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("frontEndMode")
    3730                            .dwattr $C$DW$354, DW_AT_bit_offset(0x0d)
    3731                            .dwattr $C$DW$354, DW_AT_bit_size(0x03)
    3732                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3733                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    3734                            .dwattr $C$DW$354, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3735                            .dwattr $C$DW$354, DW_AT_decl_line(0xc9)
    3736                            .dwattr $C$DW$354, DW_AT_decl_column(0x10)
    3737                    
    3738                    $C$DW$355       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   69

    3739                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$28)
    3740                            .dwattr $C$DW$355, DW_AT_name("biasMode")
    3741                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("biasMode")
    3742                            .dwattr $C$DW$355, DW_AT_bit_offset(0x0c)
    3743                            .dwattr $C$DW$355, DW_AT_bit_size(0x01)
    3744                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3745                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    3746                            .dwattr $C$DW$355, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3747                            .dwattr $C$DW$355, DW_AT_decl_line(0xcf)
    3748                            .dwattr $C$DW$355, DW_AT_decl_column(0x10)
    3749                    
    3750                    $C$DW$356       .dwtag  DW_TAG_member
    3751                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$28)
    3752                            .dwattr $C$DW$356, DW_AT_name("analogCfgMode")
    3753                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("analogCfgMode")
    3754                            .dwattr $C$DW$356, DW_AT_bit_offset(0x06)
    3755                            .dwattr $C$DW$356, DW_AT_bit_size(0x06)
    3756                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3757                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    3758                            .dwattr $C$DW$356, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3759                            .dwattr $C$DW$356, DW_AT_decl_line(0xd1)
    3760                            .dwattr $C$DW$356, DW_AT_decl_column(0x10)
    3761                    
    3762                    $C$DW$357       .dwtag  DW_TAG_member
    3763                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$28)
    3764                            .dwattr $C$DW$357, DW_AT_name("bNoFsPowerUp")
    3765                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("bNoFsPowerUp")
    3766                            .dwattr $C$DW$357, DW_AT_bit_offset(0x05)
    3767                            .dwattr $C$DW$357, DW_AT_bit_size(0x01)
    3768                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3769                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    3770                            .dwattr $C$DW$357, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3771                            .dwattr $C$DW$357, DW_AT_decl_line(0xd8)
    3772                            .dwattr $C$DW$357, DW_AT_decl_column(0x10)
    3773                    
    3774                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3775                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xc8)
    3776                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    3777                            .dwendtag $C$DW$T$29
    3778                    
    3779                    
    3780                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3781                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    3782                    $C$DW$358       .dwtag  DW_TAG_member
    3783                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
    3784                            .dwattr $C$DW$358, DW_AT_name("triggerType")
    3785                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("triggerType")
    3786                            .dwattr $C$DW$358, DW_AT_bit_offset(0x04)
    3787                            .dwattr $C$DW$358, DW_AT_bit_size(0x04)
    3788                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3789                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    3790                            .dwattr $C$DW$358, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3791                            .dwattr $C$DW$358, DW_AT_decl_line(0xee)
    3792                            .dwattr $C$DW$358, DW_AT_decl_column(0x0f)
    3793                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   70

    3794                    $C$DW$359       .dwtag  DW_TAG_member
    3795                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    3796                            .dwattr $C$DW$359, DW_AT_name("bEnaCmd")
    3797                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("bEnaCmd")
    3798                            .dwattr $C$DW$359, DW_AT_bit_offset(0x03)
    3799                            .dwattr $C$DW$359, DW_AT_bit_size(0x01)
    3800                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3801                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3802                            .dwattr $C$DW$359, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3803                            .dwattr $C$DW$359, DW_AT_decl_line(0xef)
    3804                            .dwattr $C$DW$359, DW_AT_decl_column(0x0f)
    3805                    
    3806                    $C$DW$360       .dwtag  DW_TAG_member
    3807                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
    3808                            .dwattr $C$DW$360, DW_AT_name("triggerNo")
    3809                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("triggerNo")
    3810                            .dwattr $C$DW$360, DW_AT_bit_offset(0x01)
    3811                            .dwattr $C$DW$360, DW_AT_bit_size(0x02)
    3812                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3813                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3814                            .dwattr $C$DW$360, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3815                            .dwattr $C$DW$360, DW_AT_decl_line(0xf1)
    3816                            .dwattr $C$DW$360, DW_AT_decl_column(0x0f)
    3817                    
    3818                    $C$DW$361       .dwtag  DW_TAG_member
    3819                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
    3820                            .dwattr $C$DW$361, DW_AT_name("pastTrig")
    3821                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("pastTrig")
    3822                            .dwattr $C$DW$361, DW_AT_bit_offset(0x00)
    3823                            .dwattr $C$DW$361, DW_AT_bit_size(0x01)
    3824                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3825                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3826                            .dwattr $C$DW$361, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3827                            .dwattr $C$DW$361, DW_AT_decl_line(0xf2)
    3828                            .dwattr $C$DW$361, DW_AT_decl_column(0x0f)
    3829                    
    3830                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3831                            .dwattr $C$DW$T$30, DW_AT_decl_line(0xed)
    3832                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
    3833                            .dwendtag $C$DW$T$30
    3834                    
    3835                    
    3836                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3837                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    3838                    $C$DW$362       .dwtag  DW_TAG_member
    3839                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$19)
    3840                            .dwattr $C$DW$362, DW_AT_name("rule")
    3841                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("rule")
    3842                            .dwattr $C$DW$362, DW_AT_bit_offset(0x04)
    3843                            .dwattr $C$DW$362, DW_AT_bit_size(0x04)
    3844                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3845                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3846                            .dwattr $C$DW$362, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3847                            .dwattr $C$DW$362, DW_AT_decl_line(0xf6)
    3848                            .dwattr $C$DW$362, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   71

    3849                    
    3850                    $C$DW$363       .dwtag  DW_TAG_member
    3851                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
    3852                            .dwattr $C$DW$363, DW_AT_name("nSkip")
    3853                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("nSkip")
    3854                            .dwattr $C$DW$363, DW_AT_bit_offset(0x00)
    3855                            .dwattr $C$DW$363, DW_AT_bit_size(0x04)
    3856                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3857                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3858                            .dwattr $C$DW$363, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3859                            .dwattr $C$DW$363, DW_AT_decl_line(0xf7)
    3860                            .dwattr $C$DW$363, DW_AT_decl_column(0x0f)
    3861                    
    3862                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3863                            .dwattr $C$DW$T$31, DW_AT_decl_line(0xf5)
    3864                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0b)
    3865                            .dwendtag $C$DW$T$31
    3866                    
    3867                    
    3868                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3869                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    3870                    $C$DW$364       .dwtag  DW_TAG_member
    3871                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
    3872                            .dwattr $C$DW$364, DW_AT_name("bTxMode")
    3873                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("bTxMode")
    3874                            .dwattr $C$DW$364, DW_AT_bit_offset(0x07)
    3875                            .dwattr $C$DW$364, DW_AT_bit_size(0x01)
    3876                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3877                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3878                            .dwattr $C$DW$364, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3879                            .dwattr $C$DW$364, DW_AT_decl_line(0xfc)
    3880                            .dwattr $C$DW$364, DW_AT_decl_column(0x0f)
    3881                    
    3882                    $C$DW$365       .dwtag  DW_TAG_member
    3883                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$19)
    3884                            .dwattr $C$DW$365, DW_AT_name("refFreq")
    3885                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("refFreq")
    3886                            .dwattr $C$DW$365, DW_AT_bit_offset(0x01)
    3887                            .dwattr $C$DW$365, DW_AT_bit_size(0x06)
    3888                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3889                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3890                            .dwattr $C$DW$365, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3891                            .dwattr $C$DW$365, DW_AT_decl_line(0xfe)
    3892                            .dwattr $C$DW$365, DW_AT_decl_column(0x0f)
    3893                    
    3894                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3895                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xfb)
    3896                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    3897                            .dwendtag $C$DW$T$32
    3898                    
    3899                    
    3900                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3901                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    3902                    $C$DW$366       .dwtag  DW_TAG_member
    3903                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   72

    3904                            .dwattr $C$DW$366, DW_AT_name("triggerType")
    3905                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("triggerType")
    3906                            .dwattr $C$DW$366, DW_AT_bit_offset(0x04)
    3907                            .dwattr $C$DW$366, DW_AT_bit_size(0x04)
    3908                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3909                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3910                            .dwattr $C$DW$366, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3911                            .dwattr $C$DW$366, DW_AT_decl_line(0x115)
    3912                            .dwattr $C$DW$366, DW_AT_decl_column(0x0f)
    3913                    
    3914                    $C$DW$367       .dwtag  DW_TAG_member
    3915                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
    3916                            .dwattr $C$DW$367, DW_AT_name("bEnaCmd")
    3917                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("bEnaCmd")
    3918                            .dwattr $C$DW$367, DW_AT_bit_offset(0x03)
    3919                            .dwattr $C$DW$367, DW_AT_bit_size(0x01)
    3920                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3921                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3922                            .dwattr $C$DW$367, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3923                            .dwattr $C$DW$367, DW_AT_decl_line(0x116)
    3924                            .dwattr $C$DW$367, DW_AT_decl_column(0x0f)
    3925                    
    3926                    $C$DW$368       .dwtag  DW_TAG_member
    3927                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
    3928                            .dwattr $C$DW$368, DW_AT_name("triggerNo")
    3929                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("triggerNo")
    3930                            .dwattr $C$DW$368, DW_AT_bit_offset(0x01)
    3931                            .dwattr $C$DW$368, DW_AT_bit_size(0x02)
    3932                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3933                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3934                            .dwattr $C$DW$368, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3935                            .dwattr $C$DW$368, DW_AT_decl_line(0x118)
    3936                            .dwattr $C$DW$368, DW_AT_decl_column(0x0f)
    3937                    
    3938                    $C$DW$369       .dwtag  DW_TAG_member
    3939                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
    3940                            .dwattr $C$DW$369, DW_AT_name("pastTrig")
    3941                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("pastTrig")
    3942                            .dwattr $C$DW$369, DW_AT_bit_offset(0x00)
    3943                            .dwattr $C$DW$369, DW_AT_bit_size(0x01)
    3944                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3945                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3946                            .dwattr $C$DW$369, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3947                            .dwattr $C$DW$369, DW_AT_decl_line(0x119)
    3948                            .dwattr $C$DW$369, DW_AT_decl_column(0x0f)
    3949                    
    3950                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3951                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x114)
    3952                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    3953                            .dwendtag $C$DW$T$33
    3954                    
    3955                    
    3956                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3957                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    3958                    $C$DW$370       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   73

    3959                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$19)
    3960                            .dwattr $C$DW$370, DW_AT_name("rule")
    3961                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("rule")
    3962                            .dwattr $C$DW$370, DW_AT_bit_offset(0x04)
    3963                            .dwattr $C$DW$370, DW_AT_bit_size(0x04)
    3964                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3965                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3966                            .dwattr $C$DW$370, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3967                            .dwattr $C$DW$370, DW_AT_decl_line(0x11d)
    3968                            .dwattr $C$DW$370, DW_AT_decl_column(0x0f)
    3969                    
    3970                    $C$DW$371       .dwtag  DW_TAG_member
    3971                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
    3972                            .dwattr $C$DW$371, DW_AT_name("nSkip")
    3973                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("nSkip")
    3974                            .dwattr $C$DW$371, DW_AT_bit_offset(0x00)
    3975                            .dwattr $C$DW$371, DW_AT_bit_size(0x04)
    3976                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3977                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3978                            .dwattr $C$DW$371, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3979                            .dwattr $C$DW$371, DW_AT_decl_line(0x11e)
    3980                            .dwattr $C$DW$371, DW_AT_decl_column(0x0f)
    3981                    
    3982                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    3983                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x11c)
    3984                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    3985                            .dwendtag $C$DW$T$34
    3986                    
    3987                    
    3988                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3989                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    3990                    $C$DW$372       .dwtag  DW_TAG_member
    3991                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    3992                            .dwattr $C$DW$372, DW_AT_name("triggerType")
    3993                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("triggerType")
    3994                            .dwattr $C$DW$372, DW_AT_bit_offset(0x04)
    3995                            .dwattr $C$DW$372, DW_AT_bit_size(0x04)
    3996                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3997                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3998                            .dwattr $C$DW$372, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    3999                            .dwattr $C$DW$372, DW_AT_decl_line(0x130)
    4000                            .dwattr $C$DW$372, DW_AT_decl_column(0x0f)
    4001                    
    4002                    $C$DW$373       .dwtag  DW_TAG_member
    4003                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$19)
    4004                            .dwattr $C$DW$373, DW_AT_name("bEnaCmd")
    4005                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("bEnaCmd")
    4006                            .dwattr $C$DW$373, DW_AT_bit_offset(0x03)
    4007                            .dwattr $C$DW$373, DW_AT_bit_size(0x01)
    4008                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4009                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4010                            .dwattr $C$DW$373, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4011                            .dwattr $C$DW$373, DW_AT_decl_line(0x131)
    4012                            .dwattr $C$DW$373, DW_AT_decl_column(0x0f)
    4013                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   74

    4014                    $C$DW$374       .dwtag  DW_TAG_member
    4015                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
    4016                            .dwattr $C$DW$374, DW_AT_name("triggerNo")
    4017                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("triggerNo")
    4018                            .dwattr $C$DW$374, DW_AT_bit_offset(0x01)
    4019                            .dwattr $C$DW$374, DW_AT_bit_size(0x02)
    4020                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4021                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4022                            .dwattr $C$DW$374, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4023                            .dwattr $C$DW$374, DW_AT_decl_line(0x133)
    4024                            .dwattr $C$DW$374, DW_AT_decl_column(0x0f)
    4025                    
    4026                    $C$DW$375       .dwtag  DW_TAG_member
    4027                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$19)
    4028                            .dwattr $C$DW$375, DW_AT_name("pastTrig")
    4029                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("pastTrig")
    4030                            .dwattr $C$DW$375, DW_AT_bit_offset(0x00)
    4031                            .dwattr $C$DW$375, DW_AT_bit_size(0x01)
    4032                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4033                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4034                            .dwattr $C$DW$375, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4035                            .dwattr $C$DW$375, DW_AT_decl_line(0x134)
    4036                            .dwattr $C$DW$375, DW_AT_decl_column(0x0f)
    4037                    
    4038                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4039                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x12f)
    4040                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    4041                            .dwendtag $C$DW$T$35
    4042                    
    4043                    
    4044                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4045                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4046                    $C$DW$376       .dwtag  DW_TAG_member
    4047                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
    4048                            .dwattr $C$DW$376, DW_AT_name("rule")
    4049                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("rule")
    4050                            .dwattr $C$DW$376, DW_AT_bit_offset(0x04)
    4051                            .dwattr $C$DW$376, DW_AT_bit_size(0x04)
    4052                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4053                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4054                            .dwattr $C$DW$376, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4055                            .dwattr $C$DW$376, DW_AT_decl_line(0x138)
    4056                            .dwattr $C$DW$376, DW_AT_decl_column(0x0f)
    4057                    
    4058                    $C$DW$377       .dwtag  DW_TAG_member
    4059                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    4060                            .dwattr $C$DW$377, DW_AT_name("nSkip")
    4061                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("nSkip")
    4062                            .dwattr $C$DW$377, DW_AT_bit_offset(0x00)
    4063                            .dwattr $C$DW$377, DW_AT_bit_size(0x04)
    4064                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4065                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4066                            .dwattr $C$DW$377, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4067                            .dwattr $C$DW$377, DW_AT_decl_line(0x139)
    4068                            .dwattr $C$DW$377, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   75

    4069                    
    4070                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4071                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x137)
    4072                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    4073                            .dwendtag $C$DW$T$36
    4074                    
    4075                    
    4076                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4077                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4078                    $C$DW$378       .dwtag  DW_TAG_member
    4079                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
    4080                            .dwattr $C$DW$378, DW_AT_name("bEnaFifo")
    4081                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("bEnaFifo")
    4082                            .dwattr $C$DW$378, DW_AT_bit_offset(0x07)
    4083                            .dwattr $C$DW$378, DW_AT_bit_size(0x01)
    4084                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4085                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4086                            .dwattr $C$DW$378, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4087                            .dwattr $C$DW$378, DW_AT_decl_line(0x13c)
    4088                            .dwattr $C$DW$378, DW_AT_decl_column(0x0f)
    4089                    
    4090                    $C$DW$379       .dwtag  DW_TAG_member
    4091                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
    4092                            .dwattr $C$DW$379, DW_AT_name("bFsOff")
    4093                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("bFsOff")
    4094                            .dwattr $C$DW$379, DW_AT_bit_offset(0x06)
    4095                            .dwattr $C$DW$379, DW_AT_bit_size(0x01)
    4096                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4097                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4098                            .dwattr $C$DW$379, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4099                            .dwattr $C$DW$379, DW_AT_decl_line(0x13e)
    4100                            .dwattr $C$DW$379, DW_AT_decl_column(0x0f)
    4101                    
    4102                    $C$DW$380       .dwtag  DW_TAG_member
    4103                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    4104                            .dwattr $C$DW$380, DW_AT_name("bNoSync")
    4105                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("bNoSync")
    4106                            .dwattr $C$DW$380, DW_AT_bit_offset(0x05)
    4107                            .dwattr $C$DW$380, DW_AT_bit_size(0x01)
    4108                            .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4109                            .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4110                            .dwattr $C$DW$380, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4111                            .dwattr $C$DW$380, DW_AT_decl_line(0x140)
    4112                            .dwattr $C$DW$380, DW_AT_decl_column(0x0f)
    4113                    
    4114                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4115                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x13b)
    4116                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    4117                            .dwendtag $C$DW$T$37
    4118                    
    4119                    
    4120                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4121                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    4122                    $C$DW$381       .dwtag  DW_TAG_member
    4123                            .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   76

    4124                            .dwattr $C$DW$381, DW_AT_name("triggerType")
    4125                            .dwattr $C$DW$381, DW_AT_TI_symbol_name("triggerType")
    4126                            .dwattr $C$DW$381, DW_AT_bit_offset(0x04)
    4127                            .dwattr $C$DW$381, DW_AT_bit_size(0x04)
    4128                            .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4129                            .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4130                            .dwattr $C$DW$381, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4131                            .dwattr $C$DW$381, DW_AT_decl_line(0x144)
    4132                            .dwattr $C$DW$381, DW_AT_decl_column(0x0f)
    4133                    
    4134                    $C$DW$382       .dwtag  DW_TAG_member
    4135                            .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$19)
    4136                            .dwattr $C$DW$382, DW_AT_name("bEnaCmd")
    4137                            .dwattr $C$DW$382, DW_AT_TI_symbol_name("bEnaCmd")
    4138                            .dwattr $C$DW$382, DW_AT_bit_offset(0x03)
    4139                            .dwattr $C$DW$382, DW_AT_bit_size(0x01)
    4140                            .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4141                            .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4142                            .dwattr $C$DW$382, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4143                            .dwattr $C$DW$382, DW_AT_decl_line(0x145)
    4144                            .dwattr $C$DW$382, DW_AT_decl_column(0x0f)
    4145                    
    4146                    $C$DW$383       .dwtag  DW_TAG_member
    4147                            .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
    4148                            .dwattr $C$DW$383, DW_AT_name("triggerNo")
    4149                            .dwattr $C$DW$383, DW_AT_TI_symbol_name("triggerNo")
    4150                            .dwattr $C$DW$383, DW_AT_bit_offset(0x01)
    4151                            .dwattr $C$DW$383, DW_AT_bit_size(0x02)
    4152                            .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4153                            .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4154                            .dwattr $C$DW$383, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4155                            .dwattr $C$DW$383, DW_AT_decl_line(0x147)
    4156                            .dwattr $C$DW$383, DW_AT_decl_column(0x0f)
    4157                    
    4158                    $C$DW$384       .dwtag  DW_TAG_member
    4159                            .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
    4160                            .dwattr $C$DW$384, DW_AT_name("pastTrig")
    4161                            .dwattr $C$DW$384, DW_AT_TI_symbol_name("pastTrig")
    4162                            .dwattr $C$DW$384, DW_AT_bit_offset(0x00)
    4163                            .dwattr $C$DW$384, DW_AT_bit_size(0x01)
    4164                            .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4165                            .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4166                            .dwattr $C$DW$384, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4167                            .dwattr $C$DW$384, DW_AT_decl_line(0x148)
    4168                            .dwattr $C$DW$384, DW_AT_decl_column(0x0f)
    4169                    
    4170                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4171                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x143)
    4172                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    4173                            .dwendtag $C$DW$T$38
    4174                    
    4175                    
    4176                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4177                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    4178                    $C$DW$385       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   77

    4179                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$19)
    4180                            .dwattr $C$DW$385, DW_AT_name("triggerType")
    4181                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("triggerType")
    4182                            .dwattr $C$DW$385, DW_AT_bit_offset(0x04)
    4183                            .dwattr $C$DW$385, DW_AT_bit_size(0x04)
    4184                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4185                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4186                            .dwattr $C$DW$385, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4187                            .dwattr $C$DW$385, DW_AT_decl_line(0x15d)
    4188                            .dwattr $C$DW$385, DW_AT_decl_column(0x0f)
    4189                    
    4190                    $C$DW$386       .dwtag  DW_TAG_member
    4191                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
    4192                            .dwattr $C$DW$386, DW_AT_name("bEnaCmd")
    4193                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("bEnaCmd")
    4194                            .dwattr $C$DW$386, DW_AT_bit_offset(0x03)
    4195                            .dwattr $C$DW$386, DW_AT_bit_size(0x01)
    4196                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4197                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4198                            .dwattr $C$DW$386, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4199                            .dwattr $C$DW$386, DW_AT_decl_line(0x15e)
    4200                            .dwattr $C$DW$386, DW_AT_decl_column(0x0f)
    4201                    
    4202                    $C$DW$387       .dwtag  DW_TAG_member
    4203                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
    4204                            .dwattr $C$DW$387, DW_AT_name("triggerNo")
    4205                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("triggerNo")
    4206                            .dwattr $C$DW$387, DW_AT_bit_offset(0x01)
    4207                            .dwattr $C$DW$387, DW_AT_bit_size(0x02)
    4208                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4209                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4210                            .dwattr $C$DW$387, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4211                            .dwattr $C$DW$387, DW_AT_decl_line(0x160)
    4212                            .dwattr $C$DW$387, DW_AT_decl_column(0x0f)
    4213                    
    4214                    $C$DW$388       .dwtag  DW_TAG_member
    4215                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    4216                            .dwattr $C$DW$388, DW_AT_name("pastTrig")
    4217                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("pastTrig")
    4218                            .dwattr $C$DW$388, DW_AT_bit_offset(0x00)
    4219                            .dwattr $C$DW$388, DW_AT_bit_size(0x01)
    4220                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4221                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4222                            .dwattr $C$DW$388, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4223                            .dwattr $C$DW$388, DW_AT_decl_line(0x161)
    4224                            .dwattr $C$DW$388, DW_AT_decl_column(0x0f)
    4225                    
    4226                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4227                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x15c)
    4228                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    4229                            .dwendtag $C$DW$T$39
    4230                    
    4231                    
    4232                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4233                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   78

    4234                    $C$DW$389       .dwtag  DW_TAG_member
    4235                            .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    4236                            .dwattr $C$DW$389, DW_AT_name("rule")
    4237                            .dwattr $C$DW$389, DW_AT_TI_symbol_name("rule")
    4238                            .dwattr $C$DW$389, DW_AT_bit_offset(0x04)
    4239                            .dwattr $C$DW$389, DW_AT_bit_size(0x04)
    4240                            .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4241                            .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4242                            .dwattr $C$DW$389, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4243                            .dwattr $C$DW$389, DW_AT_decl_line(0x165)
    4244                            .dwattr $C$DW$389, DW_AT_decl_column(0x0f)
    4245                    
    4246                    $C$DW$390       .dwtag  DW_TAG_member
    4247                            .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$19)
    4248                            .dwattr $C$DW$390, DW_AT_name("nSkip")
    4249                            .dwattr $C$DW$390, DW_AT_TI_symbol_name("nSkip")
    4250                            .dwattr $C$DW$390, DW_AT_bit_offset(0x00)
    4251                            .dwattr $C$DW$390, DW_AT_bit_size(0x04)
    4252                            .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4253                            .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4254                            .dwattr $C$DW$390, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4255                            .dwattr $C$DW$390, DW_AT_decl_line(0x166)
    4256                            .dwattr $C$DW$390, DW_AT_decl_column(0x0f)
    4257                    
    4258                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4259                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x164)
    4260                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    4261                            .dwendtag $C$DW$T$40
    4262                    
    4263                    
    4264                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4265                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    4266                    $C$DW$391       .dwtag  DW_TAG_member
    4267                            .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
    4268                            .dwattr $C$DW$391, DW_AT_name("bUseCw")
    4269                            .dwattr $C$DW$391, DW_AT_TI_symbol_name("bUseCw")
    4270                            .dwattr $C$DW$391, DW_AT_bit_offset(0x07)
    4271                            .dwattr $C$DW$391, DW_AT_bit_size(0x01)
    4272                            .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4273                            .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4274                            .dwattr $C$DW$391, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4275                            .dwattr $C$DW$391, DW_AT_decl_line(0x169)
    4276                            .dwattr $C$DW$391, DW_AT_decl_column(0x0f)
    4277                    
    4278                    $C$DW$392       .dwtag  DW_TAG_member
    4279                            .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
    4280                            .dwattr $C$DW$392, DW_AT_name("bFsOff")
    4281                            .dwattr $C$DW$392, DW_AT_TI_symbol_name("bFsOff")
    4282                            .dwattr $C$DW$392, DW_AT_bit_offset(0x06)
    4283                            .dwattr $C$DW$392, DW_AT_bit_size(0x01)
    4284                            .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4285                            .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4286                            .dwattr $C$DW$392, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4287                            .dwattr $C$DW$392, DW_AT_decl_line(0x16b)
    4288                            .dwattr $C$DW$392, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   79

    4289                    
    4290                    $C$DW$393       .dwtag  DW_TAG_member
    4291                            .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
    4292                            .dwattr $C$DW$393, DW_AT_name("whitenMode")
    4293                            .dwattr $C$DW$393, DW_AT_TI_symbol_name("whitenMode")
    4294                            .dwattr $C$DW$393, DW_AT_bit_offset(0x04)
    4295                            .dwattr $C$DW$393, DW_AT_bit_size(0x02)
    4296                            .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4297                            .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4298                            .dwattr $C$DW$393, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4299                            .dwattr $C$DW$393, DW_AT_decl_line(0x16d)
    4300                            .dwattr $C$DW$393, DW_AT_decl_column(0x0f)
    4301                    
    4302                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4303                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x168)
    4304                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    4305                            .dwendtag $C$DW$T$41
    4306                    
    4307                    
    4308                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    4309                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    4310                    $C$DW$394       .dwtag  DW_TAG_member
    4311                            .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
    4312                            .dwattr $C$DW$394, DW_AT_name("triggerType")
    4313                            .dwattr $C$DW$394, DW_AT_TI_symbol_name("triggerType")
    4314                            .dwattr $C$DW$394, DW_AT_bit_offset(0x04)
    4315                            .dwattr $C$DW$394, DW_AT_bit_size(0x04)
    4316                            .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4317                            .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4318                            .dwattr $C$DW$394, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4319                            .dwattr $C$DW$394, DW_AT_decl_line(0x176)
    4320                            .dwattr $C$DW$394, DW_AT_decl_column(0x0f)
    4321                    
    4322                    $C$DW$395       .dwtag  DW_TAG_member
    4323                            .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    4324                            .dwattr $C$DW$395, DW_AT_name("bEnaCmd")
    4325                            .dwattr $C$DW$395, DW_AT_TI_symbol_name("bEnaCmd")
    4326                            .dwattr $C$DW$395, DW_AT_bit_offset(0x03)
    4327                            .dwattr $C$DW$395, DW_AT_bit_size(0x01)
    4328                            .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4329                            .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4330                            .dwattr $C$DW$395, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4331                            .dwattr $C$DW$395, DW_AT_decl_line(0x177)
    4332                            .dwattr $C$DW$395, DW_AT_decl_column(0x0f)
    4333                    
    4334                    $C$DW$396       .dwtag  DW_TAG_member
    4335                            .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    4336                            .dwattr $C$DW$396, DW_AT_name("triggerNo")
    4337                            .dwattr $C$DW$396, DW_AT_TI_symbol_name("triggerNo")
    4338                            .dwattr $C$DW$396, DW_AT_bit_offset(0x01)
    4339                            .dwattr $C$DW$396, DW_AT_bit_size(0x02)
    4340                            .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4341                            .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4342                            .dwattr $C$DW$396, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4343                            .dwattr $C$DW$396, DW_AT_decl_line(0x179)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   80

    4344                            .dwattr $C$DW$396, DW_AT_decl_column(0x0f)
    4345                    
    4346                    $C$DW$397       .dwtag  DW_TAG_member
    4347                            .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    4348                            .dwattr $C$DW$397, DW_AT_name("pastTrig")
    4349                            .dwattr $C$DW$397, DW_AT_TI_symbol_name("pastTrig")
    4350                            .dwattr $C$DW$397, DW_AT_bit_offset(0x00)
    4351                            .dwattr $C$DW$397, DW_AT_bit_size(0x01)
    4352                            .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4353                            .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4354                            .dwattr $C$DW$397, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4355                            .dwattr $C$DW$397, DW_AT_decl_line(0x17a)
    4356                            .dwattr $C$DW$397, DW_AT_decl_column(0x0f)
    4357                    
    4358                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4359                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x175)
    4360                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    4361                            .dwendtag $C$DW$T$42
    4362                    
    4363                    
    4364                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    4365                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    4366                    $C$DW$398       .dwtag  DW_TAG_member
    4367                            .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    4368                            .dwattr $C$DW$398, DW_AT_name("triggerType")
    4369                            .dwattr $C$DW$398, DW_AT_TI_symbol_name("triggerType")
    4370                            .dwattr $C$DW$398, DW_AT_bit_offset(0x04)
    4371                            .dwattr $C$DW$398, DW_AT_bit_size(0x04)
    4372                            .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4373                            .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4374                            .dwattr $C$DW$398, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4375                            .dwattr $C$DW$398, DW_AT_decl_line(0x18f)
    4376                            .dwattr $C$DW$398, DW_AT_decl_column(0x0f)
    4377                    
    4378                    $C$DW$399       .dwtag  DW_TAG_member
    4379                            .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$19)
    4380                            .dwattr $C$DW$399, DW_AT_name("bEnaCmd")
    4381                            .dwattr $C$DW$399, DW_AT_TI_symbol_name("bEnaCmd")
    4382                            .dwattr $C$DW$399, DW_AT_bit_offset(0x03)
    4383                            .dwattr $C$DW$399, DW_AT_bit_size(0x01)
    4384                            .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4385                            .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4386                            .dwattr $C$DW$399, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4387                            .dwattr $C$DW$399, DW_AT_decl_line(0x190)
    4388                            .dwattr $C$DW$399, DW_AT_decl_column(0x0f)
    4389                    
    4390                    $C$DW$400       .dwtag  DW_TAG_member
    4391                            .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$19)
    4392                            .dwattr $C$DW$400, DW_AT_name("triggerNo")
    4393                            .dwattr $C$DW$400, DW_AT_TI_symbol_name("triggerNo")
    4394                            .dwattr $C$DW$400, DW_AT_bit_offset(0x01)
    4395                            .dwattr $C$DW$400, DW_AT_bit_size(0x02)
    4396                            .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4397                            .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4398                            .dwattr $C$DW$400, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   81

    4399                            .dwattr $C$DW$400, DW_AT_decl_line(0x192)
    4400                            .dwattr $C$DW$400, DW_AT_decl_column(0x0f)
    4401                    
    4402                    $C$DW$401       .dwtag  DW_TAG_member
    4403                            .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
    4404                            .dwattr $C$DW$401, DW_AT_name("pastTrig")
    4405                            .dwattr $C$DW$401, DW_AT_TI_symbol_name("pastTrig")
    4406                            .dwattr $C$DW$401, DW_AT_bit_offset(0x00)
    4407                            .dwattr $C$DW$401, DW_AT_bit_size(0x01)
    4408                            .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4409                            .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4410                            .dwattr $C$DW$401, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4411                            .dwattr $C$DW$401, DW_AT_decl_line(0x193)
    4412                            .dwattr $C$DW$401, DW_AT_decl_column(0x0f)
    4413                    
    4414                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4415                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x18e)
    4416                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    4417                            .dwendtag $C$DW$T$43
    4418                    
    4419                    
    4420                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    4421                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    4422                    $C$DW$402       .dwtag  DW_TAG_member
    4423                            .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
    4424                            .dwattr $C$DW$402, DW_AT_name("rule")
    4425                            .dwattr $C$DW$402, DW_AT_TI_symbol_name("rule")
    4426                            .dwattr $C$DW$402, DW_AT_bit_offset(0x04)
    4427                            .dwattr $C$DW$402, DW_AT_bit_size(0x04)
    4428                            .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4429                            .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4430                            .dwattr $C$DW$402, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4431                            .dwattr $C$DW$402, DW_AT_decl_line(0x197)
    4432                            .dwattr $C$DW$402, DW_AT_decl_column(0x0f)
    4433                    
    4434                    $C$DW$403       .dwtag  DW_TAG_member
    4435                            .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
    4436                            .dwattr $C$DW$403, DW_AT_name("nSkip")
    4437                            .dwattr $C$DW$403, DW_AT_TI_symbol_name("nSkip")
    4438                            .dwattr $C$DW$403, DW_AT_bit_offset(0x00)
    4439                            .dwattr $C$DW$403, DW_AT_bit_size(0x04)
    4440                            .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4441                            .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4442                            .dwattr $C$DW$403, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4443                            .dwattr $C$DW$403, DW_AT_decl_line(0x198)
    4444                            .dwattr $C$DW$403, DW_AT_decl_column(0x0f)
    4445                    
    4446                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4447                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x196)
    4448                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    4449                            .dwendtag $C$DW$T$44
    4450                    
    4451                    
    4452                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    4453                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   82

    4454                    $C$DW$404       .dwtag  DW_TAG_member
    4455                            .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    4456                            .dwattr $C$DW$404, DW_AT_name("triggerType")
    4457                            .dwattr $C$DW$404, DW_AT_TI_symbol_name("triggerType")
    4458                            .dwattr $C$DW$404, DW_AT_bit_offset(0x04)
    4459                            .dwattr $C$DW$404, DW_AT_bit_size(0x04)
    4460                            .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4461                            .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4462                            .dwattr $C$DW$404, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4463                            .dwattr $C$DW$404, DW_AT_decl_line(0x1ad)
    4464                            .dwattr $C$DW$404, DW_AT_decl_column(0x0f)
    4465                    
    4466                    $C$DW$405       .dwtag  DW_TAG_member
    4467                            .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    4468                            .dwattr $C$DW$405, DW_AT_name("bEnaCmd")
    4469                            .dwattr $C$DW$405, DW_AT_TI_symbol_name("bEnaCmd")
    4470                            .dwattr $C$DW$405, DW_AT_bit_offset(0x03)
    4471                            .dwattr $C$DW$405, DW_AT_bit_size(0x01)
    4472                            .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4473                            .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4474                            .dwattr $C$DW$405, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4475                            .dwattr $C$DW$405, DW_AT_decl_line(0x1ae)
    4476                            .dwattr $C$DW$405, DW_AT_decl_column(0x0f)
    4477                    
    4478                    $C$DW$406       .dwtag  DW_TAG_member
    4479                            .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    4480                            .dwattr $C$DW$406, DW_AT_name("triggerNo")
    4481                            .dwattr $C$DW$406, DW_AT_TI_symbol_name("triggerNo")
    4482                            .dwattr $C$DW$406, DW_AT_bit_offset(0x01)
    4483                            .dwattr $C$DW$406, DW_AT_bit_size(0x02)
    4484                            .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4485                            .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    4486                            .dwattr $C$DW$406, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4487                            .dwattr $C$DW$406, DW_AT_decl_line(0x1b0)
    4488                            .dwattr $C$DW$406, DW_AT_decl_column(0x0f)
    4489                    
    4490                    $C$DW$407       .dwtag  DW_TAG_member
    4491                            .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$19)
    4492                            .dwattr $C$DW$407, DW_AT_name("pastTrig")
    4493                            .dwattr $C$DW$407, DW_AT_TI_symbol_name("pastTrig")
    4494                            .dwattr $C$DW$407, DW_AT_bit_offset(0x00)
    4495                            .dwattr $C$DW$407, DW_AT_bit_size(0x01)
    4496                            .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4497                            .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4498                            .dwattr $C$DW$407, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4499                            .dwattr $C$DW$407, DW_AT_decl_line(0x1b1)
    4500                            .dwattr $C$DW$407, DW_AT_decl_column(0x0f)
    4501                    
    4502                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4503                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x1ac)
    4504                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    4505                            .dwendtag $C$DW$T$45
    4506                    
    4507                    
    4508                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:19 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0A1B4502-55D5-4075-A592-E774FCD3E034} PAGE   83

    4509                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    4510                    $C$DW$408       .dwtag  DW_TAG_member
    4511                            .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    4512                            .dwattr $C$DW$408, DW_AT_name("rule")
    4513                            .dwattr $C$DW$408, DW_AT_TI_symbol_name("rule")
    4514                            .dwattr $C$DW$408, DW_AT_bit_offset(0x04)
    4515                            .dwattr $C$DW$408, DW_AT_bit_size(0x04)
    4516                            .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4517                            .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4518                            .dwattr $C$DW$408, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4519                            .dwattr $C$DW$408, DW_AT_decl_line(0x1b5)
    4520                            .dwattr $C$DW$408, DW_AT_decl_column(0x0f)
    4521                    
    4522                    $C$DW$409       .dwtag  DW_TAG_member
    4523                            .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    4524                            .dwattr $C$DW$409, DW_AT_name("nSkip")
    4525                            .dwattr $C$DW$409, DW_AT_TI_symbol_name("nSkip")
    4526                            .dwattr $C$DW$409, DW_AT_bit_offset(0x00)
    4527                            .dwattr $C$DW$409, DW_AT_bit_size(0x04)
    4528                            .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4529                            .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4530                            .dwattr $C$DW$409, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4531                            .dwattr $C$DW$409, DW_AT_decl_line(0x1b6)
    4532                            .dwattr $C$DW$409, DW_AT_decl_column(0x0f)
    4533                    
    4534                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    4535                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x1b4)
    4536                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x0b)
    4537                            .dwendtag $C$DW$T$46
    4538                    
    4539                    
    4540                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
