TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Thu Nov 22 09:17:21 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/LowLevel/mac_settings.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\colle
      13                            .global RF_cmdPropRadioDivSetup

     909                            .dwattr $C$DW$57, DW_AT_decl_line(0x5ed)
     910                            .dwattr $C$DW$57, DW_AT_decl_column(0x05)
     911                    
     912                    $C$DW$58        .dwtag  DW_TAG_enumerator
     913                            .dwattr $C$DW$58, DW_AT_name("RF_AllowDelayAny")
     914                            .dwattr $C$DW$58, DW_AT_const_value(-1)
     915                            .dwattr $C$DW$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/rf
     916                            .dwattr $C$DW$58, DW_AT_decl_line(0x5ee)
     917                            .dwattr $C$DW$58, DW_AT_decl_column(0x05)
     918                    
     919                            .dwattr $C$DW$T$403, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
     920                            .dwattr $C$DW$T$403, DW_AT_decl_line(0x5ec)
     921                            .dwattr $C$DW$T$403, DW_AT_decl_column(0x0e)
     922                            .dwendtag $C$DW$T$403
     923                    
     924                    $C$DW$T$404     .dwtag  DW_TAG_typedef
     925                            .dwattr $C$DW$T$404, DW_AT_name("RF_AllowDelay")
     926                            .dwattr $C$DW$T$404, DW_AT_type(*$C$DW$T$403)
     927                            .dwattr $C$DW$T$404, DW_AT_language(DW_LANG_C)
     928                            .dwattr $C$DW$T$404, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
     929                            .dwattr $C$DW$T$404, DW_AT_decl_line(0x5ef)
     930                            .dwattr $C$DW$T$404, DW_AT_decl_column(0x03)
     931                    
     932                    
     933                    $C$DW$T$405     .dwtag  DW_TAG_enumeration_type
     934                            .dwattr $C$DW$T$405, DW_AT_byte_size(0x01)
     935                    $C$DW$59        .dwtag  DW_TAG_enumerator
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   18

     936                            .dwattr $C$DW$59, DW_AT_name("RF_RatChannelAny")
     937                            .dwattr $C$DW$59, DW_AT_const_value(-1)
     938                            .dwattr $C$DW$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/rf
     939                            .dwattr $C$DW$59, DW_AT_decl_line(0x60f)
     940                            .dwattr $C$DW$59, DW_AT_decl_column(0x05)
     941                    
     942                    $C$DW$60        .dwtag  DW_TAG_enumerator
     943                            .dwattr $C$DW$60, DW_AT_name("RF_RatChannel0")
     944                            .dwattr $C$DW$60, DW_AT_const_value(0x00)
     945                            .dwattr $C$DW$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/rf
     946                            .dwattr $C$DW$60, DW_AT_decl_line(0x610)
     947                            .dwattr $C$DW$60, DW_AT_decl_column(0x05)
     948                    
     949                    $C$DW$61        .dwtag  DW_TAG_enumerator
     950                            .dwattr $C$DW$61, DW_AT_name("RF_RatChannel1")
     951                            .dwattr $C$DW$61, DW_AT_const_value(0x01)
     952                            .dwattr $C$DW$61, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/rf
     953                            .dwattr $C$DW$61, DW_AT_decl_line(0x611)
     954                            .dwattr $C$DW$61, DW_AT_decl_column(0x05)
     955                    
     956                    $C$DW$62        .dwtag  DW_TAG_enumerator
     957                            .dwattr $C$DW$62, DW_AT_name("RF_RatChannel2")
     958                            .dwattr $C$DW$62, DW_AT_const_value(0x02)
     959                            .dwattr $C$DW$62, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/rf
     960                            .dwattr $C$DW$62, DW_AT_decl_line(0x612)
     961                            .dwattr $C$DW$62, DW_AT_decl_column(0x05)
     962                    
     963                            .dwattr $C$DW$T$405, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
     964                            .dwattr $C$DW$T$405, DW_AT_decl_line(0x60e)
     965                            .dwattr $C$DW$T$405, DW_AT_decl_column(0x0e)
     966                            .dwendtag $C$DW$T$405
     967                    
     968                    $C$DW$T$406     .dwtag  DW_TAG_typedef
     969                            .dwattr $C$DW$T$406, DW_AT_name("RF_RatSelectChannel")
     970                            .dwattr $C$DW$T$406, DW_AT_type(*$C$DW$T$405)
     971                            .dwattr $C$DW$T$406, DW_AT_language(DW_LANG_C)
     972                            .dwattr $C$DW$T$406, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers
     973                            .dwattr $C$DW$T$406, DW_AT_decl_line(0x613)
     974                            .dwattr $C$DW$T$406, DW_AT_decl_column(0x03)
     975                    
     976                    
     977                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     978                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     979                    $C$DW$63        .dwtag  DW_TAG_member
     980                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     981                            .dwattr $C$DW$63, DW_AT_name("triggerType")
     982                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("triggerType")
     983                            .dwattr $C$DW$63, DW_AT_bit_offset(0x04)
     984                            .dwattr $C$DW$63, DW_AT_bit_size(0x04)
     985                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     987                            .dwattr $C$DW$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
     988                            .dwattr $C$DW$63, DW_AT_decl_line(0x7d)
     989                            .dwattr $C$DW$63, DW_AT_decl_column(0x0f)
     990                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   19

     991                    $C$DW$64        .dwtag  DW_TAG_member
     992                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     993                            .dwattr $C$DW$64, DW_AT_name("bEnaCmd")
     994                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("bEnaCmd")
     995                            .dwattr $C$DW$64, DW_AT_bit_offset(0x03)
     996                            .dwattr $C$DW$64, DW_AT_bit_size(0x01)
     997                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     998                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     999                            .dwattr $C$DW$64, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1000                            .dwattr $C$DW$64, DW_AT_decl_line(0x7e)
    1001                            .dwattr $C$DW$64, DW_AT_decl_column(0x0f)
    1002                    
    1003                    $C$DW$65        .dwtag  DW_TAG_member
    1004                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1005                            .dwattr $C$DW$65, DW_AT_name("triggerNo")
    1006                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("triggerNo")
    1007                            .dwattr $C$DW$65, DW_AT_bit_offset(0x01)
    1008                            .dwattr $C$DW$65, DW_AT_bit_size(0x02)
    1009                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1011                            .dwattr $C$DW$65, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1012                            .dwattr $C$DW$65, DW_AT_decl_line(0x80)
    1013                            .dwattr $C$DW$65, DW_AT_decl_column(0x0f)
    1014                    
    1015                    $C$DW$66        .dwtag  DW_TAG_member
    1016                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1017                            .dwattr $C$DW$66, DW_AT_name("pastTrig")
    1018                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("pastTrig")
    1019                            .dwattr $C$DW$66, DW_AT_bit_offset(0x00)
    1020                            .dwattr $C$DW$66, DW_AT_bit_size(0x01)
    1021                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1022                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1023                            .dwattr $C$DW$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1024                            .dwattr $C$DW$66, DW_AT_decl_line(0x81)
    1025                            .dwattr $C$DW$66, DW_AT_decl_column(0x0f)
    1026                    
    1027                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1028                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x7c)
    1029                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x0b)
    1030                            .dwendtag $C$DW$T$20
    1031                    
    1032                    
    1033                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1034                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    1035                    $C$DW$67        .dwtag  DW_TAG_member
    1036                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1037                            .dwattr $C$DW$67, DW_AT_name("rule")
    1038                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("rule")
    1039                            .dwattr $C$DW$67, DW_AT_bit_offset(0x04)
    1040                            .dwattr $C$DW$67, DW_AT_bit_size(0x04)
    1041                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1043                            .dwattr $C$DW$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1044                            .dwattr $C$DW$67, DW_AT_decl_line(0x85)
    1045                            .dwattr $C$DW$67, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   20

    1046                    
    1047                    $C$DW$68        .dwtag  DW_TAG_member
    1048                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1049                            .dwattr $C$DW$68, DW_AT_name("nSkip")
    1050                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("nSkip")
    1051                            .dwattr $C$DW$68, DW_AT_bit_offset(0x00)
    1052                            .dwattr $C$DW$68, DW_AT_bit_size(0x04)
    1053                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1054                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1055                            .dwattr $C$DW$68, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1056                            .dwattr $C$DW$68, DW_AT_decl_line(0x86)
    1057                            .dwattr $C$DW$68, DW_AT_decl_column(0x0f)
    1058                    
    1059                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1060                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x84)
    1061                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x0b)
    1062                            .dwendtag $C$DW$T$21
    1063                    
    1064                    
    1065                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1066                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1067                    $C$DW$69        .dwtag  DW_TAG_member
    1068                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1069                            .dwattr $C$DW$69, DW_AT_name("triggerType")
    1070                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("triggerType")
    1071                            .dwattr $C$DW$69, DW_AT_bit_offset(0x04)
    1072                            .dwattr $C$DW$69, DW_AT_bit_size(0x04)
    1073                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1074                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1075                            .dwattr $C$DW$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1076                            .dwattr $C$DW$69, DW_AT_decl_line(0x232)
    1077                            .dwattr $C$DW$69, DW_AT_decl_column(0x0f)
    1078                    
    1079                    $C$DW$70        .dwtag  DW_TAG_member
    1080                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1081                            .dwattr $C$DW$70, DW_AT_name("bEnaCmd")
    1082                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("bEnaCmd")
    1083                            .dwattr $C$DW$70, DW_AT_bit_offset(0x03)
    1084                            .dwattr $C$DW$70, DW_AT_bit_size(0x01)
    1085                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1086                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1087                            .dwattr $C$DW$70, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1088                            .dwattr $C$DW$70, DW_AT_decl_line(0x233)
    1089                            .dwattr $C$DW$70, DW_AT_decl_column(0x0f)
    1090                    
    1091                    $C$DW$71        .dwtag  DW_TAG_member
    1092                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1093                            .dwattr $C$DW$71, DW_AT_name("triggerNo")
    1094                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("triggerNo")
    1095                            .dwattr $C$DW$71, DW_AT_bit_offset(0x01)
    1096                            .dwattr $C$DW$71, DW_AT_bit_size(0x02)
    1097                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1099                            .dwattr $C$DW$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1100                            .dwattr $C$DW$71, DW_AT_decl_line(0x235)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   21

    1101                            .dwattr $C$DW$71, DW_AT_decl_column(0x0f)
    1102                    
    1103                    $C$DW$72        .dwtag  DW_TAG_member
    1104                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1105                            .dwattr $C$DW$72, DW_AT_name("pastTrig")
    1106                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("pastTrig")
    1107                            .dwattr $C$DW$72, DW_AT_bit_offset(0x00)
    1108                            .dwattr $C$DW$72, DW_AT_bit_size(0x01)
    1109                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1110                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1111                            .dwattr $C$DW$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1112                            .dwattr $C$DW$72, DW_AT_decl_line(0x236)
    1113                            .dwattr $C$DW$72, DW_AT_decl_column(0x0f)
    1114                    
    1115                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1116                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x231)
    1117                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x0b)
    1118                            .dwendtag $C$DW$T$22
    1119                    
    1120                    
    1121                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1122                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    1123                    $C$DW$73        .dwtag  DW_TAG_member
    1124                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1125                            .dwattr $C$DW$73, DW_AT_name("rule")
    1126                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("rule")
    1127                            .dwattr $C$DW$73, DW_AT_bit_offset(0x04)
    1128                            .dwattr $C$DW$73, DW_AT_bit_size(0x04)
    1129                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1130                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1131                            .dwattr $C$DW$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1132                            .dwattr $C$DW$73, DW_AT_decl_line(0x23a)
    1133                            .dwattr $C$DW$73, DW_AT_decl_column(0x0f)
    1134                    
    1135                    $C$DW$74        .dwtag  DW_TAG_member
    1136                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1137                            .dwattr $C$DW$74, DW_AT_name("nSkip")
    1138                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("nSkip")
    1139                            .dwattr $C$DW$74, DW_AT_bit_offset(0x00)
    1140                            .dwattr $C$DW$74, DW_AT_bit_size(0x04)
    1141                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1143                            .dwattr $C$DW$74, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1144                            .dwattr $C$DW$74, DW_AT_decl_line(0x23b)
    1145                            .dwattr $C$DW$74, DW_AT_decl_column(0x0f)
    1146                    
    1147                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1148                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x239)
    1149                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0b)
    1150                            .dwendtag $C$DW$T$23
    1151                    
    1152                    
    1153                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1154                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1155                    $C$DW$75        .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   22

    1156                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$24)
    1157                            .dwattr $C$DW$75, DW_AT_name("modType")
    1158                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("modType")
    1159                            .dwattr $C$DW$75, DW_AT_bit_offset(0x0d)
    1160                            .dwattr $C$DW$75, DW_AT_bit_size(0x03)
    1161                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1163                            .dwattr $C$DW$75, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1164                            .dwattr $C$DW$75, DW_AT_decl_line(0x23e)
    1165                            .dwattr $C$DW$75, DW_AT_decl_column(0x10)
    1166                    
    1167                    $C$DW$76        .dwtag  DW_TAG_member
    1168                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$24)
    1169                            .dwattr $C$DW$76, DW_AT_name("deviation")
    1170                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("deviation")
    1171                            .dwattr $C$DW$76, DW_AT_bit_offset(0x00)
    1172                            .dwattr $C$DW$76, DW_AT_bit_size(0x0d)
    1173                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1175                            .dwattr $C$DW$76, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1176                            .dwattr $C$DW$76, DW_AT_decl_line(0x241)
    1177                            .dwattr $C$DW$76, DW_AT_decl_column(0x10)
    1178                    
    1179                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1180                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x23d)
    1181                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x0b)
    1182                            .dwendtag $C$DW$T$25
    1183                    
    1184                    
    1185                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1186                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1187                    $C$DW$77        .dwtag  DW_TAG_member
    1188                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$26)
    1189                            .dwattr $C$DW$77, DW_AT_name("preScale")
    1190                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("preScale")
    1191                            .dwattr $C$DW$77, DW_AT_bit_offset(0x1c)
    1192                            .dwattr $C$DW$77, DW_AT_bit_size(0x04)
    1193                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1195                            .dwattr $C$DW$77, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1196                            .dwattr $C$DW$77, DW_AT_decl_line(0x244)
    1197                            .dwattr $C$DW$77, DW_AT_decl_column(0x10)
    1198                    
    1199                    $C$DW$78        .dwtag  DW_TAG_member
    1200                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$26)
    1201                            .dwattr $C$DW$78, DW_AT_name("rateWord")
    1202                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("rateWord")
    1203                            .dwattr $C$DW$78, DW_AT_bit_offset(0x03)
    1204                            .dwattr $C$DW$78, DW_AT_bit_size(0x15)
    1205                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1206                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1207                            .dwattr $C$DW$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1208                            .dwattr $C$DW$78, DW_AT_decl_line(0x246)
    1209                            .dwattr $C$DW$78, DW_AT_decl_column(0x10)
    1210                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   23

    1211                    $C$DW$79        .dwtag  DW_TAG_member
    1212                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$26)
    1213                            .dwattr $C$DW$79, DW_AT_name("decimMode")
    1214                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("decimMode")
    1215                            .dwattr $C$DW$79, DW_AT_bit_offset(0x00)
    1216                            .dwattr $C$DW$79, DW_AT_bit_size(0x03)
    1217                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1219                            .dwattr $C$DW$79, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1220                            .dwattr $C$DW$79, DW_AT_decl_line(0x247)
    1221                            .dwattr $C$DW$79, DW_AT_decl_column(0x10)
    1222                    
    1223                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1224                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x243)
    1225                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0b)
    1226                            .dwendtag $C$DW$T$27
    1227                    
    1228                    
    1229                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1230                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1231                    $C$DW$80        .dwtag  DW_TAG_member
    1232                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1233                            .dwattr $C$DW$80, DW_AT_name("nPreamBytes")
    1234                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("nPreamBytes")
    1235                            .dwattr $C$DW$80, DW_AT_bit_offset(0x02)
    1236                            .dwattr $C$DW$80, DW_AT_bit_size(0x06)
    1237                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1239                            .dwattr $C$DW$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1240                            .dwattr $C$DW$80, DW_AT_decl_line(0x24f)
    1241                            .dwattr $C$DW$80, DW_AT_decl_column(0x0f)
    1242                    
    1243                    $C$DW$81        .dwtag  DW_TAG_member
    1244                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1245                            .dwattr $C$DW$81, DW_AT_name("preamMode")
    1246                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("preamMode")
    1247                            .dwattr $C$DW$81, DW_AT_bit_offset(0x00)
    1248                            .dwattr $C$DW$81, DW_AT_bit_size(0x02)
    1249                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1251                            .dwattr $C$DW$81, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1252                            .dwattr $C$DW$81, DW_AT_decl_line(0x255)
    1253                            .dwattr $C$DW$81, DW_AT_decl_column(0x0f)
    1254                    
    1255                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1256                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x24e)
    1257                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    1258                            .dwendtag $C$DW$T$28
    1259                    
    1260                    
    1261                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1262                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1263                    $C$DW$82        .dwtag  DW_TAG_member
    1264                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$24)
    1265                            .dwattr $C$DW$82, DW_AT_name("nSwBits")
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   24

    1266                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("nSwBits")
    1267                            .dwattr $C$DW$82, DW_AT_bit_offset(0x0a)
    1268                            .dwattr $C$DW$82, DW_AT_bit_size(0x06)
    1269                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1270                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1271                            .dwattr $C$DW$82, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1272                            .dwattr $C$DW$82, DW_AT_decl_line(0x25b)
    1273                            .dwattr $C$DW$82, DW_AT_decl_column(0x10)
    1274                    
    1275                    $C$DW$83        .dwtag  DW_TAG_member
    1276                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$24)
    1277                            .dwattr $C$DW$83, DW_AT_name("bBitReversal")
    1278                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("bBitReversal")
    1279                            .dwattr $C$DW$83, DW_AT_bit_offset(0x09)
    1280                            .dwattr $C$DW$83, DW_AT_bit_size(0x01)
    1281                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1282                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1283                            .dwattr $C$DW$83, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1284                            .dwattr $C$DW$83, DW_AT_decl_line(0x25c)
    1285                            .dwattr $C$DW$83, DW_AT_decl_column(0x10)
    1286                    
    1287                    $C$DW$84        .dwtag  DW_TAG_member
    1288                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$24)
    1289                            .dwattr $C$DW$84, DW_AT_name("bMsbFirst")
    1290                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("bMsbFirst")
    1291                            .dwattr $C$DW$84, DW_AT_bit_offset(0x08)
    1292                            .dwattr $C$DW$84, DW_AT_bit_size(0x01)
    1293                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1294                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1295                            .dwattr $C$DW$84, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1296                            .dwattr $C$DW$84, DW_AT_decl_line(0x25e)
    1297                            .dwattr $C$DW$84, DW_AT_decl_column(0x10)
    1298                    
    1299                    $C$DW$85        .dwtag  DW_TAG_member
    1300                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$24)
    1301                            .dwattr $C$DW$85, DW_AT_name("fecMode")
    1302                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("fecMode")
    1303                            .dwattr $C$DW$85, DW_AT_bit_offset(0x04)
    1304                            .dwattr $C$DW$85, DW_AT_bit_size(0x04)
    1305                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1307                            .dwattr $C$DW$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1308                            .dwattr $C$DW$85, DW_AT_decl_line(0x260)
    1309                            .dwattr $C$DW$85, DW_AT_decl_column(0x10)
    1310                    
    1311                    $C$DW$86        .dwtag  DW_TAG_member
    1312                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$24)
    1313                            .dwattr $C$DW$86, DW_AT_name("whitenMode")
    1314                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("whitenMode")
    1315                            .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
    1316                            .dwattr $C$DW$86, DW_AT_bit_size(0x03)
    1317                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1319                            .dwattr $C$DW$86, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1320                            .dwattr $C$DW$86, DW_AT_decl_line(0x266)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   25

    1321                            .dwattr $C$DW$86, DW_AT_decl_column(0x10)
    1322                    
    1323                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1324                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x25a)
    1325                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    1326                            .dwendtag $C$DW$T$29
    1327                    
    1328                    
    1329                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1330                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1331                    $C$DW$87        .dwtag  DW_TAG_member
    1332                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$24)
    1333                            .dwattr $C$DW$87, DW_AT_name("frontEndMode")
    1334                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("frontEndMode")
    1335                            .dwattr $C$DW$87, DW_AT_bit_offset(0x0d)
    1336                            .dwattr $C$DW$87, DW_AT_bit_size(0x03)
    1337                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1338                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1339                            .dwattr $C$DW$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1340                            .dwattr $C$DW$87, DW_AT_decl_line(0x270)
    1341                            .dwattr $C$DW$87, DW_AT_decl_column(0x10)
    1342                    
    1343                    $C$DW$88        .dwtag  DW_TAG_member
    1344                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$24)
    1345                            .dwattr $C$DW$88, DW_AT_name("biasMode")
    1346                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("biasMode")
    1347                            .dwattr $C$DW$88, DW_AT_bit_offset(0x0c)
    1348                            .dwattr $C$DW$88, DW_AT_bit_size(0x01)
    1349                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1350                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1351                            .dwattr $C$DW$88, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1352                            .dwattr $C$DW$88, DW_AT_decl_line(0x276)
    1353                            .dwattr $C$DW$88, DW_AT_decl_column(0x10)
    1354                    
    1355                    $C$DW$89        .dwtag  DW_TAG_member
    1356                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$24)
    1357                            .dwattr $C$DW$89, DW_AT_name("analogCfgMode")
    1358                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("analogCfgMode")
    1359                            .dwattr $C$DW$89, DW_AT_bit_offset(0x06)
    1360                            .dwattr $C$DW$89, DW_AT_bit_size(0x06)
    1361                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1363                            .dwattr $C$DW$89, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1364                            .dwattr $C$DW$89, DW_AT_decl_line(0x278)
    1365                            .dwattr $C$DW$89, DW_AT_decl_column(0x10)
    1366                    
    1367                    $C$DW$90        .dwtag  DW_TAG_member
    1368                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$24)
    1369                            .dwattr $C$DW$90, DW_AT_name("bNoFsPowerUp")
    1370                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("bNoFsPowerUp")
    1371                            .dwattr $C$DW$90, DW_AT_bit_offset(0x05)
    1372                            .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    1373                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1374                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1375                            .dwattr $C$DW$90, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   26

    1376                            .dwattr $C$DW$90, DW_AT_decl_line(0x27f)
    1377                            .dwattr $C$DW$90, DW_AT_decl_column(0x10)
    1378                    
    1379                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1380                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x26f)
    1381                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
    1382                            .dwendtag $C$DW$T$30
    1383                    
    1384                    
    1385                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1386                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1387                    $C$DW$91        .dwtag  DW_TAG_member
    1388                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1389                            .dwattr $C$DW$91, DW_AT_name("triggerType")
    1390                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("triggerType")
    1391                            .dwattr $C$DW$91, DW_AT_bit_offset(0x04)
    1392                            .dwattr $C$DW$91, DW_AT_bit_size(0x04)
    1393                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1394                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1395                            .dwattr $C$DW$91, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1396                            .dwattr $C$DW$91, DW_AT_decl_line(0xee)
    1397                            .dwattr $C$DW$91, DW_AT_decl_column(0x0f)
    1398                    
    1399                    $C$DW$92        .dwtag  DW_TAG_member
    1400                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1401                            .dwattr $C$DW$92, DW_AT_name("bEnaCmd")
    1402                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("bEnaCmd")
    1403                            .dwattr $C$DW$92, DW_AT_bit_offset(0x03)
    1404                            .dwattr $C$DW$92, DW_AT_bit_size(0x01)
    1405                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1407                            .dwattr $C$DW$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1408                            .dwattr $C$DW$92, DW_AT_decl_line(0xef)
    1409                            .dwattr $C$DW$92, DW_AT_decl_column(0x0f)
    1410                    
    1411                    $C$DW$93        .dwtag  DW_TAG_member
    1412                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1413                            .dwattr $C$DW$93, DW_AT_name("triggerNo")
    1414                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("triggerNo")
    1415                            .dwattr $C$DW$93, DW_AT_bit_offset(0x01)
    1416                            .dwattr $C$DW$93, DW_AT_bit_size(0x02)
    1417                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1419                            .dwattr $C$DW$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1420                            .dwattr $C$DW$93, DW_AT_decl_line(0xf1)
    1421                            .dwattr $C$DW$93, DW_AT_decl_column(0x0f)
    1422                    
    1423                    $C$DW$94        .dwtag  DW_TAG_member
    1424                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1425                            .dwattr $C$DW$94, DW_AT_name("pastTrig")
    1426                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("pastTrig")
    1427                            .dwattr $C$DW$94, DW_AT_bit_offset(0x00)
    1428                            .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    1429                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   27

    1431                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1432                            .dwattr $C$DW$94, DW_AT_decl_line(0xf2)
    1433                            .dwattr $C$DW$94, DW_AT_decl_column(0x0f)
    1434                    
    1435                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1436                            .dwattr $C$DW$T$31, DW_AT_decl_line(0xed)
    1437                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0b)
    1438                            .dwendtag $C$DW$T$31
    1439                    
    1440                    
    1441                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1442                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    1443                    $C$DW$95        .dwtag  DW_TAG_member
    1444                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1445                            .dwattr $C$DW$95, DW_AT_name("rule")
    1446                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("rule")
    1447                            .dwattr $C$DW$95, DW_AT_bit_offset(0x04)
    1448                            .dwattr $C$DW$95, DW_AT_bit_size(0x04)
    1449                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1451                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1452                            .dwattr $C$DW$95, DW_AT_decl_line(0xf6)
    1453                            .dwattr $C$DW$95, DW_AT_decl_column(0x0f)
    1454                    
    1455                    $C$DW$96        .dwtag  DW_TAG_member
    1456                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1457                            .dwattr $C$DW$96, DW_AT_name("nSkip")
    1458                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("nSkip")
    1459                            .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    1460                            .dwattr $C$DW$96, DW_AT_bit_size(0x04)
    1461                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1462                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1463                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1464                            .dwattr $C$DW$96, DW_AT_decl_line(0xf7)
    1465                            .dwattr $C$DW$96, DW_AT_decl_column(0x0f)
    1466                    
    1467                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1468                            .dwattr $C$DW$T$32, DW_AT_decl_line(0xf5)
    1469                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x0b)
    1470                            .dwendtag $C$DW$T$32
    1471                    
    1472                    
    1473                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1474                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1475                    $C$DW$97        .dwtag  DW_TAG_member
    1476                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1477                            .dwattr $C$DW$97, DW_AT_name("bTxMode")
    1478                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("bTxMode")
    1479                            .dwattr $C$DW$97, DW_AT_bit_offset(0x07)
    1480                            .dwattr $C$DW$97, DW_AT_bit_size(0x01)
    1481                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1483                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1484                            .dwattr $C$DW$97, DW_AT_decl_line(0xfc)
    1485                            .dwattr $C$DW$97, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   28

    1486                    
    1487                    $C$DW$98        .dwtag  DW_TAG_member
    1488                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1489                            .dwattr $C$DW$98, DW_AT_name("refFreq")
    1490                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("refFreq")
    1491                            .dwattr $C$DW$98, DW_AT_bit_offset(0x01)
    1492                            .dwattr $C$DW$98, DW_AT_bit_size(0x06)
    1493                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1495                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1496                            .dwattr $C$DW$98, DW_AT_decl_line(0xfe)
    1497                            .dwattr $C$DW$98, DW_AT_decl_column(0x0f)
    1498                    
    1499                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1500                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xfb)
    1501                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    1502                            .dwendtag $C$DW$T$33
    1503                    
    1504                    
    1505                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1506                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1507                    $C$DW$99        .dwtag  DW_TAG_member
    1508                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1509                            .dwattr $C$DW$99, DW_AT_name("triggerType")
    1510                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("triggerType")
    1511                            .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1512                            .dwattr $C$DW$99, DW_AT_bit_size(0x04)
    1513                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1514                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1515                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc
    1516                            .dwattr $C$DW$99, DW_AT_decl_line(0xf5)
    1517                            .dwattr $C$DW$99, DW_AT_decl_column(0x0f)
    1518                    
    1519                    $C$DW$100       .dwtag  DW_TAG_member
    1520                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1521                            .dwattr $C$DW$100, DW_AT_name("bEnaCmd")
    1522                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("bEnaCmd")
    1523                            .dwattr $C$DW$100, DW_AT_bit_offset(0x03)
    1524                            .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1525                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1526                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1527                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1528                            .dwattr $C$DW$100, DW_AT_decl_line(0xf6)
    1529                            .dwattr $C$DW$100, DW_AT_decl_column(0x0f)
    1530                    
    1531                    $C$DW$101       .dwtag  DW_TAG_member
    1532                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1533                            .dwattr $C$DW$101, DW_AT_name("triggerNo")
    1534                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("triggerNo")
    1535                            .dwattr $C$DW$101, DW_AT_bit_offset(0x01)
    1536                            .dwattr $C$DW$101, DW_AT_bit_size(0x02)
    1537                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1539                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1540                            .dwattr $C$DW$101, DW_AT_decl_line(0xf8)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   29

    1541                            .dwattr $C$DW$101, DW_AT_decl_column(0x0f)
    1542                    
    1543                    $C$DW$102       .dwtag  DW_TAG_member
    1544                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1545                            .dwattr $C$DW$102, DW_AT_name("pastTrig")
    1546                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("pastTrig")
    1547                            .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    1548                            .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1549                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1550                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1551                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1552                            .dwattr $C$DW$102, DW_AT_decl_line(0xf9)
    1553                            .dwattr $C$DW$102, DW_AT_decl_column(0x0f)
    1554                    
    1555                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1556                            .dwattr $C$DW$T$34, DW_AT_decl_line(0xf4)
    1557                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    1558                            .dwendtag $C$DW$T$34
    1559                    
    1560                    
    1561                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1562                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1563                    $C$DW$103       .dwtag  DW_TAG_member
    1564                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1565                            .dwattr $C$DW$103, DW_AT_name("rule")
    1566                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("rule")
    1567                            .dwattr $C$DW$103, DW_AT_bit_offset(0x04)
    1568                            .dwattr $C$DW$103, DW_AT_bit_size(0x04)
    1569                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1571                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1572                            .dwattr $C$DW$103, DW_AT_decl_line(0xfd)
    1573                            .dwattr $C$DW$103, DW_AT_decl_column(0x0f)
    1574                    
    1575                    $C$DW$104       .dwtag  DW_TAG_member
    1576                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1577                            .dwattr $C$DW$104, DW_AT_name("nSkip")
    1578                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("nSkip")
    1579                            .dwattr $C$DW$104, DW_AT_bit_offset(0x00)
    1580                            .dwattr $C$DW$104, DW_AT_bit_size(0x04)
    1581                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1583                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1584                            .dwattr $C$DW$104, DW_AT_decl_line(0xfe)
    1585                            .dwattr $C$DW$104, DW_AT_decl_column(0x0f)
    1586                    
    1587                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1588                            .dwattr $C$DW$T$35, DW_AT_decl_line(0xfc)
    1589                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    1590                            .dwendtag $C$DW$T$35
    1591                    
    1592                    
    1593                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1594                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1595                    $C$DW$105       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   30

    1596                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1597                            .dwattr $C$DW$105, DW_AT_name("bFsOff")
    1598                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("bFsOff")
    1599                            .dwattr $C$DW$105, DW_AT_bit_offset(0x07)
    1600                            .dwattr $C$DW$105, DW_AT_bit_size(0x01)
    1601                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1603                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1604                            .dwattr $C$DW$105, DW_AT_decl_line(0x101)
    1605                            .dwattr $C$DW$105, DW_AT_decl_column(0x0f)
    1606                    
    1607                    $C$DW$106       .dwtag  DW_TAG_member
    1608                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1609                            .dwattr $C$DW$106, DW_AT_name("bUseCrc")
    1610                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("bUseCrc")
    1611                            .dwattr $C$DW$106, DW_AT_bit_offset(0x04)
    1612                            .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    1613                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1615                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1616                            .dwattr $C$DW$106, DW_AT_decl_line(0x104)
    1617                            .dwattr $C$DW$106, DW_AT_decl_column(0x0f)
    1618                    
    1619                    $C$DW$107       .dwtag  DW_TAG_member
    1620                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1621                            .dwattr $C$DW$107, DW_AT_name("bCrcIncSw")
    1622                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("bCrcIncSw")
    1623                            .dwattr $C$DW$107, DW_AT_bit_offset(0x03)
    1624                            .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1625                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1626                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1627                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1628                            .dwattr $C$DW$107, DW_AT_decl_line(0x106)
    1629                            .dwattr $C$DW$107, DW_AT_decl_column(0x0f)
    1630                    
    1631                    $C$DW$108       .dwtag  DW_TAG_member
    1632                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1633                            .dwattr $C$DW$108, DW_AT_name("bCrcIncHdr")
    1634                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("bCrcIncHdr")
    1635                            .dwattr $C$DW$108, DW_AT_bit_offset(0x02)
    1636                            .dwattr $C$DW$108, DW_AT_bit_size(0x01)
    1637                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1639                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1640                            .dwattr $C$DW$108, DW_AT_decl_line(0x108)
    1641                            .dwattr $C$DW$108, DW_AT_decl_column(0x0f)
    1642                    
    1643                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1644                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x100)
    1645                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    1646                            .dwendtag $C$DW$T$36
    1647                    
    1648                    
    1649                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1650                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   31

    1651                    $C$DW$109       .dwtag  DW_TAG_member
    1652                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1653                            .dwattr $C$DW$109, DW_AT_name("bExtTxTrig")
    1654                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("bExtTxTrig")
    1655                            .dwattr $C$DW$109, DW_AT_bit_offset(0x07)
    1656                            .dwattr $C$DW$109, DW_AT_bit_size(0x01)
    1657                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1658                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1659                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1660                            .dwattr $C$DW$109, DW_AT_decl_line(0x10e)
    1661                            .dwattr $C$DW$109, DW_AT_decl_column(0x0f)
    1662                    
    1663                    $C$DW$110       .dwtag  DW_TAG_member
    1664                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1665                            .dwattr $C$DW$110, DW_AT_name("inputMode")
    1666                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("inputMode")
    1667                            .dwattr $C$DW$110, DW_AT_bit_offset(0x05)
    1668                            .dwattr $C$DW$110, DW_AT_bit_size(0x02)
    1669                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1671                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1672                            .dwattr $C$DW$110, DW_AT_decl_line(0x110)
    1673                            .dwattr $C$DW$110, DW_AT_decl_column(0x0f)
    1674                    
    1675                    $C$DW$111       .dwtag  DW_TAG_member
    1676                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1677                            .dwattr $C$DW$111, DW_AT_name("source")
    1678                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("source")
    1679                            .dwattr $C$DW$111, DW_AT_bit_offset(0x00)
    1680                            .dwattr $C$DW$111, DW_AT_bit_size(0x05)
    1681                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1683                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1684                            .dwattr $C$DW$111, DW_AT_decl_line(0x115)
    1685                            .dwattr $C$DW$111, DW_AT_decl_column(0x0f)
    1686                    
    1687                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1688                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x10d)
    1689                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    1690                            .dwendtag $C$DW$T$37
    1691                    
    1692                    
    1693                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1694                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1695                    $C$DW$112       .dwtag  DW_TAG_member
    1696                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1697                            .dwattr $C$DW$112, DW_AT_name("triggerType")
    1698                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("triggerType")
    1699                            .dwattr $C$DW$112, DW_AT_bit_offset(0x04)
    1700                            .dwattr $C$DW$112, DW_AT_bit_size(0x04)
    1701                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1703                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1704                            .dwattr $C$DW$112, DW_AT_decl_line(0x118)
    1705                            .dwattr $C$DW$112, DW_AT_decl_column(0x0f)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   32

    1706                    
    1707                    $C$DW$113       .dwtag  DW_TAG_member
    1708                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1709                            .dwattr $C$DW$113, DW_AT_name("bEnaCmd")
    1710                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("bEnaCmd")
    1711                            .dwattr $C$DW$113, DW_AT_bit_offset(0x03)
    1712                            .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1713                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1715                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1716                            .dwattr $C$DW$113, DW_AT_decl_line(0x119)
    1717                            .dwattr $C$DW$113, DW_AT_decl_column(0x0f)
    1718                    
    1719                    $C$DW$114       .dwtag  DW_TAG_member
    1720                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1721                            .dwattr $C$DW$114, DW_AT_name("triggerNo")
    1722                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("triggerNo")
    1723                            .dwattr $C$DW$114, DW_AT_bit_offset(0x01)
    1724                            .dwattr $C$DW$114, DW_AT_bit_size(0x02)
    1725                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1726                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1727                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1728                            .dwattr $C$DW$114, DW_AT_decl_line(0x11b)
    1729                            .dwattr $C$DW$114, DW_AT_decl_column(0x0f)
    1730                    
    1731                    $C$DW$115       .dwtag  DW_TAG_member
    1732                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1733                            .dwattr $C$DW$115, DW_AT_name("pastTrig")
    1734                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("pastTrig")
    1735                            .dwattr $C$DW$115, DW_AT_bit_offset(0x00)
    1736                            .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1737                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1738                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1739                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1740                            .dwattr $C$DW$115, DW_AT_decl_line(0x11c)
    1741                            .dwattr $C$DW$115, DW_AT_decl_column(0x0f)
    1742                    
    1743                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1744                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x117)
    1745                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    1746                            .dwendtag $C$DW$T$38
    1747                    
    1748                    
    1749                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1750                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1751                    $C$DW$116       .dwtag  DW_TAG_member
    1752                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1753                            .dwattr $C$DW$116, DW_AT_name("triggerType")
    1754                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("triggerType")
    1755                            .dwattr $C$DW$116, DW_AT_bit_offset(0x04)
    1756                            .dwattr $C$DW$116, DW_AT_bit_size(0x04)
    1757                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1759                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1760                            .dwattr $C$DW$116, DW_AT_decl_line(0x18b)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   33

    1761                            .dwattr $C$DW$116, DW_AT_decl_column(0x0f)
    1762                    
    1763                    $C$DW$117       .dwtag  DW_TAG_member
    1764                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1765                            .dwattr $C$DW$117, DW_AT_name("bEnaCmd")
    1766                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("bEnaCmd")
    1767                            .dwattr $C$DW$117, DW_AT_bit_offset(0x03)
    1768                            .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1769                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1770                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1771                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1772                            .dwattr $C$DW$117, DW_AT_decl_line(0x18c)
    1773                            .dwattr $C$DW$117, DW_AT_decl_column(0x0f)
    1774                    
    1775                    $C$DW$118       .dwtag  DW_TAG_member
    1776                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1777                            .dwattr $C$DW$118, DW_AT_name("triggerNo")
    1778                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("triggerNo")
    1779                            .dwattr $C$DW$118, DW_AT_bit_offset(0x01)
    1780                            .dwattr $C$DW$118, DW_AT_bit_size(0x02)
    1781                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1782                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1783                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1784                            .dwattr $C$DW$118, DW_AT_decl_line(0x18e)
    1785                            .dwattr $C$DW$118, DW_AT_decl_column(0x0f)
    1786                    
    1787                    $C$DW$119       .dwtag  DW_TAG_member
    1788                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1789                            .dwattr $C$DW$119, DW_AT_name("pastTrig")
    1790                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("pastTrig")
    1791                            .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    1792                            .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1793                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1795                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1796                            .dwattr $C$DW$119, DW_AT_decl_line(0x18f)
    1797                            .dwattr $C$DW$119, DW_AT_decl_column(0x0f)
    1798                    
    1799                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1800                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x18a)
    1801                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    1802                            .dwendtag $C$DW$T$39
    1803                    
    1804                    
    1805                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1806                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1807                    $C$DW$120       .dwtag  DW_TAG_member
    1808                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1809                            .dwattr $C$DW$120, DW_AT_name("rule")
    1810                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("rule")
    1811                            .dwattr $C$DW$120, DW_AT_bit_offset(0x04)
    1812                            .dwattr $C$DW$120, DW_AT_bit_size(0x04)
    1813                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1814                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1815                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   34

    1816                            .dwattr $C$DW$120, DW_AT_decl_line(0x193)
    1817                            .dwattr $C$DW$120, DW_AT_decl_column(0x0f)
    1818                    
    1819                    $C$DW$121       .dwtag  DW_TAG_member
    1820                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1821                            .dwattr $C$DW$121, DW_AT_name("nSkip")
    1822                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("nSkip")
    1823                            .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1824                            .dwattr $C$DW$121, DW_AT_bit_size(0x04)
    1825                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1826                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1827                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1828                            .dwattr $C$DW$121, DW_AT_decl_line(0x194)
    1829                            .dwattr $C$DW$121, DW_AT_decl_column(0x0f)
    1830                    
    1831                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1832                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x192)
    1833                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    1834                            .dwendtag $C$DW$T$40
    1835                    
    1836                    
    1837                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1838                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1839                    $C$DW$122       .dwtag  DW_TAG_member
    1840                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1841                            .dwattr $C$DW$122, DW_AT_name("bFsOffIdle")
    1842                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("bFsOffIdle")
    1843                            .dwattr $C$DW$122, DW_AT_bit_offset(0x07)
    1844                            .dwattr $C$DW$122, DW_AT_bit_size(0x01)
    1845                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1846                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1847                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1848                            .dwattr $C$DW$122, DW_AT_decl_line(0x197)
    1849                            .dwattr $C$DW$122, DW_AT_decl_column(0x0f)
    1850                    
    1851                    $C$DW$123       .dwtag  DW_TAG_member
    1852                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1853                            .dwattr $C$DW$123, DW_AT_name("bFsOffBusy")
    1854                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("bFsOffBusy")
    1855                            .dwattr $C$DW$123, DW_AT_bit_offset(0x06)
    1856                            .dwattr $C$DW$123, DW_AT_bit_size(0x01)
    1857                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1858                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1859                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1860                            .dwattr $C$DW$123, DW_AT_decl_line(0x199)
    1861                            .dwattr $C$DW$123, DW_AT_decl_column(0x0f)
    1862                    
    1863                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1864                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x196)
    1865                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    1866                            .dwendtag $C$DW$T$41
    1867                    
    1868                    
    1869                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1870                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   35

    1871                    $C$DW$124       .dwtag  DW_TAG_member
    1872                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1873                            .dwattr $C$DW$124, DW_AT_name("bEnaRssi")
    1874                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("bEnaRssi")
    1875                            .dwattr $C$DW$124, DW_AT_bit_offset(0x07)
    1876                            .dwattr $C$DW$124, DW_AT_bit_size(0x01)
    1877                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1878                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1879                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1880                            .dwattr $C$DW$124, DW_AT_decl_line(0x19e)
    1881                            .dwattr $C$DW$124, DW_AT_decl_column(0x0f)
    1882                    
    1883                    $C$DW$125       .dwtag  DW_TAG_member
    1884                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1885                            .dwattr $C$DW$125, DW_AT_name("bEnaCorr")
    1886                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("bEnaCorr")
    1887                            .dwattr $C$DW$125, DW_AT_bit_offset(0x06)
    1888                            .dwattr $C$DW$125, DW_AT_bit_size(0x01)
    1889                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1890                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1891                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1892                            .dwattr $C$DW$125, DW_AT_decl_line(0x19f)
    1893                            .dwattr $C$DW$125, DW_AT_decl_column(0x0f)
    1894                    
    1895                    $C$DW$126       .dwtag  DW_TAG_member
    1896                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1897                            .dwattr $C$DW$126, DW_AT_name("operation")
    1898                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("operation")
    1899                            .dwattr $C$DW$126, DW_AT_bit_offset(0x05)
    1900                            .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    1901                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1903                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1904                            .dwattr $C$DW$126, DW_AT_decl_line(0x1a0)
    1905                            .dwattr $C$DW$126, DW_AT_decl_column(0x0f)
    1906                    
    1907                    $C$DW$127       .dwtag  DW_TAG_member
    1908                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1909                            .dwattr $C$DW$127, DW_AT_name("busyOp")
    1910                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("busyOp")
    1911                            .dwattr $C$DW$127, DW_AT_bit_offset(0x04)
    1912                            .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    1913                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1914                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1915                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1916                            .dwattr $C$DW$127, DW_AT_decl_line(0x1a2)
    1917                            .dwattr $C$DW$127, DW_AT_decl_column(0x0f)
    1918                    
    1919                    $C$DW$128       .dwtag  DW_TAG_member
    1920                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1921                            .dwattr $C$DW$128, DW_AT_name("idleOp")
    1922                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("idleOp")
    1923                            .dwattr $C$DW$128, DW_AT_bit_offset(0x03)
    1924                            .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    1925                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   36

    1926                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1927                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1928                            .dwattr $C$DW$128, DW_AT_decl_line(0x1a5)
    1929                            .dwattr $C$DW$128, DW_AT_decl_column(0x0f)
    1930                    
    1931                    $C$DW$129       .dwtag  DW_TAG_member
    1932                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1933                            .dwattr $C$DW$129, DW_AT_name("timeoutRes")
    1934                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("timeoutRes")
    1935                            .dwattr $C$DW$129, DW_AT_bit_offset(0x02)
    1936                            .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    1937                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1938                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1939                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1940                            .dwattr $C$DW$129, DW_AT_decl_line(0x1a7)
    1941                            .dwattr $C$DW$129, DW_AT_decl_column(0x0f)
    1942                    
    1943                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1944                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x19d)
    1945                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    1946                            .dwendtag $C$DW$T$42
    1947                    
    1948                    
    1949                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1950                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1951                    $C$DW$130       .dwtag  DW_TAG_member
    1952                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1953                            .dwattr $C$DW$130, DW_AT_name("numCorrInv")
    1954                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("numCorrInv")
    1955                            .dwattr $C$DW$130, DW_AT_bit_offset(0x04)
    1956                            .dwattr $C$DW$130, DW_AT_bit_size(0x04)
    1957                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1958                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1959                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1960                            .dwattr $C$DW$130, DW_AT_decl_line(0x1b1)
    1961                            .dwattr $C$DW$130, DW_AT_decl_column(0x0f)
    1962                    
    1963                    $C$DW$131       .dwtag  DW_TAG_member
    1964                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1965                            .dwattr $C$DW$131, DW_AT_name("numCorrBusy")
    1966                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("numCorrBusy")
    1967                            .dwattr $C$DW$131, DW_AT_bit_offset(0x00)
    1968                            .dwattr $C$DW$131, DW_AT_bit_size(0x04)
    1969                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1970                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1971                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1972                            .dwattr $C$DW$131, DW_AT_decl_line(0x1b3)
    1973                            .dwattr $C$DW$131, DW_AT_decl_column(0x0f)
    1974                    
    1975                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    1976                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x1b0)
    1977                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    1978                            .dwendtag $C$DW$T$43
    1979                    
    1980                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   37

    1981                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1982                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1983                    $C$DW$132       .dwtag  DW_TAG_member
    1984                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1985                            .dwattr $C$DW$132, DW_AT_name("triggerType")
    1986                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("triggerType")
    1987                            .dwattr $C$DW$132, DW_AT_bit_offset(0x04)
    1988                            .dwattr $C$DW$132, DW_AT_bit_size(0x04)
    1989                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1990                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1991                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    1992                            .dwattr $C$DW$132, DW_AT_decl_line(0x1b7)
    1993                            .dwattr $C$DW$132, DW_AT_decl_column(0x0f)
    1994                    
    1995                    $C$DW$133       .dwtag  DW_TAG_member
    1996                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1997                            .dwattr $C$DW$133, DW_AT_name("bEnaCmd")
    1998                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("bEnaCmd")
    1999                            .dwattr $C$DW$133, DW_AT_bit_offset(0x03)
    2000                            .dwattr $C$DW$133, DW_AT_bit_size(0x01)
    2001                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2002                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2003                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2004                            .dwattr $C$DW$133, DW_AT_decl_line(0x1b8)
    2005                            .dwattr $C$DW$133, DW_AT_decl_column(0x0f)
    2006                    
    2007                    $C$DW$134       .dwtag  DW_TAG_member
    2008                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2009                            .dwattr $C$DW$134, DW_AT_name("triggerNo")
    2010                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("triggerNo")
    2011                            .dwattr $C$DW$134, DW_AT_bit_offset(0x01)
    2012                            .dwattr $C$DW$134, DW_AT_bit_size(0x02)
    2013                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2014                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2015                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2016                            .dwattr $C$DW$134, DW_AT_decl_line(0x1ba)
    2017                            .dwattr $C$DW$134, DW_AT_decl_column(0x0f)
    2018                    
    2019                    $C$DW$135       .dwtag  DW_TAG_member
    2020                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2021                            .dwattr $C$DW$135, DW_AT_name("pastTrig")
    2022                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("pastTrig")
    2023                            .dwattr $C$DW$135, DW_AT_bit_offset(0x00)
    2024                            .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2025                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2026                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2027                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2028                            .dwattr $C$DW$135, DW_AT_decl_line(0x1bb)
    2029                            .dwattr $C$DW$135, DW_AT_decl_column(0x0f)
    2030                    
    2031                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2032                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x1b6)
    2033                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x0b)
    2034                            .dwendtag $C$DW$T$44
    2035                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   38

    2036                    
    2037                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2038                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2039                    $C$DW$136       .dwtag  DW_TAG_member
    2040                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2041                            .dwattr $C$DW$136, DW_AT_name("triggerType")
    2042                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("triggerType")
    2043                            .dwattr $C$DW$136, DW_AT_bit_offset(0x04)
    2044                            .dwattr $C$DW$136, DW_AT_bit_size(0x04)
    2045                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2046                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2047                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2048                            .dwattr $C$DW$136, DW_AT_decl_line(0x135)
    2049                            .dwattr $C$DW$136, DW_AT_decl_column(0x0f)
    2050                    
    2051                    $C$DW$137       .dwtag  DW_TAG_member
    2052                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2053                            .dwattr $C$DW$137, DW_AT_name("bEnaCmd")
    2054                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("bEnaCmd")
    2055                            .dwattr $C$DW$137, DW_AT_bit_offset(0x03)
    2056                            .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2057                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2058                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2059                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2060                            .dwattr $C$DW$137, DW_AT_decl_line(0x136)
    2061                            .dwattr $C$DW$137, DW_AT_decl_column(0x0f)
    2062                    
    2063                    $C$DW$138       .dwtag  DW_TAG_member
    2064                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2065                            .dwattr $C$DW$138, DW_AT_name("triggerNo")
    2066                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("triggerNo")
    2067                            .dwattr $C$DW$138, DW_AT_bit_offset(0x01)
    2068                            .dwattr $C$DW$138, DW_AT_bit_size(0x02)
    2069                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2070                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2071                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2072                            .dwattr $C$DW$138, DW_AT_decl_line(0x138)
    2073                            .dwattr $C$DW$138, DW_AT_decl_column(0x0f)
    2074                    
    2075                    $C$DW$139       .dwtag  DW_TAG_member
    2076                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2077                            .dwattr $C$DW$139, DW_AT_name("pastTrig")
    2078                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("pastTrig")
    2079                            .dwattr $C$DW$139, DW_AT_bit_offset(0x00)
    2080                            .dwattr $C$DW$139, DW_AT_bit_size(0x01)
    2081                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2083                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    2084                            .dwattr $C$DW$139, DW_AT_decl_line(0x139)
    2085                            .dwattr $C$DW$139, DW_AT_decl_column(0x0f)
    2086                    
    2087                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    2088                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x134)
    2089                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x0b)
    2090                            .dwendtag $C$DW$T$45
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:21 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{CE7148CC-FA9F-432E-B812-2A797E10B76B} PAGE   39

    2091                    
    2092                    
    2093                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2094                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    2095                    $C$DW$140       .dwtag  DW_TAG_member
    2096                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2097                            .dwattr $C$DW$140, DW_AT_name("rule")
