TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Thu Nov 22 09:17:21 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/OSAL/osal.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\colle
      13                    
      14                    ;*****************************************************************************

    7144                    
    7145                    $C$DW$T$176     .dwtag  DW_TAG_typedef
    7146                            .dwattr $C$DW$T$176, DW_AT_name("tFlashStateCommandsType")
    7147                            .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$175)
    7148                            .dwattr $C$DW$T$176, DW_AT_language(DW_LANG_C)
    7149                            .dwattr $C$DW$T$176, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices
    7150                            .dwattr $C$DW$T$176, DW_AT_decl_line(0xb0)
    7151                            .dwattr $C$DW$T$176, DW_AT_decl_column(0x03)
    7152                    
    7153                    
    7154                    $C$DW$T$177     .dwtag  DW_TAG_enumeration_type
    7155                            .dwattr $C$DW$T$177, DW_AT_byte_size(0x01)
    7156                    $C$DW$456       .dwtag  DW_TAG_enumerator
    7157                            .dwattr $C$DW$456, DW_AT_name("ICALL_RTI_APP_CMD_EVENT")
    7158                            .dwattr $C$DW$456, DW_AT_const_value(0xe0)
    7159                            .dwattr $C$DW$456, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7160                            .dwattr $C$DW$456, DW_AT_decl_line(0x3de)
    7161                            .dwattr $C$DW$456, DW_AT_decl_column(0x04)
    7162                    
    7163                    $C$DW$457       .dwtag  DW_TAG_enumerator
    7164                            .dwattr $C$DW$457, DW_AT_name("ICALL_RTI_STACK_CMD_EVENT")
    7165                            .dwattr $C$DW$457, DW_AT_const_value(0xe1)
    7166                            .dwattr $C$DW$457, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7167                            .dwattr $C$DW$457, DW_AT_decl_line(0x3e0)
    7168                            .dwattr $C$DW$457, DW_AT_decl_column(0x04)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  132

    7169                    
    7170                    $C$DW$458       .dwtag  DW_TAG_enumerator
    7171                            .dwattr $C$DW$458, DW_AT_name("ICALL_RTI_APP_ASYNC_CMD_EVENT")
    7172                            .dwattr $C$DW$458, DW_AT_const_value(0xe2)
    7173                            .dwattr $C$DW$458, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7174                            .dwattr $C$DW$458, DW_AT_decl_line(0x3e2)
    7175                            .dwattr $C$DW$458, DW_AT_decl_column(0x04)
    7176                    
    7177                    $C$DW$459       .dwtag  DW_TAG_enumerator
    7178                            .dwattr $C$DW$459, DW_AT_name("ICALL_RTI_APP_SYNC_CMD_EVENT")
    7179                            .dwattr $C$DW$459, DW_AT_const_value(0xe3)
    7180                            .dwattr $C$DW$459, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7181                            .dwattr $C$DW$459, DW_AT_decl_line(0x3e4)
    7182                            .dwattr $C$DW$459, DW_AT_decl_column(0x04)
    7183                    
    7184                    $C$DW$460       .dwtag  DW_TAG_enumerator
    7185                            .dwattr $C$DW$460, DW_AT_name("ICALL_RCN_APP_ASYNC_CMD_EVENT")
    7186                            .dwattr $C$DW$460, DW_AT_const_value(0xe4)
    7187                            .dwattr $C$DW$460, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7188                            .dwattr $C$DW$460, DW_AT_decl_line(0x3e6)
    7189                            .dwattr $C$DW$460, DW_AT_decl_column(0x04)
    7190                    
    7191                    $C$DW$461       .dwtag  DW_TAG_enumerator
    7192                            .dwattr $C$DW$461, DW_AT_name("ICALL_RCN_APP_SYNC_CMD_EVENT")
    7193                            .dwattr $C$DW$461, DW_AT_const_value(0xe5)
    7194                            .dwattr $C$DW$461, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7195                            .dwattr $C$DW$461, DW_AT_decl_line(0x3e8)
    7196                            .dwattr $C$DW$461, DW_AT_decl_column(0x04)
    7197                    
    7198                            .dwattr $C$DW$T$177, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7199                            .dwattr $C$DW$T$177, DW_AT_decl_line(0x3dc)
    7200                            .dwattr $C$DW$T$177, DW_AT_decl_column(0x01)
    7201                            .dwendtag $C$DW$T$177
    7202                    
    7203                    $C$DW$T$178     .dwtag  DW_TAG_typedef
    7204                            .dwattr $C$DW$T$178, DW_AT_name("ICall_RemotiCmdEvent_t")
    7205                            .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$177)
    7206                            .dwattr $C$DW$T$178, DW_AT_language(DW_LANG_C)
    7207                            .dwattr $C$DW$T$178, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7208                            .dwattr $C$DW$T$178, DW_AT_decl_line(0x3e9)
    7209                            .dwattr $C$DW$T$178, DW_AT_decl_column(0x02)
    7210                    
    7211                    
    7212                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    7213                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    7214                    $C$DW$462       .dwtag  DW_TAG_member
    7215                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
    7216                            .dwattr $C$DW$462, DW_AT_name("event")
    7217                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("event")
    7218                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7219                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    7220                            .dwattr $C$DW$462, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7221                            .dwattr $C$DW$462, DW_AT_decl_line(0x79)
    7222                            .dwattr $C$DW$462, DW_AT_decl_column(0x0a)
    7223                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  133

    7224                    $C$DW$463       .dwtag  DW_TAG_member
    7225                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
    7226                            .dwattr $C$DW$463, DW_AT_name("status")
    7227                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("status")
    7228                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7229                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    7230                            .dwattr $C$DW$463, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7231                            .dwattr $C$DW$463, DW_AT_decl_line(0x7a)
    7232                            .dwattr $C$DW$463, DW_AT_decl_column(0x0a)
    7233                    
    7234                            .dwattr $C$DW$T$20, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7235                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x78)
    7236                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
    7237                            .dwendtag $C$DW$T$20
    7238                    
    7239                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    7240                            .dwattr $C$DW$T$86, DW_AT_name("osal_event_hdr_t")
    7241                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$20)
    7242                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    7243                            .dwattr $C$DW$T$86, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    7244                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x7b)
    7245                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    7246                    
    7247                    $C$DW$T$181     .dwtag  DW_TAG_pointer_type
    7248                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$86)
    7249                            .dwattr $C$DW$T$181, DW_AT_address_class(0x20)
    7250                    
    7251                    
    7252                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
    7253                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x4c)
    7254                    $C$DW$464       .dwtag  DW_TAG_member
    7255                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$26)
    7256                            .dwattr $C$DW$464, DW_AT_name("Crc32")
    7257                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("Crc32")
    7258                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7259                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    7260                            .dwattr $C$DW$464, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7261                            .dwattr $C$DW$464, DW_AT_decl_line(0x76)
    7262                            .dwattr $C$DW$464, DW_AT_decl_column(0x25)
    7263                    
    7264                    $C$DW$465       .dwtag  DW_TAG_member
    7265                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$29)
    7266                            .dwattr $C$DW$465, DW_AT_name("FlashGetSize")
    7267                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("FlashGetSize")
    7268                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7269                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    7270                            .dwattr $C$DW$465, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7271                            .dwattr $C$DW$465, DW_AT_decl_line(0x77)
    7272                            .dwattr $C$DW$465, DW_AT_decl_column(0x25)
    7273                    
    7274                    $C$DW$466       .dwtag  DW_TAG_member
    7275                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$30)
    7276                            .dwattr $C$DW$466, DW_AT_name("GetChipId")
    7277                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("GetChipId")
    7278                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  134

    7279                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    7280                            .dwattr $C$DW$466, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7281                            .dwattr $C$DW$466, DW_AT_decl_line(0x78)
    7282                            .dwattr $C$DW$466, DW_AT_decl_column(0x25)
    7283                    
    7284                    $C$DW$467       .dwtag  DW_TAG_member
    7285                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$33)
    7286                            .dwattr $C$DW$467, DW_AT_name("ReservedLocation1")
    7287                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("ReservedLocation1")
    7288                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7289                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    7290                            .dwattr $C$DW$467, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7291                            .dwattr $C$DW$467, DW_AT_decl_line(0x79)
    7292                            .dwattr $C$DW$467, DW_AT_decl_column(0x25)
    7293                    
    7294                    $C$DW$468       .dwtag  DW_TAG_member
    7295                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$34)
    7296                            .dwattr $C$DW$468, DW_AT_name("ReservedLocation2")
    7297                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("ReservedLocation2")
    7298                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7299                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    7300                            .dwattr $C$DW$468, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7301                            .dwattr $C$DW$468, DW_AT_decl_line(0x7a)
    7302                            .dwattr $C$DW$468, DW_AT_decl_column(0x25)
    7303                    
    7304                    $C$DW$469       .dwtag  DW_TAG_member
    7305                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$35)
    7306                            .dwattr $C$DW$469, DW_AT_name("ReservedLocation3")
    7307                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("ReservedLocation3")
    7308                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7309                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    7310                            .dwattr $C$DW$469, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7311                            .dwattr $C$DW$469, DW_AT_decl_line(0x7b)
    7312                            .dwattr $C$DW$469, DW_AT_decl_column(0x25)
    7313                    
    7314                    $C$DW$470       .dwtag  DW_TAG_member
    7315                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$38)
    7316                            .dwattr $C$DW$470, DW_AT_name("ResetDevice")
    7317                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("ResetDevice")
    7318                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7319                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    7320                            .dwattr $C$DW$470, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7321                            .dwattr $C$DW$470, DW_AT_decl_line(0x7c)
    7322                            .dwattr $C$DW$470, DW_AT_decl_column(0x25)
    7323                    
    7324                    $C$DW$471       .dwtag  DW_TAG_member
    7325                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$43)
    7326                            .dwattr $C$DW$471, DW_AT_name("Fletcher32")
    7327                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("Fletcher32")
    7328                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7329                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    7330                            .dwattr $C$DW$471, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7331                            .dwattr $C$DW$471, DW_AT_decl_line(0x7d)
    7332                            .dwattr $C$DW$471, DW_AT_decl_column(0x25)
    7333                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  135

    7334                    $C$DW$472       .dwtag  DW_TAG_member
    7335                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$47)
    7336                            .dwattr $C$DW$472, DW_AT_name("MinValue")
    7337                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("MinValue")
    7338                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7339                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    7340                            .dwattr $C$DW$472, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7341                            .dwattr $C$DW$472, DW_AT_decl_line(0x7e)
    7342                            .dwattr $C$DW$472, DW_AT_decl_column(0x25)
    7343                    
    7344                    $C$DW$473       .dwtag  DW_TAG_member
    7345                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$48)
    7346                            .dwattr $C$DW$473, DW_AT_name("MaxValue")
    7347                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("MaxValue")
    7348                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7349                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    7350                            .dwattr $C$DW$473, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7351                            .dwattr $C$DW$473, DW_AT_decl_line(0x7f)
    7352                            .dwattr $C$DW$473, DW_AT_decl_column(0x25)
    7353                    
    7354                    $C$DW$474       .dwtag  DW_TAG_member
    7355                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$49)
    7356                            .dwattr $C$DW$474, DW_AT_name("MeanValue")
    7357                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("MeanValue")
    7358                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7359                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    7360                            .dwattr $C$DW$474, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7361                            .dwattr $C$DW$474, DW_AT_decl_line(0x80)
    7362                            .dwattr $C$DW$474, DW_AT_decl_column(0x25)
    7363                    
    7364                    $C$DW$475       .dwtag  DW_TAG_member
    7365                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$50)
    7366                            .dwattr $C$DW$475, DW_AT_name("StandDeviationValue")
    7367                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("StandDeviationValue")
    7368                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7369                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    7370                            .dwattr $C$DW$475, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7371                            .dwattr $C$DW$475, DW_AT_decl_line(0x81)
    7372                            .dwattr $C$DW$475, DW_AT_decl_column(0x25)
    7373                    
    7374                    $C$DW$476       .dwtag  DW_TAG_member
    7375                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$53)
    7376                            .dwattr $C$DW$476, DW_AT_name("ReservedLocation4")
    7377                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("ReservedLocation4")
    7378                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7379                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    7380                            .dwattr $C$DW$476, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7381                            .dwattr $C$DW$476, DW_AT_decl_line(0x82)
    7382                            .dwattr $C$DW$476, DW_AT_decl_column(0x25)
    7383                    
    7384                    $C$DW$477       .dwtag  DW_TAG_member
    7385                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$54)
    7386                            .dwattr $C$DW$477, DW_AT_name("ReservedLocation5")
    7387                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("ReservedLocation5")
    7388                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  136

    7389                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    7390                            .dwattr $C$DW$477, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7391                            .dwattr $C$DW$477, DW_AT_decl_line(0x83)
    7392                            .dwattr $C$DW$477, DW_AT_decl_column(0x25)
    7393                    
    7394                    $C$DW$478       .dwtag  DW_TAG_member
    7395                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$55)
    7396                            .dwattr $C$DW$478, DW_AT_name("HFSourceSafeSwitch")
    7397                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    7398                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    7399                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    7400                            .dwattr $C$DW$478, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7401                            .dwattr $C$DW$478, DW_AT_decl_line(0x84)
    7402                            .dwattr $C$DW$478, DW_AT_decl_column(0x25)
    7403                    
    7404                    $C$DW$479       .dwtag  DW_TAG_member
    7405                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$58)
    7406                            .dwattr $C$DW$479, DW_AT_name("SelectCompAInput")
    7407                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("SelectCompAInput")
    7408                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    7409                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    7410                            .dwattr $C$DW$479, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7411                            .dwattr $C$DW$479, DW_AT_decl_line(0x85)
    7412                            .dwattr $C$DW$479, DW_AT_decl_column(0x25)
    7413                    
    7414                    $C$DW$480       .dwtag  DW_TAG_member
    7415                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$59)
    7416                            .dwattr $C$DW$480, DW_AT_name("SelectCompARef")
    7417                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("SelectCompARef")
    7418                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7419                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    7420                            .dwattr $C$DW$480, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7421                            .dwattr $C$DW$480, DW_AT_decl_line(0x86)
    7422                            .dwattr $C$DW$480, DW_AT_decl_column(0x25)
    7423                    
    7424                    $C$DW$481       .dwtag  DW_TAG_member
    7425                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$60)
    7426                            .dwattr $C$DW$481, DW_AT_name("SelectADCCompBInput")
    7427                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("SelectADCCompBInput")
    7428                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7429                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    7430                            .dwattr $C$DW$481, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7431                            .dwattr $C$DW$481, DW_AT_decl_line(0x87)
    7432                            .dwattr $C$DW$481, DW_AT_decl_column(0x25)
    7433                    
    7434                    $C$DW$482       .dwtag  DW_TAG_member
    7435                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$61)
    7436                            .dwattr $C$DW$482, DW_AT_name("SelectCompBRef")
    7437                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("SelectCompBRef")
    7438                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7439                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    7440                            .dwattr $C$DW$482, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    7441                            .dwattr $C$DW$482, DW_AT_decl_line(0x88)
    7442                            .dwattr $C$DW$482, DW_AT_decl_column(0x25)
    7443                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  137

    7444                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    7445                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x75)
    7446                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
    7447                            .dwendtag $C$DW$T$62
    7448                    
    7449                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    7450                            .dwattr $C$DW$T$183, DW_AT_name("HARD_API_T")
    7451                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$62)
    7452                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    7453                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    7454                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x89)
    7455                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    7456                    
    7457                    
    7458                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    7459                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x08)
    7460                    $C$DW$483       .dwtag  DW_TAG_member
    7461                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$10)
    7462                            .dwattr $C$DW$483, DW_AT_name("quot")
    7463                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("quot")
    7464                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7465                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    7466                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    7467                            .dwattr $C$DW$483, DW_AT_decl_line(0x5c)
    7468                            .dwattr $C$DW$483, DW_AT_decl_column(0x16)
    7469                    
    7470                    $C$DW$484       .dwtag  DW_TAG_member
    7471                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$10)
    7472                            .dwattr $C$DW$484, DW_AT_name("rem")
    7473                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("rem")
    7474                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7475                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    7476                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    7477                            .dwattr $C$DW$484, DW_AT_decl_line(0x5c)
    7478                            .dwattr $C$DW$484, DW_AT_decl_column(0x1c)
    7479                    
    7480                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
    7481                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x5c)
    7482                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x10)
    7483                            .dwendtag $C$DW$T$63
    7484                    
    7485                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    7486                            .dwattr $C$DW$T$184, DW_AT_name("div_t")
    7487                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$63)
    7488                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    7489                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include
    7490                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x5c)
    7491                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x23)
    7492                    
    7493                    
    7494                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    7495                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x08)
    7496                    $C$DW$485       .dwtag  DW_TAG_member
    7497                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$10)
    7498                            .dwattr $C$DW$485, DW_AT_name("quot")
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  138

    7499                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("quot")
    7500                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7501                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    7502                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    7503                            .dwattr $C$DW$485, DW_AT_decl_line(0x5e)
    7504                            .dwattr $C$DW$485, DW_AT_decl_column(0x16)
    7505                    
    7506                    $C$DW$486       .dwtag  DW_TAG_member
    7507                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$10)
    7508                            .dwattr $C$DW$486, DW_AT_name("rem")
    7509                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("rem")
    7510                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7511                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    7512                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    7513                            .dwattr $C$DW$486, DW_AT_decl_line(0x5e)
    7514                            .dwattr $C$DW$486, DW_AT_decl_column(0x1c)
    7515                    
    7516                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
    7517                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x5e)
    7518                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x10)
    7519                            .dwendtag $C$DW$T$64
    7520                    
    7521                    $C$DW$T$185     .dwtag  DW_TAG_typedef
    7522                            .dwattr $C$DW$T$185, DW_AT_name("ldiv_t")
    7523                            .dwattr $C$DW$T$185, DW_AT_type(*$C$DW$T$64)
    7524                            .dwattr $C$DW$T$185, DW_AT_language(DW_LANG_C)
    7525                            .dwattr $C$DW$T$185, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include
    7526                            .dwattr $C$DW$T$185, DW_AT_decl_line(0x5e)
    7527                            .dwattr $C$DW$T$185, DW_AT_decl_column(0x23)
    7528                    
    7529                    
    7530                    $C$DW$T$65      .dwtag  DW_TAG_structure_type
    7531                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
    7532                    $C$DW$487       .dwtag  DW_TAG_member
    7533                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$14)
    7534                            .dwattr $C$DW$487, DW_AT_name("quot")
    7535                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("quot")
    7536                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7537                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    7538                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    7539                            .dwattr $C$DW$487, DW_AT_decl_line(0x61)
    7540                            .dwattr $C$DW$487, DW_AT_decl_column(0x1c)
    7541                    
    7542                    $C$DW$488       .dwtag  DW_TAG_member
    7543                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$14)
    7544                            .dwattr $C$DW$488, DW_AT_name("rem")
    7545                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("rem")
    7546                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7547                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    7548                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    7549                            .dwattr $C$DW$488, DW_AT_decl_line(0x61)
    7550                            .dwattr $C$DW$488, DW_AT_decl_column(0x22)
    7551                    
    7552                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
    7553                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x61)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  139

    7554                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x10)
    7555                            .dwendtag $C$DW$T$65
    7556                    
    7557                    $C$DW$T$186     .dwtag  DW_TAG_typedef
    7558                            .dwattr $C$DW$T$186, DW_AT_name("lldiv_t")
    7559                            .dwattr $C$DW$T$186, DW_AT_type(*$C$DW$T$65)
    7560                            .dwattr $C$DW$T$186, DW_AT_language(DW_LANG_C)
    7561                            .dwattr $C$DW$T$186, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include
    7562                            .dwattr $C$DW$T$186, DW_AT_decl_line(0x61)
    7563                            .dwattr $C$DW$T$186, DW_AT_decl_column(0x29)
    7564                    
    7565                    
    7566                    $C$DW$T$69      .dwtag  DW_TAG_structure_type
    7567                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x08)
    7568                    $C$DW$489       .dwtag  DW_TAG_member
    7569                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$67)
    7570                            .dwattr $C$DW$489, DW_AT_name("pointerStack")
    7571                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("pointerStack")
    7572                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7573                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    7574                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7575                            .dwattr $C$DW$489, DW_AT_decl_line(0x3f5)
    7576                            .dwattr $C$DW$489, DW_AT_decl_column(0x16)
    7577                    
    7578                    $C$DW$490       .dwtag  DW_TAG_member
    7579                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$68)
    7580                            .dwattr $C$DW$490, DW_AT_name("directAPI")
    7581                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("directAPI")
    7582                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7583                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    7584                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7585                            .dwattr $C$DW$490, DW_AT_decl_line(0x3f6)
    7586                            .dwattr $C$DW$490, DW_AT_decl_column(0x15)
    7587                    
    7588                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7589                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x3f4)
    7590                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
    7591                            .dwendtag $C$DW$T$69
    7592                    
    7593                    $C$DW$T$71      .dwtag  DW_TAG_typedef
    7594                            .dwattr $C$DW$T$71, DW_AT_name("icall_directAPIMsg_t")
    7595                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$69)
    7596                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    7597                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7598                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x3f7)
    7599                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x03)
    7600                    
    7601                    
    7602                    $C$DW$T$72      .dwtag  DW_TAG_structure_type
    7603                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x14)
    7604                    $C$DW$491       .dwtag  DW_TAG_member
    7605                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$70)
    7606                            .dwattr $C$DW$491, DW_AT_name("hdr")
    7607                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("hdr")
    7608                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  140

    7609                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    7610                            .dwattr $C$DW$491, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7611                            .dwattr $C$DW$491, DW_AT_decl_line(0x3fb)
    7612                            .dwattr $C$DW$491, DW_AT_decl_column(0x10)
    7613                    
    7614                    $C$DW$492       .dwtag  DW_TAG_member
    7615                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$71)
    7616                            .dwattr $C$DW$492, DW_AT_name("msg")
    7617                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("msg")
    7618                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7619                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    7620                            .dwattr $C$DW$492, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7621                            .dwattr $C$DW$492, DW_AT_decl_line(0x3fc)
    7622                            .dwattr $C$DW$492, DW_AT_decl_column(0x1a)
    7623                    
    7624                            .dwattr $C$DW$T$72, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7625                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x3fa)
    7626                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
    7627                            .dwendtag $C$DW$T$72
    7628                    
    7629                    $C$DW$T$187     .dwtag  DW_TAG_typedef
    7630                            .dwattr $C$DW$T$187, DW_AT_name("icallLiteMsg_t")
    7631                            .dwattr $C$DW$T$187, DW_AT_type(*$C$DW$T$72)
    7632                            .dwattr $C$DW$T$187, DW_AT_language(DW_LANG_C)
    7633                            .dwattr $C$DW$T$187, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7634                            .dwattr $C$DW$T$187, DW_AT_decl_line(0x3fd)
    7635                            .dwattr $C$DW$T$187, DW_AT_decl_column(0x03)
    7636                    
    7637                    
    7638                    $C$DW$T$74      .dwtag  DW_TAG_structure_type
    7639                            .dwattr $C$DW$T$74, DW_AT_byte_size(0x02)
    7640                    $C$DW$493       .dwtag  DW_TAG_member
    7641                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$73)
    7642                            .dwattr $C$DW$493, DW_AT_name("pwrmgr_task_state")
    7643                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("pwrmgr_task_state")
    7644                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7645                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    7646                            .dwattr $C$DW$493, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7647                            .dwattr $C$DW$493, DW_AT_decl_line(0x48)
    7648                            .dwattr $C$DW$493, DW_AT_decl_column(0x0a)
    7649                    
    7650                            .dwattr $C$DW$T$74, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7651                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x47)
    7652                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
    7653                            .dwendtag $C$DW$T$74
    7654                    
    7655                    $C$DW$T$188     .dwtag  DW_TAG_typedef
    7656                            .dwattr $C$DW$T$188, DW_AT_name("pwrmgr_attribute_t")
    7657                            .dwattr $C$DW$T$188, DW_AT_type(*$C$DW$T$74)
    7658                            .dwattr $C$DW$T$188, DW_AT_language(DW_LANG_C)
    7659                            .dwattr $C$DW$T$188, DW_AT_decl_file("..\Application\MAC\OSAL\osal_pwrmgr.h")
    7660                            .dwattr $C$DW$T$188, DW_AT_decl_line(0x4e)
    7661                            .dwattr $C$DW$T$188, DW_AT_decl_column(0x03)
    7662                    
    7663                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  141

    7664                    $C$DW$T$75      .dwtag  DW_TAG_structure_type
    7665                            .dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
    7666                    $C$DW$494       .dwtag  DW_TAG_member
    7667                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$19)
    7668                            .dwattr $C$DW$494, DW_AT_name("seconds")
    7669                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("seconds")
    7670                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7671                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    7672                            .dwattr $C$DW$494, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7673                            .dwattr $C$DW$494, DW_AT_decl_line(0x50)
    7674                            .dwattr $C$DW$494, DW_AT_decl_column(0x09)
    7675                    
    7676                    $C$DW$495       .dwtag  DW_TAG_member
    7677                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$19)
    7678                            .dwattr $C$DW$495, DW_AT_name("minutes")
    7679                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("minutes")
    7680                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7681                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    7682                            .dwattr $C$DW$495, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7683                            .dwattr $C$DW$495, DW_AT_decl_line(0x51)
    7684                            .dwattr $C$DW$495, DW_AT_decl_column(0x09)
    7685                    
    7686                    $C$DW$496       .dwtag  DW_TAG_member
    7687                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    7688                            .dwattr $C$DW$496, DW_AT_name("hour")
    7689                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("hour")
    7690                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7691                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    7692                            .dwattr $C$DW$496, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7693                            .dwattr $C$DW$496, DW_AT_decl_line(0x52)
    7694                            .dwattr $C$DW$496, DW_AT_decl_column(0x09)
    7695                    
    7696                    $C$DW$497       .dwtag  DW_TAG_member
    7697                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
    7698                            .dwattr $C$DW$497, DW_AT_name("day")
    7699                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("day")
    7700                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7701                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    7702                            .dwattr $C$DW$497, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7703                            .dwattr $C$DW$497, DW_AT_decl_line(0x53)
    7704                            .dwattr $C$DW$497, DW_AT_decl_column(0x09)
    7705                    
    7706                    $C$DW$498       .dwtag  DW_TAG_member
    7707                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
    7708                            .dwattr $C$DW$498, DW_AT_name("month")
    7709                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("month")
    7710                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7711                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    7712                            .dwattr $C$DW$498, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7713                            .dwattr $C$DW$498, DW_AT_decl_line(0x54)
    7714                            .dwattr $C$DW$498, DW_AT_decl_column(0x09)
    7715                    
    7716                    $C$DW$499       .dwtag  DW_TAG_member
    7717                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$73)
    7718                            .dwattr $C$DW$499, DW_AT_name("year")
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  142

    7719                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("year")
    7720                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7721                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    7722                            .dwattr $C$DW$499, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7723                            .dwattr $C$DW$499, DW_AT_decl_line(0x55)
    7724                            .dwattr $C$DW$499, DW_AT_decl_column(0x0a)
    7725                    
    7726                            .dwattr $C$DW$T$75, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7727                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x4f)
    7728                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x01)
    7729                            .dwendtag $C$DW$T$75
    7730                    
    7731                    $C$DW$T$189     .dwtag  DW_TAG_typedef
    7732                            .dwattr $C$DW$T$189, DW_AT_name("UTCTimeStruct")
    7733                            .dwattr $C$DW$T$189, DW_AT_type(*$C$DW$T$75)
    7734                            .dwattr $C$DW$T$189, DW_AT_language(DW_LANG_C)
    7735                            .dwattr $C$DW$T$189, DW_AT_decl_file("..\Application\MAC\OSAL\osal_clock.h")
    7736                            .dwattr $C$DW$T$189, DW_AT_decl_line(0x56)
    7737                            .dwattr $C$DW$T$189, DW_AT_decl_column(0x03)
    7738                    
    7739                    
    7740                    $C$DW$T$78      .dwtag  DW_TAG_structure_type
    7741                            .dwattr $C$DW$T$78, DW_AT_byte_size(0x0c)
    7742                    $C$DW$500       .dwtag  DW_TAG_member
    7743                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$76)
    7744                            .dwattr $C$DW$500, DW_AT_name("bufferHead")
    7745                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("bufferHead")
    7746                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7747                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    7748                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7749                            .dwattr $C$DW$500, DW_AT_decl_line(0x80)
    7750                            .dwattr $C$DW$500, DW_AT_decl_column(0x13)
    7751                    
    7752                    $C$DW$501       .dwtag  DW_TAG_member
    7753                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$76)
    7754                            .dwattr $C$DW$501, DW_AT_name("bufferTail")
    7755                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("bufferTail")
    7756                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7757                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    7758                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7759                            .dwattr $C$DW$501, DW_AT_decl_line(0x81)
    7760                            .dwattr $C$DW$501, DW_AT_decl_column(0x13)
    7761                    
    7762                    $C$DW$502       .dwtag  DW_TAG_member
    7763                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$73)
    7764                            .dwattr $C$DW$502, DW_AT_name("maxBufSize")
    7765                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("maxBufSize")
    7766                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7767                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    7768                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7769                            .dwattr $C$DW$502, DW_AT_decl_line(0x82)
    7770                            .dwattr $C$DW$502, DW_AT_decl_column(0x0a)
    7771                    
    7772                    $C$DW$503       .dwtag  DW_TAG_member
    7773                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$77)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  143

    7774                            .dwattr $C$DW$503, DW_AT_name("pBuffer")
    7775                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("pBuffer")
    7776                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7777                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    7778                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7779                            .dwattr $C$DW$503, DW_AT_decl_line(0x83)
    7780                            .dwattr $C$DW$503, DW_AT_decl_column(0x0a)
    7781                    
    7782                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7783                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x7e)
    7784                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
    7785                            .dwendtag $C$DW$T$78
    7786                    
    7787                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    7788                            .dwattr $C$DW$T$80, DW_AT_name("halUARTBufControl_t")
    7789                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$78)
    7790                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    7791                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7792                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x84)
    7793                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    7794                    
    7795                    
    7796                    $C$DW$T$85      .dwtag  DW_TAG_structure_type
    7797                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x2c)
    7798                    $C$DW$504       .dwtag  DW_TAG_member
    7799                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$79)
    7800                            .dwattr $C$DW$504, DW_AT_name("configured")
    7801                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("configured")
    7802                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7803                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    7804                            .dwattr $C$DW$504, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7805                            .dwattr $C$DW$504, DW_AT_decl_line(0x88)
    7806                            .dwattr $C$DW$504, DW_AT_decl_column(0x17)
    7807                    
    7808                    $C$DW$505       .dwtag  DW_TAG_member
    7809                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$19)
    7810                            .dwattr $C$DW$505, DW_AT_name("baudRate")
    7811                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("baudRate")
    7812                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7813                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    7814                            .dwattr $C$DW$505, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7815                            .dwattr $C$DW$505, DW_AT_decl_line(0x89)
    7816                            .dwattr $C$DW$505, DW_AT_decl_column(0x17)
    7817                    
    7818                    $C$DW$506       .dwtag  DW_TAG_member
    7819                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$79)
    7820                            .dwattr $C$DW$506, DW_AT_name("flowControl")
    7821                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("flowControl")
    7822                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7823                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    7824                            .dwattr $C$DW$506, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7825                            .dwattr $C$DW$506, DW_AT_decl_line(0x8a)
    7826                            .dwattr $C$DW$506, DW_AT_decl_column(0x17)
    7827                    
    7828                    $C$DW$507       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  144

    7829                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$73)
    7830                            .dwattr $C$DW$507, DW_AT_name("flowControlThreshold")
    7831                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("flowControlThreshold")
    7832                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7833                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    7834                            .dwattr $C$DW$507, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7835                            .dwattr $C$DW$507, DW_AT_decl_line(0x8b)
    7836                            .dwattr $C$DW$507, DW_AT_decl_column(0x17)
    7837                    
    7838                    $C$DW$508       .dwtag  DW_TAG_member
    7839                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
    7840                            .dwattr $C$DW$508, DW_AT_name("idleTimeout")
    7841                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("idleTimeout")
    7842                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7843                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    7844                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7845                            .dwattr $C$DW$508, DW_AT_decl_line(0x8c)
    7846                            .dwattr $C$DW$508, DW_AT_decl_column(0x17)
    7847                    
    7848                    $C$DW$509       .dwtag  DW_TAG_member
    7849                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$80)
    7850                            .dwattr $C$DW$509, DW_AT_name("rx")
    7851                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("rx")
    7852                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7853                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    7854                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7855                            .dwattr $C$DW$509, DW_AT_decl_line(0x8d)
    7856                            .dwattr $C$DW$509, DW_AT_decl_column(0x17)
    7857                    
    7858                    $C$DW$510       .dwtag  DW_TAG_member
    7859                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$80)
    7860                            .dwattr $C$DW$510, DW_AT_name("tx")
    7861                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("tx")
    7862                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7863                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    7864                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7865                            .dwattr $C$DW$510, DW_AT_decl_line(0x8e)
    7866                            .dwattr $C$DW$510, DW_AT_decl_column(0x17)
    7867                    
    7868                    $C$DW$511       .dwtag  DW_TAG_member
    7869                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$79)
    7870                            .dwattr $C$DW$511, DW_AT_name("intEnable")
    7871                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("intEnable")
    7872                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7873                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    7874                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7875                            .dwattr $C$DW$511, DW_AT_decl_line(0x8f)
    7876                            .dwattr $C$DW$511, DW_AT_decl_column(0x17)
    7877                    
    7878                    $C$DW$512       .dwtag  DW_TAG_member
    7879                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$81)
    7880                            .dwattr $C$DW$512, DW_AT_name("rxChRvdTime")
    7881                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("rxChRvdTime")
    7882                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7883                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  145

    7884                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7885                            .dwattr $C$DW$512, DW_AT_decl_line(0x90)
    7886                            .dwattr $C$DW$512, DW_AT_decl_column(0x17)
    7887                    
    7888                    $C$DW$513       .dwtag  DW_TAG_member
    7889                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$84)
    7890                            .dwattr $C$DW$513, DW_AT_name("callBackFunc")
    7891                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("callBackFunc")
    7892                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7893                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    7894                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7895                            .dwattr $C$DW$513, DW_AT_decl_line(0x91)
    7896                            .dwattr $C$DW$513, DW_AT_decl_column(0x17)
    7897                    
    7898                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7899                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x87)
    7900                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x01)
    7901                            .dwendtag $C$DW$T$85
    7902                    
    7903                    $C$DW$T$190     .dwtag  DW_TAG_typedef
    7904                            .dwattr $C$DW$T$190, DW_AT_name("halUARTCfg_t")
    7905                            .dwattr $C$DW$T$190, DW_AT_type(*$C$DW$T$85)
    7906                            .dwattr $C$DW$T$190, DW_AT_language(DW_LANG_C)
    7907                            .dwattr $C$DW$T$190, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    7908                            .dwattr $C$DW$T$190, DW_AT_decl_line(0x92)
    7909                            .dwattr $C$DW$T$190, DW_AT_decl_column(0x02)
    7910                    
    7911                    
    7912                    $C$DW$T$87      .dwtag  DW_TAG_structure_type
    7913                            .dwattr $C$DW$T$87, DW_AT_byte_size(0x04)
    7914                    $C$DW$514       .dwtag  DW_TAG_member
    7915                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$86)
    7916                            .dwattr $C$DW$514, DW_AT_name("hdr")
    7917                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("hdr")
    7918                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7919                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    7920                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    7921                            .dwattr $C$DW$514, DW_AT_decl_line(0xbc)
    7922                            .dwattr $C$DW$514, DW_AT_decl_column(0x14)
    7923                    
    7924                    $C$DW$515       .dwtag  DW_TAG_member
    7925                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$19)
    7926                            .dwattr $C$DW$515, DW_AT_name("state")
    7927                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("state")
    7928                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7929                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    7930                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    7931                            .dwattr $C$DW$515, DW_AT_decl_line(0xbd)
    7932                            .dwattr $C$DW$515, DW_AT_decl_column(0x09)
    7933                    
    7934                    $C$DW$516       .dwtag  DW_TAG_member
    7935                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$19)
    7936                            .dwattr $C$DW$516, DW_AT_name("keys")
    7937                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("keys")
    7938                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  146

    7939                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    7940                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC135
    7941                            .dwattr $C$DW$516, DW_AT_decl_line(0xbe)
    7942                            .dwattr $C$DW$516, DW_AT_decl_column(0x09)
    7943                    
    7944                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC13
    7945                            .dwattr $C$DW$T$87, DW_AT_decl_line(0xbb)
    7946                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
    7947                            .dwendtag $C$DW$T$87
    7948                    
    7949                    $C$DW$T$191     .dwtag  DW_TAG_typedef
    7950                            .dwattr $C$DW$T$191, DW_AT_name("keyChange_t")
    7951                            .dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$87)
    7952                            .dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
    7953                            .dwattr $C$DW$T$191, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/examples/rtos/CC1
    7954                            .dwattr $C$DW$T$191, DW_AT_decl_line(0xbf)
    7955                            .dwattr $C$DW$T$191, DW_AT_decl_column(0x03)
    7956                    
    7957                    
    7958                    $C$DW$T$92      .dwtag  DW_TAG_union_type
    7959                            .dwattr $C$DW$T$92, DW_AT_byte_size(0x02)
    7960                    $C$DW$517       .dwtag  DW_TAG_member
    7961                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$89)
    7962                            .dwattr $C$DW$517, DW_AT_name("entityId")
    7963                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("entityId")
    7964                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7965                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    7966                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7967                            .dwattr $C$DW$517, DW_AT_decl_line(0x1fe)
    7968                            .dwattr $C$DW$517, DW_AT_decl_column(0x14)
    7969                    
    7970                    $C$DW$518       .dwtag  DW_TAG_member
    7971                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$91)
    7972                            .dwattr $C$DW$518, DW_AT_name("servId")
    7973                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("servId")
    7974                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7975                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    7976                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7977                            .dwattr $C$DW$518, DW_AT_decl_line(0x200)
    7978                            .dwattr $C$DW$518, DW_AT_decl_column(0x17)
    7979                    
    7980                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7981                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x1fc)
    7982                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    7983                            .dwendtag $C$DW$T$92
    7984                    
    7985                    
    7986                    $C$DW$T$93      .dwtag  DW_TAG_union_type
    7987                            .dwattr $C$DW$T$93, DW_AT_byte_size(0x02)
    7988                    $C$DW$519       .dwtag  DW_TAG_member
    7989                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$91)
    7990                            .dwattr $C$DW$519, DW_AT_name("servId")
    7991                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("servId")
    7992                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7993                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  147

    7994                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7995                            .dwattr $C$DW$519, DW_AT_decl_line(0x211)
    7996                            .dwattr $C$DW$519, DW_AT_decl_column(0x17)
    7997                    
    7998                    $C$DW$520       .dwtag  DW_TAG_member
    7999                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$89)
    8000                            .dwattr $C$DW$520, DW_AT_name("entityId")
    8001                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("entityId")
    8002                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8003                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    8004                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8005                            .dwattr $C$DW$520, DW_AT_decl_line(0x213)
    8006                            .dwattr $C$DW$520, DW_AT_decl_column(0x14)
    8007                    
    8008                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    8009                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x20f)
    8010                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    8011                            .dwendtag $C$DW$T$93
    8012                    
    8013                    
    8014                    $C$DW$T$94      .dwtag  DW_TAG_union_type
    8015                            .dwattr $C$DW$T$94, DW_AT_byte_size(0x02)
    8016                    $C$DW$521       .dwtag  DW_TAG_member
    8017                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$79)
    8018                            .dwattr $C$DW$521, DW_AT_name("paramCTS")
    8019                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("paramCTS")
    8020                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8021                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    8022                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8023                            .dwattr $C$DW$521, DW_AT_decl_line(0x96)
    8024                            .dwattr $C$DW$521, DW_AT_decl_column(0x08)
    8025                    
    8026                    $C$DW$522       .dwtag  DW_TAG_member
    8027                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$79)
    8028                            .dwattr $C$DW$522, DW_AT_name("paramRTS")
    8029                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("paramRTS")
    8030                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8031                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    8032                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8033                            .dwattr $C$DW$522, DW_AT_decl_line(0x97)
    8034                            .dwattr $C$DW$522, DW_AT_decl_column(0x08)
    8035                    
    8036                    $C$DW$523       .dwtag  DW_TAG_member
    8037                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$79)
    8038                            .dwattr $C$DW$523, DW_AT_name("paramDSR")
    8039                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("paramDSR")
    8040                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8041                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    8042                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8043                            .dwattr $C$DW$523, DW_AT_decl_line(0x98)
    8044                            .dwattr $C$DW$523, DW_AT_decl_column(0x08)
    8045                    
    8046                    $C$DW$524       .dwtag  DW_TAG_member
    8047                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$79)
    8048                            .dwattr $C$DW$524, DW_AT_name("paramDTR")
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  148

    8049                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("paramDTR")
    8050                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8051                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    8052                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8053                            .dwattr $C$DW$524, DW_AT_decl_line(0x99)
    8054                            .dwattr $C$DW$524, DW_AT_decl_column(0x08)
    8055                    
    8056                    $C$DW$525       .dwtag  DW_TAG_member
    8057                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$79)
    8058                            .dwattr $C$DW$525, DW_AT_name("paramCD")
    8059                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("paramCD")
    8060                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8061                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    8062                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8063                            .dwattr $C$DW$525, DW_AT_decl_line(0x9a)
    8064                            .dwattr $C$DW$525, DW_AT_decl_column(0x08)
    8065                    
    8066                    $C$DW$526       .dwtag  DW_TAG_member
    8067                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$79)
    8068                            .dwattr $C$DW$526, DW_AT_name("paramRI")
    8069                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("paramRI")
    8070                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8071                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    8072                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8073                            .dwattr $C$DW$526, DW_AT_decl_line(0x9b)
    8074                            .dwattr $C$DW$526, DW_AT_decl_column(0x08)
    8075                    
    8076                    $C$DW$527       .dwtag  DW_TAG_member
    8077                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$73)
    8078                            .dwattr $C$DW$527, DW_AT_name("baudRate")
    8079                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("baudRate")
    8080                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8081                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    8082                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8083                            .dwattr $C$DW$527, DW_AT_decl_line(0x9c)
    8084                            .dwattr $C$DW$527, DW_AT_decl_column(0x0a)
    8085                    
    8086                    $C$DW$528       .dwtag  DW_TAG_member
    8087                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$79)
    8088                            .dwattr $C$DW$528, DW_AT_name("flowControl")
    8089                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("flowControl")
    8090                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8091                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    8092                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8093                            .dwattr $C$DW$528, DW_AT_decl_line(0x9d)
    8094                            .dwattr $C$DW$528, DW_AT_decl_column(0x08)
    8095                    
    8096                    $C$DW$529       .dwtag  DW_TAG_member
    8097                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$79)
    8098                            .dwattr $C$DW$529, DW_AT_name("flushControl")
    8099                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("flushControl")
    8100                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8101                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    8102                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8103                            .dwattr $C$DW$529, DW_AT_decl_line(0x9e)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  149

    8104                            .dwattr $C$DW$529, DW_AT_decl_column(0x08)
    8105                    
    8106                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    8107                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x95)
    8108                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x01)
    8109                            .dwendtag $C$DW$T$94
    8110                    
    8111                    $C$DW$T$192     .dwtag  DW_TAG_typedef
    8112                            .dwattr $C$DW$T$192, DW_AT_name("halUARTIoctl_t")
    8113                            .dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$94)
    8114                            .dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
    8115                            .dwattr $C$DW$T$192, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8116                            .dwattr $C$DW$T$192, DW_AT_decl_line(0x9f)
    8117                            .dwattr $C$DW$T$192, DW_AT_decl_column(0x02)
    8118                    
    8119                    
    8120                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    8121                            .dwattr $C$DW$T$99, DW_AT_name(".ggroup1")
    8122                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x2c)
    8123                    $C$DW$530       .dwtag  DW_TAG_member
    8124                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$6)
    8125                            .dwattr $C$DW$530, DW_AT_name("activeTaskID")
    8126                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("activeTaskID")
    8127                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8128                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    8129                    
    8130                    $C$DW$531       .dwtag  DW_TAG_member
    8131                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$6)
    8132                            .dwattr $C$DW$531, DW_AT_name("osal_notask_entity")
    8133                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("osal_notask_entity")
    8134                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8135                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    8136                    
    8137                    $C$DW$532       .dwtag  DW_TAG_member
    8138                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$95)
    8139                            .dwattr $C$DW$532, DW_AT_name("osal_proxy_tasks")
    8140                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("osal_proxy_tasks")
    8141                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8142                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    8143                    
    8144                    $C$DW$533       .dwtag  DW_TAG_member
    8145                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$3)
    8146                            .dwattr $C$DW$533, DW_AT_name("osal_qHead")
    8147                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("osal_qHead")
    8148                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8149                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    8150                    
    8151                    $C$DW$534       .dwtag  DW_TAG_member
    8152                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$37)
    8153                            .dwattr $C$DW$534, DW_AT_name("osal_eventloop_hook")
    8154                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("osal_eventloop_hook")
    8155                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8156                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    8157                    
    8158                    $C$DW$535       .dwtag  DW_TAG_member
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  150

    8159                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$97)
    8160                            .dwattr $C$DW$535, DW_AT_name("osal_icallMsg_hook")
    8161                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("osal_icallMsg_hook")
    8162                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8163                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    8164                    
    8165                    $C$DW$536       .dwtag  DW_TAG_member
    8166                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$3)
    8167                            .dwattr $C$DW$536, DW_AT_name("osal_semaphore")
    8168                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("osal_semaphore")
    8169                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8170                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    8171                    
    8172                    $C$DW$537       .dwtag  DW_TAG_member
    8173                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$11)
    8174                            .dwattr $C$DW$537, DW_AT_name("osal_last_timestamp")
    8175                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("osal_last_timestamp")
    8176                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8177                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    8178                    
    8179                    $C$DW$538       .dwtag  DW_TAG_member
    8180                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$11)
    8181                            .dwattr $C$DW$538, DW_AT_name("osal_tickperiod")
    8182                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("osal_tickperiod")
    8183                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8184                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    8185                    
    8186                    $C$DW$539       .dwtag  DW_TAG_member
    8187                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$11)
    8188                            .dwattr $C$DW$539, DW_AT_name("osal_max_msecs")
    8189                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("osal_max_msecs")
    8190                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8191                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    8192                    
    8193                    $C$DW$540       .dwtag  DW_TAG_member
    8194                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$3)
    8195                            .dwattr $C$DW$540, DW_AT_name("osal_timerid_msec_timer")
    8196                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("osal_timerid_msec_timer")
    8197                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8198                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    8199                    
    8200                    $C$DW$541       .dwtag  DW_TAG_member
    8201                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$11)
    8202                            .dwattr $C$DW$541, DW_AT_name("osal_msec_timer_seq")
    8203                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("osal_msec_timer_seq")
    8204                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8205                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    8206                    
    8207                    $C$DW$542       .dwtag  DW_TAG_member
    8208                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$98)
    8209                            .dwattr $C$DW$542, DW_AT_name("osal_dispatch_entities")
    8210                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("osal_dispatch_entities")
    8211                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8212                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    8213                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  151

    8214                            .dwendtag $C$DW$T$99
    8215                    
    8216                    
    8217                    $C$DW$T$100     .dwtag  DW_TAG_structure_type
    8218                            .dwattr $C$DW$T$100, DW_AT_name("_ICall_LiteCmdStatus_")
    8219                            .dwattr $C$DW$T$100, DW_AT_byte_size(0x01)
    8220                    $C$DW$543       .dwtag  DW_TAG_member
    8221                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$88)
    8222                            .dwattr $C$DW$543, DW_AT_name("cmdId")
    8223                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("cmdId")
    8224                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8225                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    8226                            .dwattr $C$DW$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    8227                            .dwattr $C$DW$543, DW_AT_decl_line(0x3f0)
    8228                            .dwattr $C$DW$543, DW_AT_decl_column(0x11)
    8229                    
    8230                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8231                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x3ee)
    8232                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x10)
    8233                            .dwendtag $C$DW$T$100
    8234                    
    8235                    $C$DW$T$194     .dwtag  DW_TAG_typedef
    8236                            .dwattr $C$DW$T$194, DW_AT_name("ICall_LiteCmdStatus")
    8237                            .dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$100)
    8238                            .dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
    8239                            .dwattr $C$DW$T$194, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8240                            .dwattr $C$DW$T$194, DW_AT_decl_line(0x3f1)
    8241                            .dwattr $C$DW$T$194, DW_AT_decl_column(0x03)
    8242                    
    8243                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    8244                            .dwattr $C$DW$T$2, DW_AT_name("void")
    8245                    
    8246                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    8247                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    8248                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    8249                    
    8250                    $C$DW$T$195     .dwtag  DW_TAG_typedef
    8251                            .dwattr $C$DW$T$195, DW_AT_name("ICall_Semaphore")
    8252                            .dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$3)
    8253                            .dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
    8254                            .dwattr $C$DW$T$195, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8255                            .dwattr $C$DW$T$195, DW_AT_decl_line(0x1ac)
    8256                            .dwattr $C$DW$T$195, DW_AT_decl_column(0x0f)
    8257                    
    8258                    $C$DW$T$114     .dwtag  DW_TAG_typedef
    8259                            .dwattr $C$DW$T$114, DW_AT_name("ICall_SyncHandle")
    8260                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$3)
    8261                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    8262                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8263                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x1aa)
    8264                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x0f)
    8265                    
    8266                    $C$DW$T$196     .dwtag  DW_TAG_const_type
    8267                            .dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$114)
    8268                    
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  152

    8269                    $C$DW$T$158     .dwtag  DW_TAG_typedef
    8270                            .dwattr $C$DW$T$158, DW_AT_name("ICall_TimerID")
    8271                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$3)
    8272                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    8273                            .dwattr $C$DW$T$158, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8274                            .dwattr $C$DW$T$158, DW_AT_decl_line(0x1b7)
    8275                            .dwattr $C$DW$T$158, DW_AT_decl_column(0x0f)
    8276                    
    8277                    $C$DW$T$212     .dwtag  DW_TAG_const_type
    8278                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$3)
    8279                    
    8280                    $C$DW$T$209     .dwtag  DW_TAG_typedef
    8281                            .dwattr $C$DW$T$209, DW_AT_name("osal_msg_q_t")
    8282                            .dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$3)
    8283                            .dwattr $C$DW$T$209, DW_AT_language(DW_LANG_C)
    8284                            .dwattr $C$DW$T$209, DW_AT_decl_file("..\Application\MAC\OSAL\osal.h")
    8285                            .dwattr $C$DW$T$209, DW_AT_decl_line(0x7d)
    8286                            .dwattr $C$DW$T$209, DW_AT_decl_column(0x10)
    8287                    
    8288                    $C$DW$T$210     .dwtag  DW_TAG_pointer_type
    8289                            .dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$209)
    8290                            .dwattr $C$DW$T$210, DW_AT_address_class(0x20)
    8291                    
    8292                    $C$DW$T$213     .dwtag  DW_TAG_const_type
    8293                            .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$210)
    8294                    
    8295                    
    8296                    $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    8297                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    8298                            .dwendtag $C$DW$T$36
    8299                    
    8300                    $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    8301                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    8302                            .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    8303                    
    8304                    $C$DW$T$173     .dwtag  DW_TAG_typedef
    8305                            .dwattr $C$DW$T$173, DW_AT_name("APPASRTINTF_callAssrtHndler")
    8306                            .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$37)
    8307                            .dwattr $C$DW$T$173, DW_AT_language(DW_LANG_C)
    8308                            .dwattr $C$DW$T$173, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    8309                            .dwattr $C$DW$T$173, DW_AT_decl_line(0x43)
    8310                            .dwattr $C$DW$T$173, DW_AT_decl_column(0x10)
    8311                    
    8312                    $C$DW$T$55      .dwtag  DW_TAG_typedef
    8313                            .dwattr $C$DW$T$55, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
    8314                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$37)
    8315                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    8316                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    8317                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x5f)
    8318                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x19)
    8319                    
    8320                    $C$DW$T$38      .dwtag  DW_TAG_typedef
    8321                            .dwattr $C$DW$T$38, DW_AT_name("FPTR_RESETDEV_T")
    8322                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    8323                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:22 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{C0FD8B89-A46A-4A40-807E-9273540D77E1} PAGE  153

    8324                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    8325                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x4d)
    8326                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x19)
    8327                    
