TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Sat Nov 24 22:21:09 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/osaltasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\colle
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    4267                            .dwattr $C$DW$432, DW_AT_const_value(0x08)
    4268                            .dwattr $C$DW$432, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4269                            .dwattr $C$DW$432, DW_AT_decl_line(0xa8)
    4270                            .dwattr $C$DW$432, DW_AT_decl_column(0x05)
    4271                    
    4272                    $C$DW$433       .dwtag  DW_TAG_enumerator
    4273                            .dwattr $C$DW$433, DW_AT_name("FAPI_VALIDATE_SECTOR")
    4274                            .dwattr $C$DW$433, DW_AT_const_value(0x0e)
    4275                            .dwattr $C$DW$433, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4276                            .dwattr $C$DW$433, DW_AT_decl_line(0xa9)
    4277                            .dwattr $C$DW$433, DW_AT_decl_column(0x05)
    4278                    
    4279                    $C$DW$434       .dwtag  DW_TAG_enumerator
    4280                            .dwattr $C$DW$434, DW_AT_name("FAPI_CLEAR_STATUS")
    4281                            .dwattr $C$DW$434, DW_AT_const_value(0x10)
    4282                            .dwattr $C$DW$434, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4283                            .dwattr $C$DW$434, DW_AT_decl_line(0xaa)
    4284                            .dwattr $C$DW$434, DW_AT_decl_column(0x05)
    4285                    
    4286                    $C$DW$435       .dwtag  DW_TAG_enumerator
    4287                            .dwattr $C$DW$435, DW_AT_name("FAPI_PROGRAM_RESUME")
    4288                            .dwattr $C$DW$435, DW_AT_const_value(0x14)
    4289                            .dwattr $C$DW$435, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4290                            .dwattr $C$DW$435, DW_AT_decl_line(0xab)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   79

    4291                            .dwattr $C$DW$435, DW_AT_decl_column(0x05)
    4292                    
    4293                    $C$DW$436       .dwtag  DW_TAG_enumerator
    4294                            .dwattr $C$DW$436, DW_AT_name("FAPI_ERASE_RESUME")
    4295                            .dwattr $C$DW$436, DW_AT_const_value(0x16)
    4296                            .dwattr $C$DW$436, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4297                            .dwattr $C$DW$436, DW_AT_decl_line(0xac)
    4298                            .dwattr $C$DW$436, DW_AT_decl_column(0x05)
    4299                    
    4300                    $C$DW$437       .dwtag  DW_TAG_enumerator
    4301                            .dwattr $C$DW$437, DW_AT_name("FAPI_CLEAR_MORE")
    4302                            .dwattr $C$DW$437, DW_AT_const_value(0x18)
    4303                            .dwattr $C$DW$437, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4304                            .dwattr $C$DW$437, DW_AT_decl_line(0xad)
    4305                            .dwattr $C$DW$437, DW_AT_decl_column(0x05)
    4306                    
    4307                    $C$DW$438       .dwtag  DW_TAG_enumerator
    4308                            .dwattr $C$DW$438, DW_AT_name("FAPI_PROGRAM_SECTOR")
    4309                            .dwattr $C$DW$438, DW_AT_const_value(0x20)
    4310                            .dwattr $C$DW$438, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4311                            .dwattr $C$DW$438, DW_AT_decl_line(0xae)
    4312                            .dwattr $C$DW$438, DW_AT_decl_column(0x05)
    4313                    
    4314                    $C$DW$439       .dwtag  DW_TAG_enumerator
    4315                            .dwattr $C$DW$439, DW_AT_name("FAPI_ERASE_OTP")
    4316                            .dwattr $C$DW$439, DW_AT_const_value(0x30)
    4317                            .dwattr $C$DW$439, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    4318                            .dwattr $C$DW$439, DW_AT_decl_line(0xaf)
    4319                            .dwattr $C$DW$439, DW_AT_decl_column(0x05)
    4320                    
    4321                            .dwattr $C$DW$T$1058, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4322                            .dwattr $C$DW$T$1058, DW_AT_decl_line(0xa5)
    4323                            .dwattr $C$DW$T$1058, DW_AT_decl_column(0x01)
    4324                            .dwendtag $C$DW$T$1058
    4325                    
    4326                    $C$DW$T$1059    .dwtag  DW_TAG_typedef
    4327                            .dwattr $C$DW$T$1059, DW_AT_name("tFlashStateCommandsType")
    4328                            .dwattr $C$DW$T$1059, DW_AT_type(*$C$DW$T$1058)
    4329                            .dwattr $C$DW$T$1059, DW_AT_language(DW_LANG_C)
    4330                            .dwattr $C$DW$T$1059, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/device
    4331                            .dwattr $C$DW$T$1059, DW_AT_decl_line(0xb0)
    4332                            .dwattr $C$DW$T$1059, DW_AT_decl_column(0x03)
    4333                    
    4334                    
    4335                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4336                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    4337                    $C$DW$440       .dwtag  DW_TAG_member
    4338                            .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$19)
    4339                            .dwattr $C$DW$440, DW_AT_name("rfMode")
    4340                            .dwattr $C$DW$440, DW_AT_TI_symbol_name("rfMode")
    4341                            .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4342                            .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    4343                            .dwattr $C$DW$440, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4344                            .dwattr $C$DW$440, DW_AT_decl_line(0x421)
    4345                            .dwattr $C$DW$440, DW_AT_decl_column(0x0d)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   80

    4346                    
    4347                    $C$DW$441       .dwtag  DW_TAG_member
    4348                            .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$21)
    4349                            .dwattr $C$DW$441, DW_AT_name("cpePatchFxn")
    4350                            .dwattr $C$DW$441, DW_AT_TI_symbol_name("cpePatchFxn")
    4351                            .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4352                            .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    4353                            .dwattr $C$DW$441, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4354                            .dwattr $C$DW$441, DW_AT_decl_line(0x422)
    4355                            .dwattr $C$DW$441, DW_AT_decl_column(0x0c)
    4356                    
    4357                    $C$DW$442       .dwtag  DW_TAG_member
    4358                            .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$21)
    4359                            .dwattr $C$DW$442, DW_AT_name("mcePatchFxn")
    4360                            .dwattr $C$DW$442, DW_AT_TI_symbol_name("mcePatchFxn")
    4361                            .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4362                            .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    4363                            .dwattr $C$DW$442, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4364                            .dwattr $C$DW$442, DW_AT_decl_line(0x423)
    4365                            .dwattr $C$DW$442, DW_AT_decl_column(0x0c)
    4366                    
    4367                    $C$DW$443       .dwtag  DW_TAG_member
    4368                            .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$21)
    4369                            .dwattr $C$DW$443, DW_AT_name("rfePatchFxn")
    4370                            .dwattr $C$DW$443, DW_AT_TI_symbol_name("rfePatchFxn")
    4371                            .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4372                            .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    4373                            .dwattr $C$DW$443, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4374                            .dwattr $C$DW$443, DW_AT_decl_line(0x424)
    4375                            .dwattr $C$DW$443, DW_AT_decl_column(0x0c)
    4376                    
    4377                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4378                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x420)
    4379                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    4380                            .dwendtag $C$DW$T$22
    4381                    
    4382                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    4383                            .dwattr $C$DW$T$33, DW_AT_name("RF_Mode")
    4384                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$22)
    4385                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4386                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4387                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x425)
    4388                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x03)
    4389                    
    4390                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4391                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4392                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4393                    
    4394                    
    4395                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4396                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    4397                    $C$DW$444       .dwtag  DW_TAG_member
    4398                            .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$23)
    4399                            .dwattr $C$DW$444, DW_AT_name("rawValue")
    4400                            .dwattr $C$DW$444, DW_AT_TI_symbol_name("rawValue")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   81

    4401                            .dwattr $C$DW$444, DW_AT_bit_offset(0x0a)
    4402                            .dwattr $C$DW$444, DW_AT_bit_size(0x16)
    4403                            .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4404                            .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    4405                            .dwattr $C$DW$444, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4406                            .dwattr $C$DW$444, DW_AT_decl_line(0x3d6)
    4407                            .dwattr $C$DW$444, DW_AT_decl_column(0x0e)
    4408                    
    4409                    $C$DW$445       .dwtag  DW_TAG_member
    4410                            .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$23)
    4411                            .dwattr $C$DW$445, DW_AT_name("__dummy")
    4412                            .dwattr $C$DW$445, DW_AT_TI_symbol_name("__dummy")
    4413                            .dwattr $C$DW$445, DW_AT_bit_offset(0x01)
    4414                            .dwattr $C$DW$445, DW_AT_bit_size(0x09)
    4415                            .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4416                            .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    4417                            .dwattr $C$DW$445, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4418                            .dwattr $C$DW$445, DW_AT_decl_line(0x3da)
    4419                            .dwattr $C$DW$445, DW_AT_decl_column(0x0e)
    4420                    
    4421                    $C$DW$446       .dwtag  DW_TAG_member
    4422                            .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$23)
    4423                            .dwattr $C$DW$446, DW_AT_name("paType")
    4424                            .dwattr $C$DW$446, DW_AT_TI_symbol_name("paType")
    4425                            .dwattr $C$DW$446, DW_AT_bit_offset(0x00)
    4426                            .dwattr $C$DW$446, DW_AT_bit_size(0x01)
    4427                            .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4428                            .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    4429                            .dwattr $C$DW$446, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4430                            .dwattr $C$DW$446, DW_AT_decl_line(0x3db)
    4431                            .dwattr $C$DW$446, DW_AT_decl_column(0x0e)
    4432                    
    4433                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4434                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x3d5)
    4435                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    4436                            .dwendtag $C$DW$T$24
    4437                    
    4438                    $C$DW$T$26      .dwtag  DW_TAG_typedef
    4439                            .dwattr $C$DW$T$26, DW_AT_name("RF_TxPowerTable_Value")
    4440                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$24)
    4441                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    4442                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4443                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x3df)
    4444                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
    4445                    
    4446                    
    4447                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4448                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x05)
    4449                    $C$DW$447       .dwtag  DW_TAG_member
    4450                            .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$25)
    4451                            .dwattr $C$DW$447, DW_AT_name("power")
    4452                            .dwattr $C$DW$447, DW_AT_TI_symbol_name("power")
    4453                            .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4454                            .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    4455                            .dwattr $C$DW$447, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   82

    4456                            .dwattr $C$DW$447, DW_AT_decl_line(0x3f5)
    4457                            .dwattr $C$DW$447, DW_AT_decl_column(0x0c)
    4458                    
    4459                    $C$DW$448       .dwtag  DW_TAG_member
    4460                            .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$26)
    4461                            .dwattr $C$DW$448, DW_AT_name("value")
    4462                            .dwattr $C$DW$448, DW_AT_TI_symbol_name("value")
    4463                            .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4464                            .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    4465                            .dwattr $C$DW$448, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    4466                            .dwattr $C$DW$448, DW_AT_decl_line(0x3f8)
    4467                            .dwattr $C$DW$448, DW_AT_decl_column(0x1b)
    4468                    
    4469                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4470                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x3f4)
    4471                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    4472                            .dwendtag $C$DW$T$27
    4473                    
    4474                    $C$DW$T$28      .dwtag  DW_TAG_typedef
    4475                            .dwattr $C$DW$T$28, DW_AT_name("RF_TxPowerTable_Entry")
    4476                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4477                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    4478                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    4479                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3f9)
    4480                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x1b)
    4481                    
    4482                    $C$DW$T$29      .dwtag  DW_TAG_const_type
    4483                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    4484                    
    4485                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    4486                            .dwattr $C$DW$T$30, DW_AT_name("macTxPwrVal_t")
    4487                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    4488                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    4489                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/Ap
    4490                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x144)
    4491                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x25)
    4492                    
    4493                    $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    4494                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    4495                            .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    4496                    
    4497                    
    4498                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4499                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x04)
    4500                    $C$DW$449       .dwtag  DW_TAG_member
    4501                            .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$31)
    4502                            .dwattr $C$DW$449, DW_AT_name("pTxPwrVals")
    4503                            .dwattr $C$DW$449, DW_AT_TI_symbol_name("pTxPwrVals")
    4504                            .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4505                            .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    4506                            .dwattr $C$DW$449, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4507                            .dwattr $C$DW$449, DW_AT_decl_line(0x148)
    4508                            .dwattr $C$DW$449, DW_AT_decl_column(0x12)
    4509                    
    4510                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/Ap
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   83

    4511                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x147)
    4512                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    4513                            .dwendtag $C$DW$T$32
    4514                    
    4515                    $C$DW$T$36      .dwtag  DW_TAG_const_type
    4516                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$32)
    4517                    
    4518                    $C$DW$T$37      .dwtag  DW_TAG_typedef
    4519                            .dwattr $C$DW$T$37, DW_AT_name("macTxPwrTbl_t")
    4520                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    4521                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4522                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/Ap
    4523                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x149)
    4524                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    4525                    
    4526                    $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4527                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4528                            .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    4529                    
    4530                    
    4531                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4532                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x30)
    4533                    $C$DW$450       .dwtag  DW_TAG_member
    4534                            .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$23)
    4535                            .dwattr $C$DW$450, DW_AT_name("getHwRevision")
    4536                            .dwattr $C$DW$450, DW_AT_TI_symbol_name("getHwRevision")
    4537                            .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4538                            .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    4539                            .dwattr $C$DW$450, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4540                            .dwattr $C$DW$450, DW_AT_decl_line(0x155)
    4541                            .dwattr $C$DW$450, DW_AT_decl_column(0x1c)
    4542                    
    4543                    $C$DW$451       .dwtag  DW_TAG_member
    4544                            .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$34)
    4545                            .dwattr $C$DW$451, DW_AT_name("pRfPatchTable")
    4546                            .dwattr $C$DW$451, DW_AT_TI_symbol_name("pRfPatchTable")
    4547                            .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4548                            .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    4549                            .dwattr $C$DW$451, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4550                            .dwattr $C$DW$451, DW_AT_decl_line(0x156)
    4551                            .dwattr $C$DW$451, DW_AT_decl_column(0x1d)
    4552                    
    4553                    $C$DW$452       .dwtag  DW_TAG_member
    4554                            .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$35)
    4555                            .dwattr $C$DW$452, DW_AT_name("pRfDrvTblPtr")
    4556                            .dwattr $C$DW$452, DW_AT_TI_symbol_name("pRfDrvTblPtr")
    4557                            .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4558                            .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    4559                            .dwattr $C$DW$452, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4560                            .dwattr $C$DW$452, DW_AT_decl_line(0x157)
    4561                            .dwattr $C$DW$452, DW_AT_decl_column(0x1d)
    4562                    
    4563                    $C$DW$453       .dwtag  DW_TAG_member
    4564                            .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$35)
    4565                            .dwattr $C$DW$453, DW_AT_name("pCryptoDrvTblPtr")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   84

    4566                            .dwattr $C$DW$453, DW_AT_TI_symbol_name("pCryptoDrvTblPtr")
    4567                            .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4568                            .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    4569                            .dwattr $C$DW$453, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4570                            .dwattr $C$DW$453, DW_AT_decl_line(0x158)
    4571                            .dwattr $C$DW$453, DW_AT_decl_column(0x1d)
    4572                    
    4573                    $C$DW$454       .dwtag  DW_TAG_member
    4574                            .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$38)
    4575                            .dwattr $C$DW$454, DW_AT_name("pTxPwrTbl")
    4576                            .dwattr $C$DW$454, DW_AT_TI_symbol_name("pTxPwrTbl")
    4577                            .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4578                            .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    4579                            .dwattr $C$DW$454, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4580                            .dwattr $C$DW$454, DW_AT_decl_line(0x159)
    4581                            .dwattr $C$DW$454, DW_AT_decl_column(0x20)
    4582                    
    4583                    $C$DW$455       .dwtag  DW_TAG_member
    4584                            .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$39)
    4585                            .dwattr $C$DW$455, DW_AT_name("pOverrides")
    4586                            .dwattr $C$DW$455, DW_AT_TI_symbol_name("pOverrides")
    4587                            .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4588                            .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    4589                            .dwattr $C$DW$455, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4590                            .dwattr $C$DW$455, DW_AT_decl_line(0x15a)
    4591                            .dwattr $C$DW$455, DW_AT_decl_column(0x1e)
    4592                    
    4593                    $C$DW$456       .dwtag  DW_TAG_member
    4594                            .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$40)
    4595                            .dwattr $C$DW$456, DW_AT_name("pLoDivider")
    4596                            .dwattr $C$DW$456, DW_AT_TI_symbol_name("pLoDivider")
    4597                            .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4598                            .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    4599                            .dwattr $C$DW$456, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4600                            .dwattr $C$DW$456, DW_AT_decl_line(0x15b)
    4601                            .dwattr $C$DW$456, DW_AT_decl_column(0x1d)
    4602                    
    4603                    $C$DW$457       .dwtag  DW_TAG_member
    4604                            .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
    4605                            .dwattr $C$DW$457, DW_AT_name("rfFeModeBias")
    4606                            .dwattr $C$DW$457, DW_AT_TI_symbol_name("rfFeModeBias")
    4607                            .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4608                            .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    4609                            .dwattr $C$DW$457, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4610                            .dwattr $C$DW$457, DW_AT_decl_line(0x15c)
    4611                            .dwattr $C$DW$457, DW_AT_decl_column(0x1c)
    4612                    
    4613                    $C$DW$458       .dwtag  DW_TAG_member
    4614                            .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
    4615                            .dwattr $C$DW$458, DW_AT_name("phyId")
    4616                            .dwattr $C$DW$458, DW_AT_TI_symbol_name("phyId")
    4617                            .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4618                            .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    4619                            .dwattr $C$DW$458, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4620                            .dwattr $C$DW$458, DW_AT_decl_line(0x15d)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   85

    4621                            .dwattr $C$DW$458, DW_AT_decl_column(0x1c)
    4622                    
    4623                    $C$DW$459       .dwtag  DW_TAG_member
    4624                            .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
    4625                            .dwattr $C$DW$459, DW_AT_name("last")
    4626                            .dwattr $C$DW$459, DW_AT_TI_symbol_name("last")
    4627                            .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4628                            .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    4629                            .dwattr $C$DW$459, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4630                            .dwattr $C$DW$459, DW_AT_decl_line(0x15e)
    4631                            .dwattr $C$DW$459, DW_AT_decl_column(0x1c)
    4632                    
    4633                    $C$DW$460       .dwtag  DW_TAG_member
    4634                            .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$43)
    4635                            .dwattr $C$DW$460, DW_AT_name("pSetRE")
    4636                            .dwattr $C$DW$460, DW_AT_TI_symbol_name("pSetRE")
    4637                            .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4638                            .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    4639                            .dwattr $C$DW$460, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4640                            .dwattr $C$DW$460, DW_AT_decl_line(0x15f)
    4641                            .dwattr $C$DW$460, DW_AT_decl_column(0x1c)
    4642                    
    4643                    $C$DW$461       .dwtag  DW_TAG_member
    4644                            .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$44)
    4645                            .dwattr $C$DW$461, DW_AT_name("pAssertFP")
    4646                            .dwattr $C$DW$461, DW_AT_TI_symbol_name("pAssertFP")
    4647                            .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4648                            .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    4649                            .dwattr $C$DW$461, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4650                            .dwattr $C$DW$461, DW_AT_decl_line(0x160)
    4651                            .dwattr $C$DW$461, DW_AT_decl_column(0x1c)
    4652                    
    4653                    $C$DW$462       .dwtag  DW_TAG_member
    4654                            .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$47)
    4655                            .dwattr $C$DW$462, DW_AT_name("pAntSwitchFP")
    4656                            .dwattr $C$DW$462, DW_AT_TI_symbol_name("pAntSwitchFP")
    4657                            .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4658                            .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    4659                            .dwattr $C$DW$462, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4660                            .dwattr $C$DW$462, DW_AT_decl_line(0x161)
    4661                            .dwattr $C$DW$462, DW_AT_decl_column(0x1c)
    4662                    
    4663                    $C$DW$463       .dwtag  DW_TAG_member
    4664                            .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$48)
    4665                            .dwattr $C$DW$463, DW_AT_name("pAntPwrFP")
    4666                            .dwattr $C$DW$463, DW_AT_TI_symbol_name("pAntPwrFP")
    4667                            .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4668                            .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    4669                            .dwattr $C$DW$463, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4670                            .dwattr $C$DW$463, DW_AT_decl_line(0x162)
    4671                            .dwattr $C$DW$463, DW_AT_decl_column(0x1c)
    4672                    
    4673                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/Ap
    4674                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x154)
    4675                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   86

    4676                            .dwendtag $C$DW$T$49
    4677                    
    4678                    $C$DW$T$1061    .dwtag  DW_TAG_typedef
    4679                            .dwattr $C$DW$T$1061, DW_AT_name("macUserCfg_t")
    4680                            .dwattr $C$DW$T$1061, DW_AT_type(*$C$DW$T$49)
    4681                            .dwattr $C$DW$T$1061, DW_AT_language(DW_LANG_C)
    4682                            .dwattr $C$DW$T$1061, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/
    4683                            .dwattr $C$DW$T$1061, DW_AT_decl_line(0x163)
    4684                            .dwattr $C$DW$T$1061, DW_AT_decl_column(0x03)
    4685                    
    4686                    $C$DW$T$1062    .dwtag  DW_TAG_pointer_type
    4687                            .dwattr $C$DW$T$1062, DW_AT_type(*$C$DW$T$1061)
    4688                            .dwattr $C$DW$T$1062, DW_AT_address_class(0x20)
    4689                    
    4690                    
    4691                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4692                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    4693                    $C$DW$464       .dwtag  DW_TAG_member
    4694                            .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$10)
    4695                            .dwattr $C$DW$464, DW_AT_name("quot")
    4696                            .dwattr $C$DW$464, DW_AT_TI_symbol_name("quot")
    4697                            .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4698                            .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    4699                            .dwattr $C$DW$464, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4700                            .dwattr $C$DW$464, DW_AT_decl_line(0x5c)
    4701                            .dwattr $C$DW$464, DW_AT_decl_column(0x16)
    4702                    
    4703                    $C$DW$465       .dwtag  DW_TAG_member
    4704                            .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$10)
    4705                            .dwattr $C$DW$465, DW_AT_name("rem")
    4706                            .dwattr $C$DW$465, DW_AT_TI_symbol_name("rem")
    4707                            .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4708                            .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    4709                            .dwattr $C$DW$465, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4710                            .dwattr $C$DW$465, DW_AT_decl_line(0x5c)
    4711                            .dwattr $C$DW$465, DW_AT_decl_column(0x1c)
    4712                    
    4713                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
    4714                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x5c)
    4715                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    4716                            .dwendtag $C$DW$T$50
    4717                    
    4718                    $C$DW$T$1063    .dwtag  DW_TAG_typedef
    4719                            .dwattr $C$DW$T$1063, DW_AT_name("div_t")
    4720                            .dwattr $C$DW$T$1063, DW_AT_type(*$C$DW$T$50)
    4721                            .dwattr $C$DW$T$1063, DW_AT_language(DW_LANG_C)
    4722                            .dwattr $C$DW$T$1063, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/includ
    4723                            .dwattr $C$DW$T$1063, DW_AT_decl_line(0x5c)
    4724                            .dwattr $C$DW$T$1063, DW_AT_decl_column(0x23)
    4725                    
    4726                    
    4727                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4728                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x08)
    4729                    $C$DW$466       .dwtag  DW_TAG_member
    4730                            .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$10)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   87

    4731                            .dwattr $C$DW$466, DW_AT_name("quot")
    4732                            .dwattr $C$DW$466, DW_AT_TI_symbol_name("quot")
    4733                            .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4734                            .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    4735                            .dwattr $C$DW$466, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4736                            .dwattr $C$DW$466, DW_AT_decl_line(0x5e)
    4737                            .dwattr $C$DW$466, DW_AT_decl_column(0x16)
    4738                    
    4739                    $C$DW$467       .dwtag  DW_TAG_member
    4740                            .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$10)
    4741                            .dwattr $C$DW$467, DW_AT_name("rem")
    4742                            .dwattr $C$DW$467, DW_AT_TI_symbol_name("rem")
    4743                            .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4744                            .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    4745                            .dwattr $C$DW$467, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4746                            .dwattr $C$DW$467, DW_AT_decl_line(0x5e)
    4747                            .dwattr $C$DW$467, DW_AT_decl_column(0x1c)
    4748                    
    4749                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
    4750                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x5e)
    4751                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    4752                            .dwendtag $C$DW$T$51
    4753                    
    4754                    $C$DW$T$1064    .dwtag  DW_TAG_typedef
    4755                            .dwattr $C$DW$T$1064, DW_AT_name("ldiv_t")
    4756                            .dwattr $C$DW$T$1064, DW_AT_type(*$C$DW$T$51)
    4757                            .dwattr $C$DW$T$1064, DW_AT_language(DW_LANG_C)
    4758                            .dwattr $C$DW$T$1064, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/includ
    4759                            .dwattr $C$DW$T$1064, DW_AT_decl_line(0x5e)
    4760                            .dwattr $C$DW$T$1064, DW_AT_decl_column(0x23)
    4761                    
    4762                    
    4763                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    4764                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x10)
    4765                    $C$DW$468       .dwtag  DW_TAG_member
    4766                            .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$14)
    4767                            .dwattr $C$DW$468, DW_AT_name("quot")
    4768                            .dwattr $C$DW$468, DW_AT_TI_symbol_name("quot")
    4769                            .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4770                            .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    4771                            .dwattr $C$DW$468, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4772                            .dwattr $C$DW$468, DW_AT_decl_line(0x61)
    4773                            .dwattr $C$DW$468, DW_AT_decl_column(0x1c)
    4774                    
    4775                    $C$DW$469       .dwtag  DW_TAG_member
    4776                            .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$14)
    4777                            .dwattr $C$DW$469, DW_AT_name("rem")
    4778                            .dwattr $C$DW$469, DW_AT_TI_symbol_name("rem")
    4779                            .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4780                            .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    4781                            .dwattr $C$DW$469, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/s
    4782                            .dwattr $C$DW$469, DW_AT_decl_line(0x61)
    4783                            .dwattr $C$DW$469, DW_AT_decl_column(0x22)
    4784                    
    4785                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/include/
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   88

    4786                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x61)
    4787                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    4788                            .dwendtag $C$DW$T$52
    4789                    
    4790                    $C$DW$T$1065    .dwtag  DW_TAG_typedef
    4791                            .dwattr $C$DW$T$1065, DW_AT_name("lldiv_t")
    4792                            .dwattr $C$DW$T$1065, DW_AT_type(*$C$DW$T$52)
    4793                            .dwattr $C$DW$T$1065, DW_AT_language(DW_LANG_C)
    4794                            .dwattr $C$DW$T$1065, DW_AT_decl_file("C:/ti/ccsv7/tools/compiler/ti-cgt-arm_16.9.8.LTS/includ
    4795                            .dwattr $C$DW$T$1065, DW_AT_decl_line(0x61)
    4796                            .dwattr $C$DW$T$1065, DW_AT_decl_column(0x29)
    4797                    
    4798                    
    4799                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4800                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x08)
    4801                    $C$DW$470       .dwtag  DW_TAG_member
    4802                            .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$54)
    4803                            .dwattr $C$DW$470, DW_AT_name("pointerStack")
    4804                            .dwattr $C$DW$470, DW_AT_TI_symbol_name("pointerStack")
    4805                            .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4806                            .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    4807                            .dwattr $C$DW$470, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4808                            .dwattr $C$DW$470, DW_AT_decl_line(0x3f5)
    4809                            .dwattr $C$DW$470, DW_AT_decl_column(0x16)
    4810                    
    4811                    $C$DW$471       .dwtag  DW_TAG_member
    4812                            .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$55)
    4813                            .dwattr $C$DW$471, DW_AT_name("directAPI")
    4814                            .dwattr $C$DW$471, DW_AT_TI_symbol_name("directAPI")
    4815                            .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4816                            .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    4817                            .dwattr $C$DW$471, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4818                            .dwattr $C$DW$471, DW_AT_decl_line(0x3f6)
    4819                            .dwattr $C$DW$471, DW_AT_decl_column(0x15)
    4820                    
    4821                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4822                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x3f4)
    4823                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    4824                            .dwendtag $C$DW$T$56
    4825                    
    4826                    $C$DW$T$58      .dwtag  DW_TAG_typedef
    4827                            .dwattr $C$DW$T$58, DW_AT_name("icall_directAPIMsg_t")
    4828                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$56)
    4829                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4830                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4831                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x3f7)
    4832                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x03)
    4833                    
    4834                    
    4835                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    4836                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x14)
    4837                    $C$DW$472       .dwtag  DW_TAG_member
    4838                            .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$57)
    4839                            .dwattr $C$DW$472, DW_AT_name("hdr")
    4840                            .dwattr $C$DW$472, DW_AT_TI_symbol_name("hdr")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   89

    4841                            .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4842                            .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    4843                            .dwattr $C$DW$472, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4844                            .dwattr $C$DW$472, DW_AT_decl_line(0x3fb)
    4845                            .dwattr $C$DW$472, DW_AT_decl_column(0x10)
    4846                    
    4847                    $C$DW$473       .dwtag  DW_TAG_member
    4848                            .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$58)
    4849                            .dwattr $C$DW$473, DW_AT_name("msg")
    4850                            .dwattr $C$DW$473, DW_AT_TI_symbol_name("msg")
    4851                            .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4852                            .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    4853                            .dwattr $C$DW$473, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4854                            .dwattr $C$DW$473, DW_AT_decl_line(0x3fc)
    4855                            .dwattr $C$DW$473, DW_AT_decl_column(0x1a)
    4856                    
    4857                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4858                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x3fa)
    4859                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
    4860                            .dwendtag $C$DW$T$59
    4861                    
    4862                    $C$DW$T$1066    .dwtag  DW_TAG_typedef
    4863                            .dwattr $C$DW$T$1066, DW_AT_name("icallLiteMsg_t")
    4864                            .dwattr $C$DW$T$1066, DW_AT_type(*$C$DW$T$59)
    4865                            .dwattr $C$DW$T$1066, DW_AT_language(DW_LANG_C)
    4866                            .dwattr $C$DW$T$1066, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4867                            .dwattr $C$DW$T$1066, DW_AT_decl_line(0x3fd)
    4868                            .dwattr $C$DW$T$1066, DW_AT_decl_column(0x03)
    4869                    
    4870                    
    4871                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
    4872                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x0a)
    4873                    $C$DW$474       .dwtag  DW_TAG_member
    4874                            .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$482)
    4875                            .dwattr $C$DW$474, DW_AT_name("addr")
    4876                            .dwattr $C$DW$474, DW_AT_TI_symbol_name("addr")
    4877                            .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4878                            .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    4879                            .dwattr $C$DW$474, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4880                            .dwattr $C$DW$474, DW_AT_decl_line(0x55)
    4881                            .dwattr $C$DW$474, DW_AT_decl_column(0x05)
    4882                    
    4883                    $C$DW$475       .dwtag  DW_TAG_member
    4884                            .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
    4885                            .dwattr $C$DW$475, DW_AT_name("addrMode")
    4886                            .dwattr $C$DW$475, DW_AT_TI_symbol_name("addrMode")
    4887                            .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4888                            .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    4889                            .dwattr $C$DW$475, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/App
    4890                            .dwattr $C$DW$475, DW_AT_decl_line(0x56)
    4891                            .dwattr $C$DW$475, DW_AT_decl_column(0x13)
    4892                    
    4893                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/Ap
    4894                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x50)
    4895                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   90

    4896                            .dwendtag $C$DW$T$60
    4897                    
    4898                    $C$DW$T$376     .dwtag  DW_TAG_typedef
    4899                            .dwattr $C$DW$T$376, DW_AT_name("sAddr_t")
    4900                            .dwattr $C$DW$T$376, DW_AT_type(*$C$DW$T$60)
    4901                            .dwattr $C$DW$T$376, DW_AT_language(DW_LANG_C)
    4902                            .dwattr $C$DW$T$376, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/collector_cc1350lp/A
    4903                            .dwattr $C$DW$T$376, DW_AT_decl_line(0x57)
    4904                            .dwattr $C$DW$T$376, DW_AT_decl_column(0x03)
    4905                    
    4906                    $C$DW$T$432     .dwtag  DW_TAG_pointer_type
    4907                            .dwattr $C$DW$T$432, DW_AT_type(*$C$DW$T$376)
    4908                            .dwattr $C$DW$T$432, DW_AT_address_class(0x20)
    4909                    
    4910                    
    4911                    $C$DW$T$63      .dwtag  DW_TAG_structure_type
    4912                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x0a)
    4913                    $C$DW$476       .dwtag  DW_TAG_member
    4914                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$485)
    4915                            .dwattr $C$DW$476, DW_AT_name("addr")
    4916                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("addr")
    4917                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4918                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    4919                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4920                            .dwattr $C$DW$476, DW_AT_decl_line(0x139)
    4921                            .dwattr $C$DW$476, DW_AT_decl_column(0x05)
    4922                    
    4923                    $C$DW$477       .dwtag  DW_TAG_member
    4924                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$62)
    4925                            .dwattr $C$DW$477, DW_AT_name("addrMode")
    4926                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("addrMode")
    4927                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4928                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    4929                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4930                            .dwattr $C$DW$477, DW_AT_decl_line(0x13a)
    4931                            .dwattr $C$DW$477, DW_AT_decl_column(0x08)
    4932                    
    4933                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    4934                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x134)
    4935                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
    4936                            .dwendtag $C$DW$T$63
    4937                    
    4938                    $C$DW$T$1067    .dwtag  DW_TAG_typedef
    4939                            .dwattr $C$DW$T$1067, DW_AT_name("zAddrType_t")
    4940                            .dwattr $C$DW$T$1067, DW_AT_type(*$C$DW$T$63)
    4941                            .dwattr $C$DW$T$1067, DW_AT_language(DW_LANG_C)
    4942                            .dwattr $C$DW$T$1067, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    4943                            .dwattr $C$DW$T$1067, DW_AT_decl_line(0x13b)
    4944                            .dwattr $C$DW$T$1067, DW_AT_decl_column(0x03)
    4945                    
    4946                    
    4947                    $C$DW$T$66      .dwtag  DW_TAG_structure_type
    4948                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x0c)
    4949                    $C$DW$478       .dwtag  DW_TAG_member
    4950                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$61)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   91

    4951                            .dwattr $C$DW$478, DW_AT_name("txCounter")
    4952                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("txCounter")
    4953                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4954                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    4955                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4956                            .dwattr $C$DW$478, DW_AT_decl_line(0x198)
    4957                            .dwattr $C$DW$478, DW_AT_decl_column(0x0a)
    4958                    
    4959                    $C$DW$479       .dwtag  DW_TAG_member
    4960                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$61)
    4961                            .dwattr $C$DW$479, DW_AT_name("txCost")
    4962                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("txCost")
    4963                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4964                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    4965                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4966                            .dwattr $C$DW$479, DW_AT_decl_line(0x199)
    4967                            .dwattr $C$DW$479, DW_AT_decl_column(0x0a)
    4968                    
    4969                    $C$DW$480       .dwtag  DW_TAG_member
    4970                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$61)
    4971                            .dwattr $C$DW$480, DW_AT_name("rxLqi")
    4972                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("rxLqi")
    4973                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4974                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    4975                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4976                            .dwattr $C$DW$480, DW_AT_decl_line(0x19b)
    4977                            .dwattr $C$DW$480, DW_AT_decl_column(0x0a)
    4978                    
    4979                    $C$DW$481       .dwtag  DW_TAG_member
    4980                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$61)
    4981                            .dwattr $C$DW$481, DW_AT_name("inKeySeqNum")
    4982                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("inKeySeqNum")
    4983                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4984                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    4985                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4986                            .dwattr $C$DW$481, DW_AT_decl_line(0x19d)
    4987                            .dwattr $C$DW$481, DW_AT_decl_column(0x0a)
    4988                    
    4989                    $C$DW$482       .dwtag  DW_TAG_member
    4990                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$64)
    4991                            .dwattr $C$DW$482, DW_AT_name("inFrmCntr")
    4992                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("inFrmCntr")
    4993                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4994                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    4995                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    4996                            .dwattr $C$DW$482, DW_AT_decl_line(0x19e)
    4997                            .dwattr $C$DW$482, DW_AT_decl_column(0x0a)
    4998                    
    4999                    $C$DW$483       .dwtag  DW_TAG_member
    5000                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$65)
    5001                            .dwattr $C$DW$483, DW_AT_name("txFailure")
    5002                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("txFailure")
    5003                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5004                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5005                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   92

    5006                            .dwattr $C$DW$483, DW_AT_decl_line(0x19f)
    5007                            .dwattr $C$DW$483, DW_AT_decl_column(0x0a)
    5008                    
    5009                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5010                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x197)
    5011                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
    5012                            .dwendtag $C$DW$T$66
    5013                    
    5014                    $C$DW$T$1068    .dwtag  DW_TAG_typedef
    5015                            .dwattr $C$DW$T$1068, DW_AT_name("linkInfo_t")
    5016                            .dwattr $C$DW$T$1068, DW_AT_type(*$C$DW$T$66)
    5017                            .dwattr $C$DW$T$1068, DW_AT_language(DW_LANG_C)
    5018                            .dwattr $C$DW$T$1068, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5019                            .dwattr $C$DW$T$1068, DW_AT_decl_line(0x1a0)
    5020                            .dwattr $C$DW$T$1068, DW_AT_decl_column(0x03)
    5021                    
    5022                    
    5023                    $C$DW$T$67      .dwtag  DW_TAG_structure_type
    5024                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x02)
    5025                    $C$DW$484       .dwtag  DW_TAG_member
    5026                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$61)
    5027                            .dwattr $C$DW$484, DW_AT_name("event")
    5028                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("event")
    5029                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5030                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5031                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5032                            .dwattr $C$DW$484, DW_AT_decl_line(0x79)
    5033                            .dwattr $C$DW$484, DW_AT_decl_column(0x0a)
    5034                    
    5035                    $C$DW$485       .dwtag  DW_TAG_member
    5036                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$61)
    5037                            .dwattr $C$DW$485, DW_AT_name("status")
    5038                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("status")
    5039                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5040                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5041                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    5042                            .dwattr $C$DW$485, DW_AT_decl_line(0x7a)
    5043                            .dwattr $C$DW$485, DW_AT_decl_column(0x0a)
    5044                    
    5045                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    5046                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x78)
    5047                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
    5048                            .dwendtag $C$DW$T$67
    5049                    
    5050                    $C$DW$T$1069    .dwtag  DW_TAG_typedef
    5051                            .dwattr $C$DW$T$1069, DW_AT_name("osal_event_hdr_t")
    5052                            .dwattr $C$DW$T$1069, DW_AT_type(*$C$DW$T$67)
    5053                            .dwattr $C$DW$T$1069, DW_AT_language(DW_LANG_C)
    5054                            .dwattr $C$DW$T$1069, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154s
    5055                            .dwattr $C$DW$T$1069, DW_AT_decl_line(0x7b)
    5056                            .dwattr $C$DW$T$1069, DW_AT_decl_column(0x03)
    5057                    
    5058                    
    5059                    $C$DW$T$99      .dwtag  DW_TAG_structure_type
    5060                            .dwattr $C$DW$T$99, DW_AT_byte_size(0x4c)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   93

    5061                    $C$DW$486       .dwtag  DW_TAG_member
    5062                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$70)
    5063                            .dwattr $C$DW$486, DW_AT_name("Crc32")
    5064                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("Crc32")
    5065                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5066                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5067                            .dwattr $C$DW$486, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5068                            .dwattr $C$DW$486, DW_AT_decl_line(0x76)
    5069                            .dwattr $C$DW$486, DW_AT_decl_column(0x25)
    5070                    
    5071                    $C$DW$487       .dwtag  DW_TAG_member
    5072                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$73)
    5073                            .dwattr $C$DW$487, DW_AT_name("FlashGetSize")
    5074                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("FlashGetSize")
    5075                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5076                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5077                            .dwattr $C$DW$487, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5078                            .dwattr $C$DW$487, DW_AT_decl_line(0x77)
    5079                            .dwattr $C$DW$487, DW_AT_decl_column(0x25)
    5080                    
    5081                    $C$DW$488       .dwtag  DW_TAG_member
    5082                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$74)
    5083                            .dwattr $C$DW$488, DW_AT_name("GetChipId")
    5084                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("GetChipId")
    5085                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5086                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5087                            .dwattr $C$DW$488, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5088                            .dwattr $C$DW$488, DW_AT_decl_line(0x78)
    5089                            .dwattr $C$DW$488, DW_AT_decl_column(0x25)
    5090                    
    5091                    $C$DW$489       .dwtag  DW_TAG_member
    5092                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$77)
    5093                            .dwattr $C$DW$489, DW_AT_name("ReservedLocation1")
    5094                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("ReservedLocation1")
    5095                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5096                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5097                            .dwattr $C$DW$489, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5098                            .dwattr $C$DW$489, DW_AT_decl_line(0x79)
    5099                            .dwattr $C$DW$489, DW_AT_decl_column(0x25)
    5100                    
    5101                    $C$DW$490       .dwtag  DW_TAG_member
    5102                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$78)
    5103                            .dwattr $C$DW$490, DW_AT_name("ReservedLocation2")
    5104                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("ReservedLocation2")
    5105                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5106                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5107                            .dwattr $C$DW$490, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5108                            .dwattr $C$DW$490, DW_AT_decl_line(0x7a)
    5109                            .dwattr $C$DW$490, DW_AT_decl_column(0x25)
    5110                    
    5111                    $C$DW$491       .dwtag  DW_TAG_member
    5112                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$79)
    5113                            .dwattr $C$DW$491, DW_AT_name("ReservedLocation3")
    5114                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("ReservedLocation3")
    5115                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   94

    5116                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5117                            .dwattr $C$DW$491, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5118                            .dwattr $C$DW$491, DW_AT_decl_line(0x7b)
    5119                            .dwattr $C$DW$491, DW_AT_decl_column(0x25)
    5120                    
    5121                    $C$DW$492       .dwtag  DW_TAG_member
    5122                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$80)
    5123                            .dwattr $C$DW$492, DW_AT_name("ResetDevice")
    5124                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("ResetDevice")
    5125                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5126                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5127                            .dwattr $C$DW$492, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5128                            .dwattr $C$DW$492, DW_AT_decl_line(0x7c)
    5129                            .dwattr $C$DW$492, DW_AT_decl_column(0x25)
    5130                    
    5131                    $C$DW$493       .dwtag  DW_TAG_member
    5132                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$85)
    5133                            .dwattr $C$DW$493, DW_AT_name("Fletcher32")
    5134                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("Fletcher32")
    5135                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5136                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5137                            .dwattr $C$DW$493, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5138                            .dwattr $C$DW$493, DW_AT_decl_line(0x7d)
    5139                            .dwattr $C$DW$493, DW_AT_decl_column(0x25)
    5140                    
    5141                    $C$DW$494       .dwtag  DW_TAG_member
    5142                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$88)
    5143                            .dwattr $C$DW$494, DW_AT_name("MinValue")
    5144                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("MinValue")
    5145                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5146                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5147                            .dwattr $C$DW$494, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5148                            .dwattr $C$DW$494, DW_AT_decl_line(0x7e)
    5149                            .dwattr $C$DW$494, DW_AT_decl_column(0x25)
    5150                    
    5151                    $C$DW$495       .dwtag  DW_TAG_member
    5152                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$89)
    5153                            .dwattr $C$DW$495, DW_AT_name("MaxValue")
    5154                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("MaxValue")
    5155                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5156                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5157                            .dwattr $C$DW$495, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5158                            .dwattr $C$DW$495, DW_AT_decl_line(0x7f)
    5159                            .dwattr $C$DW$495, DW_AT_decl_column(0x25)
    5160                    
    5161                    $C$DW$496       .dwtag  DW_TAG_member
    5162                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$90)
    5163                            .dwattr $C$DW$496, DW_AT_name("MeanValue")
    5164                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("MeanValue")
    5165                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5166                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5167                            .dwattr $C$DW$496, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5168                            .dwattr $C$DW$496, DW_AT_decl_line(0x80)
    5169                            .dwattr $C$DW$496, DW_AT_decl_column(0x25)
    5170                    
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   95

    5171                    $C$DW$497       .dwtag  DW_TAG_member
    5172                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$91)
    5173                            .dwattr $C$DW$497, DW_AT_name("StandDeviationValue")
    5174                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("StandDeviationValue")
    5175                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5176                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5177                            .dwattr $C$DW$497, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5178                            .dwattr $C$DW$497, DW_AT_decl_line(0x81)
    5179                            .dwattr $C$DW$497, DW_AT_decl_column(0x25)
    5180                    
    5181                    $C$DW$498       .dwtag  DW_TAG_member
    5182                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$92)
    5183                            .dwattr $C$DW$498, DW_AT_name("ReservedLocation4")
    5184                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("ReservedLocation4")
    5185                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5186                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5187                            .dwattr $C$DW$498, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5188                            .dwattr $C$DW$498, DW_AT_decl_line(0x82)
    5189                            .dwattr $C$DW$498, DW_AT_decl_column(0x25)
    5190                    
    5191                    $C$DW$499       .dwtag  DW_TAG_member
    5192                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$93)
    5193                            .dwattr $C$DW$499, DW_AT_name("ReservedLocation5")
    5194                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("ReservedLocation5")
    5195                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    5196                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5197                            .dwattr $C$DW$499, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5198                            .dwattr $C$DW$499, DW_AT_decl_line(0x83)
    5199                            .dwattr $C$DW$499, DW_AT_decl_column(0x25)
    5200                    
    5201                    $C$DW$500       .dwtag  DW_TAG_member
    5202                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$94)
    5203                            .dwattr $C$DW$500, DW_AT_name("HFSourceSafeSwitch")
    5204                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
    5205                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    5206                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5207                            .dwattr $C$DW$500, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5208                            .dwattr $C$DW$500, DW_AT_decl_line(0x84)
    5209                            .dwattr $C$DW$500, DW_AT_decl_column(0x25)
    5210                    
    5211                    $C$DW$501       .dwtag  DW_TAG_member
    5212                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$95)
    5213                            .dwattr $C$DW$501, DW_AT_name("SelectCompAInput")
    5214                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("SelectCompAInput")
    5215                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    5216                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5217                            .dwattr $C$DW$501, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5218                            .dwattr $C$DW$501, DW_AT_decl_line(0x85)
    5219                            .dwattr $C$DW$501, DW_AT_decl_column(0x25)
    5220                    
    5221                    $C$DW$502       .dwtag  DW_TAG_member
    5222                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$96)
    5223                            .dwattr $C$DW$502, DW_AT_name("SelectCompARef")
    5224                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("SelectCompARef")
    5225                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   96

    5226                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5227                            .dwattr $C$DW$502, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5228                            .dwattr $C$DW$502, DW_AT_decl_line(0x86)
    5229                            .dwattr $C$DW$502, DW_AT_decl_column(0x25)
    5230                    
    5231                    $C$DW$503       .dwtag  DW_TAG_member
    5232                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$97)
    5233                            .dwattr $C$DW$503, DW_AT_name("SelectADCCompBInput")
    5234                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("SelectADCCompBInput")
    5235                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    5236                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    5237                            .dwattr $C$DW$503, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5238                            .dwattr $C$DW$503, DW_AT_decl_line(0x87)
    5239                            .dwattr $C$DW$503, DW_AT_decl_column(0x25)
    5240                    
    5241                    $C$DW$504       .dwtag  DW_TAG_member
    5242                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$98)
    5243                            .dwattr $C$DW$504, DW_AT_name("SelectCompBRef")
    5244                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("SelectCompBRef")
    5245                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    5246                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    5247                            .dwattr $C$DW$504, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5248                            .dwattr $C$DW$504, DW_AT_decl_line(0x88)
    5249                            .dwattr $C$DW$504, DW_AT_decl_column(0x25)
    5250                    
    5251                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
    5252                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x75)
    5253                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x01)
    5254                            .dwendtag $C$DW$T$99
    5255                    
    5256                    $C$DW$T$1070    .dwtag  DW_TAG_typedef
    5257                            .dwattr $C$DW$T$1070, DW_AT_name("HARD_API_T")
    5258                            .dwattr $C$DW$T$1070, DW_AT_type(*$C$DW$T$99)
    5259                            .dwattr $C$DW$T$1070, DW_AT_language(DW_LANG_C)
    5260                            .dwattr $C$DW$T$1070, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\device
    5261                            .dwattr $C$DW$T$1070, DW_AT_decl_line(0x89)
    5262                            .dwattr $C$DW$T$1070, DW_AT_decl_column(0x03)
    5263                    
    5264                    
    5265                    $C$DW$T$102     .dwtag  DW_TAG_structure_type
    5266                            .dwattr $C$DW$T$102, DW_AT_byte_size(0x0a)
    5267                    $C$DW$505       .dwtag  DW_TAG_member
    5268                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$486)
    5269                            .dwattr $C$DW$505, DW_AT_name("addr")
    5270                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("addr")
    5271                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5272                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    5273                            .dwattr $C$DW$505, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\App
    5274                            .dwattr $C$DW$505, DW_AT_decl_line(0x4db)
    5275                            .dwattr $C$DW$505, DW_AT_decl_column(0x07)
    5276                    
    5277                    $C$DW$506       .dwtag  DW_TAG_member
    5278                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$101)
    5279                            .dwattr $C$DW$506, DW_AT_name("addrMode")
    5280                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("addrMode")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   97

    5281                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5282                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    5283                            .dwattr $C$DW$506, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\App
    5284                            .dwattr $C$DW$506, DW_AT_decl_line(0x4de)
    5285                            .dwattr $C$DW$506, DW_AT_decl_column(0x17)
    5286                    
    5287                            .dwattr $C$DW$T$102, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\A
    5288                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x4d0)
    5289                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x01)
    5290                            .dwendtag $C$DW$T$102
    5291                    
    5292                    $C$DW$T$721     .dwtag  DW_TAG_typedef
    5293                            .dwattr $C$DW$T$721, DW_AT_name("ApiMac_sAddr_t")
    5294                            .dwattr $C$DW$T$721, DW_AT_type(*$C$DW$T$102)
    5295                            .dwattr $C$DW$T$721, DW_AT_language(DW_LANG_C)
    5296                            .dwattr $C$DW$T$721, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\A
    5297                            .dwattr $C$DW$T$721, DW_AT_decl_line(0x4df)
    5298                            .dwattr $C$DW$T$721, DW_AT_decl_column(0x03)
    5299                    
    5300                    
    5301                    $C$DW$T$103     .dwtag  DW_TAG_structure_type
    5302                            .dwattr $C$DW$T$103, DW_AT_byte_size(0x08)
    5303                    $C$DW$507       .dwtag  DW_TAG_member
    5304                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$23)
    5305                            .dwattr $C$DW$507, DW_AT_name("frameCounter")
    5306                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("frameCounter")
    5307                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5308                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    5309                            .dwattr $C$DW$507, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\App
    5310                            .dwattr $C$DW$507, DW_AT_decl_line(0x575)
    5311                            .dwattr $C$DW$507, DW_AT_decl_column(0x1a)
    5312                    
    5313                    $C$DW$508       .dwtag  DW_TAG_member
    5314                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$81)
    5315                            .dwattr $C$DW$508, DW_AT_name("keyIdx")
    5316                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("keyIdx")
    5317                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5318                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    5319                            .dwattr $C$DW$508, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\App
    5320                            .dwattr $C$DW$508, DW_AT_decl_line(0x576)
    5321                            .dwattr $C$DW$508, DW_AT_decl_column(0x1a)
    5322                    
    5323                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\A
    5324                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x574)
    5325                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x01)
    5326                            .dwendtag $C$DW$T$103
    5327                    
    5328                    $C$DW$T$781     .dwtag  DW_TAG_typedef
    5329                            .dwattr $C$DW$T$781, DW_AT_name("ApiMac_frameCntr_t")
    5330                            .dwattr $C$DW$T$781, DW_AT_type(*$C$DW$T$103)
    5331                            .dwattr $C$DW$T$781, DW_AT_language(DW_LANG_C)
    5332                            .dwattr $C$DW$T$781, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\A
    5333                            .dwattr $C$DW$T$781, DW_AT_decl_line(0x577)
    5334                            .dwattr $C$DW$T$781, DW_AT_decl_column(0x03)
    5335                    
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   98

    5336                    $C$DW$T$782     .dwtag  DW_TAG_pointer_type
    5337                            .dwattr $C$DW$T$782, DW_AT_type(*$C$DW$T$781)
    5338                            .dwattr $C$DW$T$782, DW_AT_address_class(0x20)
    5339                    
    5340                    
    5341                    $C$DW$T$107     .dwtag  DW_TAG_structure_type
    5342                            .dwattr $C$DW$T$107, DW_AT_byte_size(0x40)
    5343                    $C$DW$509       .dwtag  DW_TAG_member
    5344                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$105)
    5345                            .dwattr $C$DW$509, DW_AT_name("beaconType")
    5346                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("beaconType")
    5347                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5348                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    5349                            .dwattr $C$DW$509, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\App
    5350                            .dwattr $C$DW$509, DW_AT_decl_line(0x886)
    5351                            .dwattr $C$DW$509, DW_AT_decl_column(0x19)
    5352                    
    5353                    $C$DW$510       .dwtag  DW_TAG_member
    5354                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$19)
    5355                            .dwattr $C$DW$510, DW_AT_name("bsn")
    5356                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("bsn")
    5357                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5358                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    5359                            .dwattr $C$DW$510, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\App
    5360                            .dwattr $C$DW$510, DW_AT_decl_line(0x888)
    5361                            .dwattr $C$DW$510, DW_AT_decl_column(0x0d)
    5362                    
    5363                    $C$DW$511       .dwtag  DW_TAG_member
    5364                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$106)
    5365                            .dwattr $C$DW$511, DW_AT_name("panDesc")
    5366                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("panDesc")
    5367                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5368                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    5369                            .dwattr $C$DW$511, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\App
    5370                            .dwattr $C$DW$511, DW_AT_decl_line(0x88a)
    5371                            .dwattr $C$DW$511, DW_AT_decl_column(0x16)
    5372                    
    5373                    $C$DW$512       .dwtag  DW_TAG_member
    5374                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$489)
    5375                            .dwattr $C$DW$512, DW_AT_name("beaconData")
    5376                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("beaconData")
    5377                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    5378                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    5379                            .dwattr $C$DW$512, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\App
    5380                            .dwattr $C$DW$512, DW_AT_decl_line(0x895)
    5381                            .dwattr $C$DW$512, DW_AT_decl_column(0x07)
    5382                    
    5383                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\A
    5384                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x884)
    5385                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x01)
    5386                            .dwendtag $C$DW$T$107
    5387                    
    5388                    $C$DW$T$635     .dwtag  DW_TAG_typedef
    5389                            .dwattr $C$DW$T$635, DW_AT_name("ApiMac_mlmeBeaconNotifyInd_t")
    5390                            .dwattr $C$DW$T$635, DW_AT_type(*$C$DW$T$107)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{0ED9912E-F216-4B11-AF33-9BA1337BDC1F} PAGE   99

    5391                            .dwattr $C$DW$T$635, DW_AT_language(DW_LANG_C)
    5392                            .dwattr $C$DW$T$635, DW_AT_decl_file("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\A
    5393                            .dwattr $C$DW$T$635, DW_AT_decl_line(0x896)
    5394                            .dwattr $C$DW$T$635, DW_AT_decl_column(0x03)
    5395                    
    5396                    $C$DW$T$636     .dwtag  DW_TAG_pointer_type
    5397                            .dwattr $C$DW$T$636, DW_AT_type(*$C$DW$T$635)
    5398                            .dwattr $C$DW$T$636, DW_AT_address_class(0x20)
    5399                    
    5400                    
    5401                    $C$DW$T$108     .dwtag  DW_TAG_structure_type
    5402                            .dwattr $C$DW$T$108, DW_AT_byte_size(0x08)
    5403                    $C$DW$513       .dwtag  DW_TAG_member
    5404                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$40)
    5405                            .dwattr $C$DW$513, DW_AT_name("pCurrEntry")
    5406                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("pCurrEntry")
    5407                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5408                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    5409                            .dwattr $C$DW$513, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5410                            .dwattr $C$DW$513, DW_AT_decl_line(0x41)
    5411                            .dwattr $C$DW$513, DW_AT_decl_column(0x0d)
    5412                    
    5413                    $C$DW$514       .dwtag  DW_TAG_member
    5414                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$40)
    5415                            .dwattr $C$DW$514, DW_AT_name("pLastEntry")
    5416                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("pLastEntry")
    5417                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5418                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    5419                            .dwattr $C$DW$514, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\c
    5420                            .dwattr $C$DW$514, DW_AT_decl_line(0x42)
    5421                            .dwattr $C$DW$514, DW_AT_decl_column(0x0d)
    5422                    
    5423                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    5424                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x40)
    5425                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x10)
    5426                            .dwendtag $C$DW$T$108
    5427                    
    5428                    $C$DW$T$877     .dwtag  DW_TAG_typedef
    5429                            .dwattr $C$DW$T$877, DW_AT_name("dataQueue_t")
    5430                            .dwattr $C$DW$T$877, DW_AT_type(*$C$DW$T$108)
    5431                            .dwattr $C$DW$T$877, DW_AT_language(DW_LANG_C)
    5432                            .dwattr $C$DW$T$877, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices
    5433                            .dwattr $C$DW$T$877, DW_AT_decl_line(0x43)
    5434                            .dwattr $C$DW$T$877, DW_AT_decl_column(0x03)
    5435                    
    5436                    $C$DW$T$878     .dwtag  DW_TAG_pointer_type
    5437                            .dwattr $C$DW$T$878, DW_AT_type(*$C$DW$T$877)
    5438                            .dwattr $C$DW$T$878, DW_AT_address_class(0x20)
    5439                    
    5440                    
    5441                    $C$DW$T$109     .dwtag  DW_TAG_structure_type
    5442                            .dwattr $C$DW$T$109, DW_AT_byte_size(0x01)
    5443                    $C$DW$515       .dwtag  DW_TAG_member
    5444                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$19)
    5445                            .dwattr $C$DW$515, DW_AT_name("triggerType")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:09 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
