TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{2774211C-A916-4652-B48E-C4C42D0C68A9} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Thu Nov 22 09:17:20 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/HAL/target/pwrmon.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\collector_cc1350lp\colle
      13                    
      14                    ;*****************************************************************************

     128 00000006 B120              CBZ       A1, ||$C$L1||         ; []  ; [ORIG 16-BIT INS]
     129                            ; BRANCHCC OCCURS {||$C$L1||}    ; [] |74| 
     130                    ;* --------------------------------------------------------------------------*
     131                            .dwpsn  file "C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/cc13x0/driverlib/aon_ba
     132 00000008 6A90              LDR       A1, [A3, #40]         ; [DPU_3_PIPE] |191|  ; [ORIG 16-BIT INS]
     133                            .dwpsn  file "../Application/MAC/HAL/target/pwrmon.c",line 74,column 5,is_stmt,isa 1
     134 0000000a 4281              CMP       A2, A1                ; [DPU_3_PIPE] |74|  ; [ORIG 16-BIT INS]
     135 0000000c BF88              IT        HI                    ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
     136                            .dwpsn  file "../Application/MAC/HAL/target/pwrmon.c",line 77,column 9,is_stmt,isa 1
     137 0000000e 2000              MOVHI     A1, #0                ; [DPU_3_PIPE] |77|  ; [ORIG 16-BIT INS]
     138 00000010 D800              BHI       ||$C$L2||             ; [DPU_3_PIPE] |77|  ; [ORIG 16-BIT INS]
     139                            ; BRANCHCC OCCURS {||$C$L2||}    ; [] |77| 
     140                    ;* --------------------------------------------------------------------------*
     141 00000012           ||$C$L1||:    
     142                            .dwpsn  file "../Application/MAC/HAL/target/pwrmon.c",line 80,column 5,is_stmt,isa 1
     143 00000012 2001              MOVS      A1, #1                ; [DPU_3_PIPE] |80|  ; [ORIG 16-BIT INS]
     144                    ;* --------------------------------------------------------------------------*
     145                    ||$C$L2||:    
     146                    $C$DW$7 .dwtag  DW_TAG_TI_branch
     147                            .dwattr $C$DW$7, DW_AT_low_pc(0x00)
     148                            .dwattr $C$DW$7, DW_AT_TI_return
     149                    
     150 00000014 4770              BX        LR                    ; [DPU_3_PIPE]  ; [ORIG 16-BIT INS]
     151                            ; BRANCH OCCURS                  ; [] 
     152                            .dwattr $C$DW$3, DW_AT_TI_end_file("../Application/MAC/HAL/target/pwrmon.c")
     153                            .dwattr $C$DW$3, DW_AT_TI_end_line(0x51)
     154                            .dwattr $C$DW$3, DW_AT_TI_end_column(0x01)
     155                            .dwendentry
     156                            .dwendtag $C$DW$3
     157                    
     158                    ;******************************************************************************
     159                    ;* CONSTANT TABLE                                                             *
     160                    ;******************************************************************************
     161 00000008                   .sect   ".text:AONBatMonEnable"
     162                            .align  4
     163 00000008 40095000  ||$C$CON1||:    .bits   1074352128,32
     164                    ;******************************************************************************
     165                    ;* CONSTANT TABLE                                                             *
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{2774211C-A916-4652-B48E-C4C42D0C68A9} PAGE    4

     166                    ;******************************************************************************
     167 00000016                   .sect   ".text:PWRMON_check"
     168                            .align  4
     169 00000016 500046C0  ||$C$CON2||:    .bits   1074352128,32
         0000001a 00004009 
     170                    
     171                    ;******************************************************************************
     172                    ;* BUILD ATTRIBUTES                                                           *
     173                    ;******************************************************************************
     174                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     175                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     176                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     177                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     178                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     179                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(0)
     180                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(0)
     181                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     182                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(2)
     183                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     184                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     185                    
     186                    ;******************************************************************************
     187                    ;* TYPE INFORMATION                                                           *
     188                    ;******************************************************************************
     189                    
     190                    $C$DW$T$60      .dwtag  DW_TAG_structure_type
     191                            .dwattr $C$DW$T$60, DW_AT_byte_size(0x4c)
     192                    $C$DW$8 .dwtag  DW_TAG_member
     193                            .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$24)
     194                            .dwattr $C$DW$8, DW_AT_name("Crc32")
     195                            .dwattr $C$DW$8, DW_AT_TI_symbol_name("Crc32")
     196                            .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     197                            .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     198                            .dwattr $C$DW$8, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc1
     199                            .dwattr $C$DW$8, DW_AT_decl_line(0x76)
     200                            .dwattr $C$DW$8, DW_AT_decl_column(0x25)
     201                    
     202                    $C$DW$9 .dwtag  DW_TAG_member
     203                            .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$27)
     204                            .dwattr $C$DW$9, DW_AT_name("FlashGetSize")
     205                            .dwattr $C$DW$9, DW_AT_TI_symbol_name("FlashGetSize")
     206                            .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     207                            .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     208                            .dwattr $C$DW$9, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc1
     209                            .dwattr $C$DW$9, DW_AT_decl_line(0x77)
     210                            .dwattr $C$DW$9, DW_AT_decl_column(0x25)
     211                    
     212                    $C$DW$10        .dwtag  DW_TAG_member
     213                            .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$28)
     214                            .dwattr $C$DW$10, DW_AT_name("GetChipId")
     215                            .dwattr $C$DW$10, DW_AT_TI_symbol_name("GetChipId")
     216                            .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     217                            .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     218                            .dwattr $C$DW$10, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     219                            .dwattr $C$DW$10, DW_AT_decl_line(0x78)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{2774211C-A916-4652-B48E-C4C42D0C68A9} PAGE    5

     220                            .dwattr $C$DW$10, DW_AT_decl_column(0x25)
     221                    
     222                    $C$DW$11        .dwtag  DW_TAG_member
     223                            .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$31)
     224                            .dwattr $C$DW$11, DW_AT_name("ReservedLocation1")
     225                            .dwattr $C$DW$11, DW_AT_TI_symbol_name("ReservedLocation1")
     226                            .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     227                            .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     228                            .dwattr $C$DW$11, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     229                            .dwattr $C$DW$11, DW_AT_decl_line(0x79)
     230                            .dwattr $C$DW$11, DW_AT_decl_column(0x25)
     231                    
     232                    $C$DW$12        .dwtag  DW_TAG_member
     233                            .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$32)
     234                            .dwattr $C$DW$12, DW_AT_name("ReservedLocation2")
     235                            .dwattr $C$DW$12, DW_AT_TI_symbol_name("ReservedLocation2")
     236                            .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     237                            .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     238                            .dwattr $C$DW$12, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     239                            .dwattr $C$DW$12, DW_AT_decl_line(0x7a)
     240                            .dwattr $C$DW$12, DW_AT_decl_column(0x25)
     241                    
     242                    $C$DW$13        .dwtag  DW_TAG_member
     243                            .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$33)
     244                            .dwattr $C$DW$13, DW_AT_name("ReservedLocation3")
     245                            .dwattr $C$DW$13, DW_AT_TI_symbol_name("ReservedLocation3")
     246                            .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     247                            .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     248                            .dwattr $C$DW$13, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     249                            .dwattr $C$DW$13, DW_AT_decl_line(0x7b)
     250                            .dwattr $C$DW$13, DW_AT_decl_column(0x25)
     251                    
     252                    $C$DW$14        .dwtag  DW_TAG_member
     253                            .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$36)
     254                            .dwattr $C$DW$14, DW_AT_name("ResetDevice")
     255                            .dwattr $C$DW$14, DW_AT_TI_symbol_name("ResetDevice")
     256                            .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     257                            .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     258                            .dwattr $C$DW$14, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     259                            .dwattr $C$DW$14, DW_AT_decl_line(0x7c)
     260                            .dwattr $C$DW$14, DW_AT_decl_column(0x25)
     261                    
     262                    $C$DW$15        .dwtag  DW_TAG_member
     263                            .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$41)
     264                            .dwattr $C$DW$15, DW_AT_name("Fletcher32")
     265                            .dwattr $C$DW$15, DW_AT_TI_symbol_name("Fletcher32")
     266                            .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     267                            .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     268                            .dwattr $C$DW$15, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     269                            .dwattr $C$DW$15, DW_AT_decl_line(0x7d)
     270                            .dwattr $C$DW$15, DW_AT_decl_column(0x25)
     271                    
     272                    $C$DW$16        .dwtag  DW_TAG_member
     273                            .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$45)
     274                            .dwattr $C$DW$16, DW_AT_name("MinValue")
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{2774211C-A916-4652-B48E-C4C42D0C68A9} PAGE    6

     275                            .dwattr $C$DW$16, DW_AT_TI_symbol_name("MinValue")
     276                            .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     277                            .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     278                            .dwattr $C$DW$16, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     279                            .dwattr $C$DW$16, DW_AT_decl_line(0x7e)
     280                            .dwattr $C$DW$16, DW_AT_decl_column(0x25)
     281                    
     282                    $C$DW$17        .dwtag  DW_TAG_member
     283                            .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$46)
     284                            .dwattr $C$DW$17, DW_AT_name("MaxValue")
     285                            .dwattr $C$DW$17, DW_AT_TI_symbol_name("MaxValue")
     286                            .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     287                            .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     288                            .dwattr $C$DW$17, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     289                            .dwattr $C$DW$17, DW_AT_decl_line(0x7f)
     290                            .dwattr $C$DW$17, DW_AT_decl_column(0x25)
     291                    
     292                    $C$DW$18        .dwtag  DW_TAG_member
     293                            .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$47)
     294                            .dwattr $C$DW$18, DW_AT_name("MeanValue")
     295                            .dwattr $C$DW$18, DW_AT_TI_symbol_name("MeanValue")
     296                            .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     297                            .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     298                            .dwattr $C$DW$18, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     299                            .dwattr $C$DW$18, DW_AT_decl_line(0x80)
     300                            .dwattr $C$DW$18, DW_AT_decl_column(0x25)
     301                    
     302                    $C$DW$19        .dwtag  DW_TAG_member
     303                            .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$48)
     304                            .dwattr $C$DW$19, DW_AT_name("StandDeviationValue")
     305                            .dwattr $C$DW$19, DW_AT_TI_symbol_name("StandDeviationValue")
     306                            .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     307                            .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     308                            .dwattr $C$DW$19, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     309                            .dwattr $C$DW$19, DW_AT_decl_line(0x81)
     310                            .dwattr $C$DW$19, DW_AT_decl_column(0x25)
     311                    
     312                    $C$DW$20        .dwtag  DW_TAG_member
     313                            .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$51)
     314                            .dwattr $C$DW$20, DW_AT_name("ReservedLocation4")
     315                            .dwattr $C$DW$20, DW_AT_TI_symbol_name("ReservedLocation4")
     316                            .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     317                            .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     318                            .dwattr $C$DW$20, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     319                            .dwattr $C$DW$20, DW_AT_decl_line(0x82)
     320                            .dwattr $C$DW$20, DW_AT_decl_column(0x25)
     321                    
     322                    $C$DW$21        .dwtag  DW_TAG_member
     323                            .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$52)
     324                            .dwattr $C$DW$21, DW_AT_name("ReservedLocation5")
     325                            .dwattr $C$DW$21, DW_AT_TI_symbol_name("ReservedLocation5")
     326                            .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     327                            .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     328                            .dwattr $C$DW$21, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     329                            .dwattr $C$DW$21, DW_AT_decl_line(0x83)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{2774211C-A916-4652-B48E-C4C42D0C68A9} PAGE    7

     330                            .dwattr $C$DW$21, DW_AT_decl_column(0x25)
     331                    
     332                    $C$DW$22        .dwtag  DW_TAG_member
     333                            .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$53)
     334                            .dwattr $C$DW$22, DW_AT_name("HFSourceSafeSwitch")
     335                            .dwattr $C$DW$22, DW_AT_TI_symbol_name("HFSourceSafeSwitch")
     336                            .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     337                            .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     338                            .dwattr $C$DW$22, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     339                            .dwattr $C$DW$22, DW_AT_decl_line(0x84)
     340                            .dwattr $C$DW$22, DW_AT_decl_column(0x25)
     341                    
     342                    $C$DW$23        .dwtag  DW_TAG_member
     343                            .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$56)
     344                            .dwattr $C$DW$23, DW_AT_name("SelectCompAInput")
     345                            .dwattr $C$DW$23, DW_AT_TI_symbol_name("SelectCompAInput")
     346                            .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     347                            .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     348                            .dwattr $C$DW$23, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     349                            .dwattr $C$DW$23, DW_AT_decl_line(0x85)
     350                            .dwattr $C$DW$23, DW_AT_decl_column(0x25)
     351                    
     352                    $C$DW$24        .dwtag  DW_TAG_member
     353                            .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$57)
     354                            .dwattr $C$DW$24, DW_AT_name("SelectCompARef")
     355                            .dwattr $C$DW$24, DW_AT_TI_symbol_name("SelectCompARef")
     356                            .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     357                            .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     358                            .dwattr $C$DW$24, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     359                            .dwattr $C$DW$24, DW_AT_decl_line(0x86)
     360                            .dwattr $C$DW$24, DW_AT_decl_column(0x25)
     361                    
     362                    $C$DW$25        .dwtag  DW_TAG_member
     363                            .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$58)
     364                            .dwattr $C$DW$25, DW_AT_name("SelectADCCompBInput")
     365                            .dwattr $C$DW$25, DW_AT_TI_symbol_name("SelectADCCompBInput")
     366                            .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     367                            .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     368                            .dwattr $C$DW$25, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     369                            .dwattr $C$DW$25, DW_AT_decl_line(0x87)
     370                            .dwattr $C$DW$25, DW_AT_decl_column(0x25)
     371                    
     372                    $C$DW$26        .dwtag  DW_TAG_member
     373                            .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$59)
     374                            .dwattr $C$DW$26, DW_AT_name("SelectCompBRef")
     375                            .dwattr $C$DW$26, DW_AT_TI_symbol_name("SelectCompBRef")
     376                            .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     377                            .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     378                            .dwattr $C$DW$26, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\cc
     379                            .dwattr $C$DW$26, DW_AT_decl_line(0x88)
     380                            .dwattr $C$DW$26, DW_AT_decl_column(0x25)
     381                    
     382                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     383                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x75)
     384                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
TI ARM Assembler PC v16.9.8 Thu Nov 22 09:17:20 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{2774211C-A916-4652-B48E-C4C42D0C68A9} PAGE    8

     385                            .dwendtag $C$DW$T$60
     386                    
     387                    $C$DW$T$61      .dwtag  DW_TAG_typedef
     388                            .dwattr $C$DW$T$61, DW_AT_name("HARD_API_T")
     389                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
     390                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
     391                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     392                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x89)
     393                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x03)
     394                    
     395                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     396                            .dwattr $C$DW$T$2, DW_AT_name("void")
     397                    
     398                    
     399                    $C$DW$T$34      .dwtag  DW_TAG_subroutine_type
     400                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     401                            .dwendtag $C$DW$T$34
     402                    
     403                    $C$DW$T$35      .dwtag  DW_TAG_pointer_type
     404                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
     405                            .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
     406                    
     407                    $C$DW$T$53      .dwtag  DW_TAG_typedef
     408                            .dwattr $C$DW$T$53, DW_AT_name("FPTR_HFSOURCESAFESWITCH_T")
     409                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$35)
     410                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     411                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     412                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x5f)
     413                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x19)
     414                    
     415                    $C$DW$T$36      .dwtag  DW_TAG_typedef
     416                            .dwattr $C$DW$T$36, DW_AT_name("FPTR_RESETDEV_T")
     417                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
     418                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
     419                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:\ti\simplelink_cc13x0_sdk_2_30_00_20\source\ti\devices\
     420                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x4d)
     421                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x19)
     422                    
     423                    $C$DW$T$62      .dwtag  DW_TAG_typedef
     424                            .dwattr $C$DW$T$62, DW_AT_name("FPTR_VOID_VOID_T")
     425                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$35)
     426                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
