TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Sat Nov 24 22:21:57 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/mac_user_config.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\sensor_c
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    5532                            .dwattr $C$DW$470, DW_AT_decl_file("..\Application\mac_user_config.h")
    5533                            .dwattr $C$DW$470, DW_AT_decl_line(0x11d)
    5534                            .dwattr $C$DW$470, DW_AT_decl_column(0x05)
    5535                    
    5536                    $C$DW$471       .dwtag  DW_TAG_enumerator
    5537                            .dwattr $C$DW$471, DW_AT_name("MAC_RADIO_CC1352P")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  103

    5538                            .dwattr $C$DW$471, DW_AT_const_value(0x02)
    5539                            .dwattr $C$DW$471, DW_AT_decl_file("..\Application\mac_user_config.h")
    5540                            .dwattr $C$DW$471, DW_AT_decl_line(0x11e)
    5541                            .dwattr $C$DW$471, DW_AT_decl_column(0x05)
    5542                    
    5543                    $C$DW$472       .dwtag  DW_TAG_enumerator
    5544                            .dwattr $C$DW$472, DW_AT_name("MAC_RADIO_CCXXX2")
    5545                            .dwattr $C$DW$472, DW_AT_const_value(0x00)
    5546                            .dwattr $C$DW$472, DW_AT_decl_file("..\Application\mac_user_config.h")
    5547                            .dwattr $C$DW$472, DW_AT_decl_line(0x11f)
    5548                            .dwattr $C$DW$472, DW_AT_decl_column(0x05)
    5549                    
    5550                            .dwattr $C$DW$T$767, DW_AT_decl_file("..\Application\mac_user_config.h")
    5551                            .dwattr $C$DW$T$767, DW_AT_decl_line(0x118)
    5552                            .dwattr $C$DW$T$767, DW_AT_decl_column(0x01)
    5553                            .dwendtag $C$DW$T$767
    5554                    
    5555                    $C$DW$T$768     .dwtag  DW_TAG_typedef
    5556                            .dwattr $C$DW$T$768, DW_AT_name("macChipType_t")
    5557                            .dwattr $C$DW$T$768, DW_AT_type(*$C$DW$T$767)
    5558                            .dwattr $C$DW$T$768, DW_AT_language(DW_LANG_C)
    5559                            .dwattr $C$DW$T$768, DW_AT_decl_file("..\Application\mac_user_config.h")
    5560                            .dwattr $C$DW$T$768, DW_AT_decl_line(0x120)
    5561                            .dwattr $C$DW$T$768, DW_AT_decl_column(0x03)
    5562                    
    5563                    
    5564                    $C$DW$T$769     .dwtag  DW_TAG_enumeration_type
    5565                            .dwattr $C$DW$T$769, DW_AT_byte_size(0x01)
    5566                    $C$DW$473       .dwtag  DW_TAG_enumerator
    5567                            .dwattr $C$DW$473, DW_AT_name("MAC_HW_REV_21")
    5568                            .dwattr $C$DW$473, DW_AT_const_value(0x00)
    5569                            .dwattr $C$DW$473, DW_AT_decl_file("..\Application\mac_user_config.h")
    5570                            .dwattr $C$DW$473, DW_AT_decl_line(0x125)
    5571                            .dwattr $C$DW$473, DW_AT_decl_column(0x05)
    5572                    
    5573                    $C$DW$474       .dwtag  DW_TAG_enumerator
    5574                            .dwattr $C$DW$474, DW_AT_name("MAC_HW_REV_20")
    5575                            .dwattr $C$DW$474, DW_AT_const_value(0x01)
    5576                            .dwattr $C$DW$474, DW_AT_decl_file("..\Application\mac_user_config.h")
    5577                            .dwattr $C$DW$474, DW_AT_decl_line(0x126)
    5578                            .dwattr $C$DW$474, DW_AT_decl_column(0x05)
    5579                    
    5580                    $C$DW$475       .dwtag  DW_TAG_enumerator
    5581                            .dwattr $C$DW$475, DW_AT_name("MAC_HW_MAX_REVS")
    5582                            .dwattr $C$DW$475, DW_AT_const_value(0x02)
    5583                            .dwattr $C$DW$475, DW_AT_decl_file("..\Application\mac_user_config.h")
    5584                            .dwattr $C$DW$475, DW_AT_decl_line(0x127)
    5585                            .dwattr $C$DW$475, DW_AT_decl_column(0x05)
    5586                    
    5587                            .dwattr $C$DW$T$769, DW_AT_decl_file("..\Application\mac_user_config.h")
    5588                            .dwattr $C$DW$T$769, DW_AT_decl_line(0x124)
    5589                            .dwattr $C$DW$T$769, DW_AT_decl_column(0x01)
    5590                            .dwendtag $C$DW$T$769
    5591                    
    5592                    $C$DW$T$770     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  104

    5593                            .dwattr $C$DW$T$770, DW_AT_name("macHwRevision_t")
    5594                            .dwattr $C$DW$T$770, DW_AT_type(*$C$DW$T$769)
    5595                            .dwattr $C$DW$T$770, DW_AT_language(DW_LANG_C)
    5596                            .dwattr $C$DW$T$770, DW_AT_decl_file("..\Application\mac_user_config.h")
    5597                            .dwattr $C$DW$T$770, DW_AT_decl_line(0x128)
    5598                            .dwattr $C$DW$T$770, DW_AT_decl_column(0x03)
    5599                    
    5600                    
    5601                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    5602                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x10)
    5603                    $C$DW$476       .dwtag  DW_TAG_member
    5604                            .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$19)
    5605                            .dwattr $C$DW$476, DW_AT_name("rfMode")
    5606                            .dwattr $C$DW$476, DW_AT_TI_symbol_name("rfMode")
    5607                            .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5608                            .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
    5609                            .dwattr $C$DW$476, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5610                            .dwattr $C$DW$476, DW_AT_decl_line(0x421)
    5611                            .dwattr $C$DW$476, DW_AT_decl_column(0x0d)
    5612                    
    5613                    $C$DW$477       .dwtag  DW_TAG_member
    5614                            .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$21)
    5615                            .dwattr $C$DW$477, DW_AT_name("cpePatchFxn")
    5616                            .dwattr $C$DW$477, DW_AT_TI_symbol_name("cpePatchFxn")
    5617                            .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5618                            .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    5619                            .dwattr $C$DW$477, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5620                            .dwattr $C$DW$477, DW_AT_decl_line(0x422)
    5621                            .dwattr $C$DW$477, DW_AT_decl_column(0x0c)
    5622                    
    5623                    $C$DW$478       .dwtag  DW_TAG_member
    5624                            .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$21)
    5625                            .dwattr $C$DW$478, DW_AT_name("mcePatchFxn")
    5626                            .dwattr $C$DW$478, DW_AT_TI_symbol_name("mcePatchFxn")
    5627                            .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5628                            .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    5629                            .dwattr $C$DW$478, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5630                            .dwattr $C$DW$478, DW_AT_decl_line(0x423)
    5631                            .dwattr $C$DW$478, DW_AT_decl_column(0x0c)
    5632                    
    5633                    $C$DW$479       .dwtag  DW_TAG_member
    5634                            .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$21)
    5635                            .dwattr $C$DW$479, DW_AT_name("rfePatchFxn")
    5636                            .dwattr $C$DW$479, DW_AT_TI_symbol_name("rfePatchFxn")
    5637                            .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5638                            .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    5639                            .dwattr $C$DW$479, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    5640                            .dwattr $C$DW$479, DW_AT_decl_line(0x424)
    5641                            .dwattr $C$DW$479, DW_AT_decl_column(0x0c)
    5642                    
    5643                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5644                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x420)
    5645                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    5646                            .dwendtag $C$DW$T$22
    5647                    
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  105

    5648                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    5649                            .dwattr $C$DW$T$44, DW_AT_name("RF_Mode")
    5650                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$22)
    5651                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5652                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    5653                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x425)
    5654                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    5655                    
    5656                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    5657                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    5658                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    5659                    
    5660                    
    5661                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    5662                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    5663                    $C$DW$480       .dwtag  DW_TAG_member
    5664                            .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
    5665                            .dwattr $C$DW$480, DW_AT_name("triggerType")
    5666                            .dwattr $C$DW$480, DW_AT_TI_symbol_name("triggerType")
    5667                            .dwattr $C$DW$480, DW_AT_bit_offset(0x04)
    5668                            .dwattr $C$DW$480, DW_AT_bit_size(0x04)
    5669                            .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5670                            .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    5671                            .dwattr $C$DW$480, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5672                            .dwattr $C$DW$480, DW_AT_decl_line(0x7d)
    5673                            .dwattr $C$DW$480, DW_AT_decl_column(0x0f)
    5674                    
    5675                    $C$DW$481       .dwtag  DW_TAG_member
    5676                            .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$19)
    5677                            .dwattr $C$DW$481, DW_AT_name("bEnaCmd")
    5678                            .dwattr $C$DW$481, DW_AT_TI_symbol_name("bEnaCmd")
    5679                            .dwattr $C$DW$481, DW_AT_bit_offset(0x03)
    5680                            .dwattr $C$DW$481, DW_AT_bit_size(0x01)
    5681                            .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5682                            .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    5683                            .dwattr $C$DW$481, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5684                            .dwattr $C$DW$481, DW_AT_decl_line(0x7e)
    5685                            .dwattr $C$DW$481, DW_AT_decl_column(0x0f)
    5686                    
    5687                    $C$DW$482       .dwtag  DW_TAG_member
    5688                            .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$19)
    5689                            .dwattr $C$DW$482, DW_AT_name("triggerNo")
    5690                            .dwattr $C$DW$482, DW_AT_TI_symbol_name("triggerNo")
    5691                            .dwattr $C$DW$482, DW_AT_bit_offset(0x01)
    5692                            .dwattr $C$DW$482, DW_AT_bit_size(0x02)
    5693                            .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5694                            .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    5695                            .dwattr $C$DW$482, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5696                            .dwattr $C$DW$482, DW_AT_decl_line(0x80)
    5697                            .dwattr $C$DW$482, DW_AT_decl_column(0x0f)
    5698                    
    5699                    $C$DW$483       .dwtag  DW_TAG_member
    5700                            .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$19)
    5701                            .dwattr $C$DW$483, DW_AT_name("pastTrig")
    5702                            .dwattr $C$DW$483, DW_AT_TI_symbol_name("pastTrig")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  106

    5703                            .dwattr $C$DW$483, DW_AT_bit_offset(0x00)
    5704                            .dwattr $C$DW$483, DW_AT_bit_size(0x01)
    5705                            .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5706                            .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    5707                            .dwattr $C$DW$483, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5708                            .dwattr $C$DW$483, DW_AT_decl_line(0x81)
    5709                            .dwattr $C$DW$483, DW_AT_decl_column(0x0f)
    5710                    
    5711                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5712                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x7c)
    5713                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x0b)
    5714                            .dwendtag $C$DW$T$23
    5715                    
    5716                    
    5717                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5718                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    5719                    $C$DW$484       .dwtag  DW_TAG_member
    5720                            .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$19)
    5721                            .dwattr $C$DW$484, DW_AT_name("rule")
    5722                            .dwattr $C$DW$484, DW_AT_TI_symbol_name("rule")
    5723                            .dwattr $C$DW$484, DW_AT_bit_offset(0x04)
    5724                            .dwattr $C$DW$484, DW_AT_bit_size(0x04)
    5725                            .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5726                            .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    5727                            .dwattr $C$DW$484, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5728                            .dwattr $C$DW$484, DW_AT_decl_line(0x85)
    5729                            .dwattr $C$DW$484, DW_AT_decl_column(0x0f)
    5730                    
    5731                    $C$DW$485       .dwtag  DW_TAG_member
    5732                            .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$19)
    5733                            .dwattr $C$DW$485, DW_AT_name("nSkip")
    5734                            .dwattr $C$DW$485, DW_AT_TI_symbol_name("nSkip")
    5735                            .dwattr $C$DW$485, DW_AT_bit_offset(0x00)
    5736                            .dwattr $C$DW$485, DW_AT_bit_size(0x04)
    5737                            .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5738                            .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    5739                            .dwattr $C$DW$485, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5740                            .dwattr $C$DW$485, DW_AT_decl_line(0x86)
    5741                            .dwattr $C$DW$485, DW_AT_decl_column(0x0f)
    5742                    
    5743                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5744                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x84)
    5745                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x0b)
    5746                            .dwendtag $C$DW$T$24
    5747                    
    5748                    
    5749                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    5750                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    5751                    $C$DW$486       .dwtag  DW_TAG_member
    5752                            .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$19)
    5753                            .dwattr $C$DW$486, DW_AT_name("triggerType")
    5754                            .dwattr $C$DW$486, DW_AT_TI_symbol_name("triggerType")
    5755                            .dwattr $C$DW$486, DW_AT_bit_offset(0x04)
    5756                            .dwattr $C$DW$486, DW_AT_bit_size(0x04)
    5757                            .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  107

    5758                            .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    5759                            .dwattr $C$DW$486, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5760                            .dwattr $C$DW$486, DW_AT_decl_line(0xb3)
    5761                            .dwattr $C$DW$486, DW_AT_decl_column(0x0f)
    5762                    
    5763                    $C$DW$487       .dwtag  DW_TAG_member
    5764                            .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$19)
    5765                            .dwattr $C$DW$487, DW_AT_name("bEnaCmd")
    5766                            .dwattr $C$DW$487, DW_AT_TI_symbol_name("bEnaCmd")
    5767                            .dwattr $C$DW$487, DW_AT_bit_offset(0x03)
    5768                            .dwattr $C$DW$487, DW_AT_bit_size(0x01)
    5769                            .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5770                            .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    5771                            .dwattr $C$DW$487, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5772                            .dwattr $C$DW$487, DW_AT_decl_line(0xb4)
    5773                            .dwattr $C$DW$487, DW_AT_decl_column(0x0f)
    5774                    
    5775                    $C$DW$488       .dwtag  DW_TAG_member
    5776                            .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$19)
    5777                            .dwattr $C$DW$488, DW_AT_name("triggerNo")
    5778                            .dwattr $C$DW$488, DW_AT_TI_symbol_name("triggerNo")
    5779                            .dwattr $C$DW$488, DW_AT_bit_offset(0x01)
    5780                            .dwattr $C$DW$488, DW_AT_bit_size(0x02)
    5781                            .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5782                            .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    5783                            .dwattr $C$DW$488, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5784                            .dwattr $C$DW$488, DW_AT_decl_line(0xb6)
    5785                            .dwattr $C$DW$488, DW_AT_decl_column(0x0f)
    5786                    
    5787                    $C$DW$489       .dwtag  DW_TAG_member
    5788                            .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$19)
    5789                            .dwattr $C$DW$489, DW_AT_name("pastTrig")
    5790                            .dwattr $C$DW$489, DW_AT_TI_symbol_name("pastTrig")
    5791                            .dwattr $C$DW$489, DW_AT_bit_offset(0x00)
    5792                            .dwattr $C$DW$489, DW_AT_bit_size(0x01)
    5793                            .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5794                            .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    5795                            .dwattr $C$DW$489, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5796                            .dwattr $C$DW$489, DW_AT_decl_line(0xb7)
    5797                            .dwattr $C$DW$489, DW_AT_decl_column(0x0f)
    5798                    
    5799                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5800                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xb2)
    5801                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x0b)
    5802                            .dwendtag $C$DW$T$25
    5803                    
    5804                    
    5805                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    5806                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    5807                    $C$DW$490       .dwtag  DW_TAG_member
    5808                            .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$19)
    5809                            .dwattr $C$DW$490, DW_AT_name("rule")
    5810                            .dwattr $C$DW$490, DW_AT_TI_symbol_name("rule")
    5811                            .dwattr $C$DW$490, DW_AT_bit_offset(0x04)
    5812                            .dwattr $C$DW$490, DW_AT_bit_size(0x04)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  108

    5813                            .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5814                            .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    5815                            .dwattr $C$DW$490, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5816                            .dwattr $C$DW$490, DW_AT_decl_line(0xbb)
    5817                            .dwattr $C$DW$490, DW_AT_decl_column(0x0f)
    5818                    
    5819                    $C$DW$491       .dwtag  DW_TAG_member
    5820                            .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$19)
    5821                            .dwattr $C$DW$491, DW_AT_name("nSkip")
    5822                            .dwattr $C$DW$491, DW_AT_TI_symbol_name("nSkip")
    5823                            .dwattr $C$DW$491, DW_AT_bit_offset(0x00)
    5824                            .dwattr $C$DW$491, DW_AT_bit_size(0x04)
    5825                            .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5826                            .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    5827                            .dwattr $C$DW$491, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5828                            .dwattr $C$DW$491, DW_AT_decl_line(0xbc)
    5829                            .dwattr $C$DW$491, DW_AT_decl_column(0x0f)
    5830                    
    5831                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5832                            .dwattr $C$DW$T$26, DW_AT_decl_line(0xba)
    5833                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x0b)
    5834                            .dwendtag $C$DW$T$26
    5835                    
    5836                    
    5837                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5838                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    5839                    $C$DW$492       .dwtag  DW_TAG_member
    5840                            .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$27)
    5841                            .dwattr $C$DW$492, DW_AT_name("frontEndMode")
    5842                            .dwattr $C$DW$492, DW_AT_TI_symbol_name("frontEndMode")
    5843                            .dwattr $C$DW$492, DW_AT_bit_offset(0x0d)
    5844                            .dwattr $C$DW$492, DW_AT_bit_size(0x03)
    5845                            .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5846                            .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    5847                            .dwattr $C$DW$492, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5848                            .dwattr $C$DW$492, DW_AT_decl_line(0xc9)
    5849                            .dwattr $C$DW$492, DW_AT_decl_column(0x10)
    5850                    
    5851                    $C$DW$493       .dwtag  DW_TAG_member
    5852                            .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$27)
    5853                            .dwattr $C$DW$493, DW_AT_name("biasMode")
    5854                            .dwattr $C$DW$493, DW_AT_TI_symbol_name("biasMode")
    5855                            .dwattr $C$DW$493, DW_AT_bit_offset(0x0c)
    5856                            .dwattr $C$DW$493, DW_AT_bit_size(0x01)
    5857                            .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5858                            .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    5859                            .dwattr $C$DW$493, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5860                            .dwattr $C$DW$493, DW_AT_decl_line(0xcf)
    5861                            .dwattr $C$DW$493, DW_AT_decl_column(0x10)
    5862                    
    5863                    $C$DW$494       .dwtag  DW_TAG_member
    5864                            .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$27)
    5865                            .dwattr $C$DW$494, DW_AT_name("analogCfgMode")
    5866                            .dwattr $C$DW$494, DW_AT_TI_symbol_name("analogCfgMode")
    5867                            .dwattr $C$DW$494, DW_AT_bit_offset(0x06)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  109

    5868                            .dwattr $C$DW$494, DW_AT_bit_size(0x06)
    5869                            .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5870                            .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    5871                            .dwattr $C$DW$494, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5872                            .dwattr $C$DW$494, DW_AT_decl_line(0xd1)
    5873                            .dwattr $C$DW$494, DW_AT_decl_column(0x10)
    5874                    
    5875                    $C$DW$495       .dwtag  DW_TAG_member
    5876                            .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$27)
    5877                            .dwattr $C$DW$495, DW_AT_name("bNoFsPowerUp")
    5878                            .dwattr $C$DW$495, DW_AT_TI_symbol_name("bNoFsPowerUp")
    5879                            .dwattr $C$DW$495, DW_AT_bit_offset(0x05)
    5880                            .dwattr $C$DW$495, DW_AT_bit_size(0x01)
    5881                            .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5882                            .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    5883                            .dwattr $C$DW$495, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5884                            .dwattr $C$DW$495, DW_AT_decl_line(0xd8)
    5885                            .dwattr $C$DW$495, DW_AT_decl_column(0x10)
    5886                    
    5887                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5888                            .dwattr $C$DW$T$28, DW_AT_decl_line(0xc8)
    5889                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x0b)
    5890                            .dwendtag $C$DW$T$28
    5891                    
    5892                    
    5893                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5894                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    5895                    $C$DW$496       .dwtag  DW_TAG_member
    5896                            .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$19)
    5897                            .dwattr $C$DW$496, DW_AT_name("triggerType")
    5898                            .dwattr $C$DW$496, DW_AT_TI_symbol_name("triggerType")
    5899                            .dwattr $C$DW$496, DW_AT_bit_offset(0x04)
    5900                            .dwattr $C$DW$496, DW_AT_bit_size(0x04)
    5901                            .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5902                            .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    5903                            .dwattr $C$DW$496, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5904                            .dwattr $C$DW$496, DW_AT_decl_line(0x1cf)
    5905                            .dwattr $C$DW$496, DW_AT_decl_column(0x0f)
    5906                    
    5907                    $C$DW$497       .dwtag  DW_TAG_member
    5908                            .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$19)
    5909                            .dwattr $C$DW$497, DW_AT_name("bEnaCmd")
    5910                            .dwattr $C$DW$497, DW_AT_TI_symbol_name("bEnaCmd")
    5911                            .dwattr $C$DW$497, DW_AT_bit_offset(0x03)
    5912                            .dwattr $C$DW$497, DW_AT_bit_size(0x01)
    5913                            .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5914                            .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    5915                            .dwattr $C$DW$497, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5916                            .dwattr $C$DW$497, DW_AT_decl_line(0x1d0)
    5917                            .dwattr $C$DW$497, DW_AT_decl_column(0x0f)
    5918                    
    5919                    $C$DW$498       .dwtag  DW_TAG_member
    5920                            .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$19)
    5921                            .dwattr $C$DW$498, DW_AT_name("triggerNo")
    5922                            .dwattr $C$DW$498, DW_AT_TI_symbol_name("triggerNo")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  110

    5923                            .dwattr $C$DW$498, DW_AT_bit_offset(0x01)
    5924                            .dwattr $C$DW$498, DW_AT_bit_size(0x02)
    5925                            .dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5926                            .dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
    5927                            .dwattr $C$DW$498, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5928                            .dwattr $C$DW$498, DW_AT_decl_line(0x1d2)
    5929                            .dwattr $C$DW$498, DW_AT_decl_column(0x0f)
    5930                    
    5931                    $C$DW$499       .dwtag  DW_TAG_member
    5932                            .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$19)
    5933                            .dwattr $C$DW$499, DW_AT_name("pastTrig")
    5934                            .dwattr $C$DW$499, DW_AT_TI_symbol_name("pastTrig")
    5935                            .dwattr $C$DW$499, DW_AT_bit_offset(0x00)
    5936                            .dwattr $C$DW$499, DW_AT_bit_size(0x01)
    5937                            .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5938                            .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    5939                            .dwattr $C$DW$499, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5940                            .dwattr $C$DW$499, DW_AT_decl_line(0x1d3)
    5941                            .dwattr $C$DW$499, DW_AT_decl_column(0x0f)
    5942                    
    5943                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5944                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x1ce)
    5945                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x0b)
    5946                            .dwendtag $C$DW$T$29
    5947                    
    5948                    
    5949                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    5950                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    5951                    $C$DW$500       .dwtag  DW_TAG_member
    5952                            .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$19)
    5953                            .dwattr $C$DW$500, DW_AT_name("rule")
    5954                            .dwattr $C$DW$500, DW_AT_TI_symbol_name("rule")
    5955                            .dwattr $C$DW$500, DW_AT_bit_offset(0x04)
    5956                            .dwattr $C$DW$500, DW_AT_bit_size(0x04)
    5957                            .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5958                            .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    5959                            .dwattr $C$DW$500, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5960                            .dwattr $C$DW$500, DW_AT_decl_line(0x1d7)
    5961                            .dwattr $C$DW$500, DW_AT_decl_column(0x0f)
    5962                    
    5963                    $C$DW$501       .dwtag  DW_TAG_member
    5964                            .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$19)
    5965                            .dwattr $C$DW$501, DW_AT_name("nSkip")
    5966                            .dwattr $C$DW$501, DW_AT_TI_symbol_name("nSkip")
    5967                            .dwattr $C$DW$501, DW_AT_bit_offset(0x00)
    5968                            .dwattr $C$DW$501, DW_AT_bit_size(0x04)
    5969                            .dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5970                            .dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
    5971                            .dwattr $C$DW$501, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5972                            .dwattr $C$DW$501, DW_AT_decl_line(0x1d8)
    5973                            .dwattr $C$DW$501, DW_AT_decl_column(0x0f)
    5974                    
    5975                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    5976                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x1d6)
    5977                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  111

    5978                            .dwendtag $C$DW$T$30
    5979                    
    5980                    
    5981                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    5982                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    5983                    $C$DW$502       .dwtag  DW_TAG_member
    5984                            .dwattr $C$DW$502, DW_AT_type(*$C$DW$T$27)
    5985                            .dwattr $C$DW$502, DW_AT_name("modType")
    5986                            .dwattr $C$DW$502, DW_AT_TI_symbol_name("modType")
    5987                            .dwattr $C$DW$502, DW_AT_bit_offset(0x0d)
    5988                            .dwattr $C$DW$502, DW_AT_bit_size(0x03)
    5989                            .dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5990                            .dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
    5991                            .dwattr $C$DW$502, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    5992                            .dwattr $C$DW$502, DW_AT_decl_line(0x1db)
    5993                            .dwattr $C$DW$502, DW_AT_decl_column(0x10)
    5994                    
    5995                    $C$DW$503       .dwtag  DW_TAG_member
    5996                            .dwattr $C$DW$503, DW_AT_type(*$C$DW$T$27)
    5997                            .dwattr $C$DW$503, DW_AT_name("deviation")
    5998                            .dwattr $C$DW$503, DW_AT_TI_symbol_name("deviation")
    5999                            .dwattr $C$DW$503, DW_AT_bit_offset(0x00)
    6000                            .dwattr $C$DW$503, DW_AT_bit_size(0x0d)
    6001                            .dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6002                            .dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
    6003                            .dwattr $C$DW$503, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6004                            .dwattr $C$DW$503, DW_AT_decl_line(0x1de)
    6005                            .dwattr $C$DW$503, DW_AT_decl_column(0x10)
    6006                    
    6007                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6008                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x1da)
    6009                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x0b)
    6010                            .dwendtag $C$DW$T$31
    6011                    
    6012                    
    6013                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6014                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    6015                    $C$DW$504       .dwtag  DW_TAG_member
    6016                            .dwattr $C$DW$504, DW_AT_type(*$C$DW$T$32)
    6017                            .dwattr $C$DW$504, DW_AT_name("preScale")
    6018                            .dwattr $C$DW$504, DW_AT_TI_symbol_name("preScale")
    6019                            .dwattr $C$DW$504, DW_AT_bit_offset(0x1c)
    6020                            .dwattr $C$DW$504, DW_AT_bit_size(0x04)
    6021                            .dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6022                            .dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
    6023                            .dwattr $C$DW$504, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6024                            .dwattr $C$DW$504, DW_AT_decl_line(0x1e1)
    6025                            .dwattr $C$DW$504, DW_AT_decl_column(0x10)
    6026                    
    6027                    $C$DW$505       .dwtag  DW_TAG_member
    6028                            .dwattr $C$DW$505, DW_AT_type(*$C$DW$T$32)
    6029                            .dwattr $C$DW$505, DW_AT_name("rateWord")
    6030                            .dwattr $C$DW$505, DW_AT_TI_symbol_name("rateWord")
    6031                            .dwattr $C$DW$505, DW_AT_bit_offset(0x03)
    6032                            .dwattr $C$DW$505, DW_AT_bit_size(0x15)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  112

    6033                            .dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6034                            .dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
    6035                            .dwattr $C$DW$505, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6036                            .dwattr $C$DW$505, DW_AT_decl_line(0x1e3)
    6037                            .dwattr $C$DW$505, DW_AT_decl_column(0x10)
    6038                    
    6039                    $C$DW$506       .dwtag  DW_TAG_member
    6040                            .dwattr $C$DW$506, DW_AT_type(*$C$DW$T$32)
    6041                            .dwattr $C$DW$506, DW_AT_name("decimMode")
    6042                            .dwattr $C$DW$506, DW_AT_TI_symbol_name("decimMode")
    6043                            .dwattr $C$DW$506, DW_AT_bit_offset(0x00)
    6044                            .dwattr $C$DW$506, DW_AT_bit_size(0x03)
    6045                            .dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6046                            .dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
    6047                            .dwattr $C$DW$506, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6048                            .dwattr $C$DW$506, DW_AT_decl_line(0x1e4)
    6049                            .dwattr $C$DW$506, DW_AT_decl_column(0x10)
    6050                    
    6051                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6052                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x1e0)
    6053                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x0b)
    6054                            .dwendtag $C$DW$T$33
    6055                    
    6056                    
    6057                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6058                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    6059                    $C$DW$507       .dwtag  DW_TAG_member
    6060                            .dwattr $C$DW$507, DW_AT_type(*$C$DW$T$19)
    6061                            .dwattr $C$DW$507, DW_AT_name("nPreamBytes")
    6062                            .dwattr $C$DW$507, DW_AT_TI_symbol_name("nPreamBytes")
    6063                            .dwattr $C$DW$507, DW_AT_bit_offset(0x02)
    6064                            .dwattr $C$DW$507, DW_AT_bit_size(0x06)
    6065                            .dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6066                            .dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
    6067                            .dwattr $C$DW$507, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6068                            .dwattr $C$DW$507, DW_AT_decl_line(0x1ec)
    6069                            .dwattr $C$DW$507, DW_AT_decl_column(0x0f)
    6070                    
    6071                    $C$DW$508       .dwtag  DW_TAG_member
    6072                            .dwattr $C$DW$508, DW_AT_type(*$C$DW$T$19)
    6073                            .dwattr $C$DW$508, DW_AT_name("preamMode")
    6074                            .dwattr $C$DW$508, DW_AT_TI_symbol_name("preamMode")
    6075                            .dwattr $C$DW$508, DW_AT_bit_offset(0x00)
    6076                            .dwattr $C$DW$508, DW_AT_bit_size(0x02)
    6077                            .dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6078                            .dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
    6079                            .dwattr $C$DW$508, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6080                            .dwattr $C$DW$508, DW_AT_decl_line(0x1f2)
    6081                            .dwattr $C$DW$508, DW_AT_decl_column(0x0f)
    6082                    
    6083                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6084                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x1eb)
    6085                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x0b)
    6086                            .dwendtag $C$DW$T$34
    6087                    
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  113

    6088                    
    6089                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    6090                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    6091                    $C$DW$509       .dwtag  DW_TAG_member
    6092                            .dwattr $C$DW$509, DW_AT_type(*$C$DW$T$27)
    6093                            .dwattr $C$DW$509, DW_AT_name("nSwBits")
    6094                            .dwattr $C$DW$509, DW_AT_TI_symbol_name("nSwBits")
    6095                            .dwattr $C$DW$509, DW_AT_bit_offset(0x0a)
    6096                            .dwattr $C$DW$509, DW_AT_bit_size(0x06)
    6097                            .dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6098                            .dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
    6099                            .dwattr $C$DW$509, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6100                            .dwattr $C$DW$509, DW_AT_decl_line(0x1f8)
    6101                            .dwattr $C$DW$509, DW_AT_decl_column(0x10)
    6102                    
    6103                    $C$DW$510       .dwtag  DW_TAG_member
    6104                            .dwattr $C$DW$510, DW_AT_type(*$C$DW$T$27)
    6105                            .dwattr $C$DW$510, DW_AT_name("bBitReversal")
    6106                            .dwattr $C$DW$510, DW_AT_TI_symbol_name("bBitReversal")
    6107                            .dwattr $C$DW$510, DW_AT_bit_offset(0x09)
    6108                            .dwattr $C$DW$510, DW_AT_bit_size(0x01)
    6109                            .dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6110                            .dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
    6111                            .dwattr $C$DW$510, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6112                            .dwattr $C$DW$510, DW_AT_decl_line(0x1f9)
    6113                            .dwattr $C$DW$510, DW_AT_decl_column(0x10)
    6114                    
    6115                    $C$DW$511       .dwtag  DW_TAG_member
    6116                            .dwattr $C$DW$511, DW_AT_type(*$C$DW$T$27)
    6117                            .dwattr $C$DW$511, DW_AT_name("bMsbFirst")
    6118                            .dwattr $C$DW$511, DW_AT_TI_symbol_name("bMsbFirst")
    6119                            .dwattr $C$DW$511, DW_AT_bit_offset(0x08)
    6120                            .dwattr $C$DW$511, DW_AT_bit_size(0x01)
    6121                            .dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6122                            .dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
    6123                            .dwattr $C$DW$511, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6124                            .dwattr $C$DW$511, DW_AT_decl_line(0x1fb)
    6125                            .dwattr $C$DW$511, DW_AT_decl_column(0x10)
    6126                    
    6127                    $C$DW$512       .dwtag  DW_TAG_member
    6128                            .dwattr $C$DW$512, DW_AT_type(*$C$DW$T$27)
    6129                            .dwattr $C$DW$512, DW_AT_name("fecMode")
    6130                            .dwattr $C$DW$512, DW_AT_TI_symbol_name("fecMode")
    6131                            .dwattr $C$DW$512, DW_AT_bit_offset(0x04)
    6132                            .dwattr $C$DW$512, DW_AT_bit_size(0x04)
    6133                            .dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6134                            .dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
    6135                            .dwattr $C$DW$512, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6136                            .dwattr $C$DW$512, DW_AT_decl_line(0x1fd)
    6137                            .dwattr $C$DW$512, DW_AT_decl_column(0x10)
    6138                    
    6139                    $C$DW$513       .dwtag  DW_TAG_member
    6140                            .dwattr $C$DW$513, DW_AT_type(*$C$DW$T$27)
    6141                            .dwattr $C$DW$513, DW_AT_name("whitenMode")
    6142                            .dwattr $C$DW$513, DW_AT_TI_symbol_name("whitenMode")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  114

    6143                            .dwattr $C$DW$513, DW_AT_bit_offset(0x00)
    6144                            .dwattr $C$DW$513, DW_AT_bit_size(0x03)
    6145                            .dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6146                            .dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6147                            .dwattr $C$DW$513, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6148                            .dwattr $C$DW$513, DW_AT_decl_line(0x203)
    6149                            .dwattr $C$DW$513, DW_AT_decl_column(0x10)
    6150                    
    6151                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6152                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x1f7)
    6153                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x0b)
    6154                            .dwendtag $C$DW$T$35
    6155                    
    6156                    
    6157                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6158                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    6159                    $C$DW$514       .dwtag  DW_TAG_member
    6160                            .dwattr $C$DW$514, DW_AT_type(*$C$DW$T$27)
    6161                            .dwattr $C$DW$514, DW_AT_name("frontEndMode")
    6162                            .dwattr $C$DW$514, DW_AT_TI_symbol_name("frontEndMode")
    6163                            .dwattr $C$DW$514, DW_AT_bit_offset(0x0d)
    6164                            .dwattr $C$DW$514, DW_AT_bit_size(0x03)
    6165                            .dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6166                            .dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6167                            .dwattr $C$DW$514, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6168                            .dwattr $C$DW$514, DW_AT_decl_line(0x20d)
    6169                            .dwattr $C$DW$514, DW_AT_decl_column(0x10)
    6170                    
    6171                    $C$DW$515       .dwtag  DW_TAG_member
    6172                            .dwattr $C$DW$515, DW_AT_type(*$C$DW$T$27)
    6173                            .dwattr $C$DW$515, DW_AT_name("biasMode")
    6174                            .dwattr $C$DW$515, DW_AT_TI_symbol_name("biasMode")
    6175                            .dwattr $C$DW$515, DW_AT_bit_offset(0x0c)
    6176                            .dwattr $C$DW$515, DW_AT_bit_size(0x01)
    6177                            .dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6178                            .dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6179                            .dwattr $C$DW$515, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6180                            .dwattr $C$DW$515, DW_AT_decl_line(0x213)
    6181                            .dwattr $C$DW$515, DW_AT_decl_column(0x10)
    6182                    
    6183                    $C$DW$516       .dwtag  DW_TAG_member
    6184                            .dwattr $C$DW$516, DW_AT_type(*$C$DW$T$27)
    6185                            .dwattr $C$DW$516, DW_AT_name("analogCfgMode")
    6186                            .dwattr $C$DW$516, DW_AT_TI_symbol_name("analogCfgMode")
    6187                            .dwattr $C$DW$516, DW_AT_bit_offset(0x06)
    6188                            .dwattr $C$DW$516, DW_AT_bit_size(0x06)
    6189                            .dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6190                            .dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
    6191                            .dwattr $C$DW$516, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6192                            .dwattr $C$DW$516, DW_AT_decl_line(0x215)
    6193                            .dwattr $C$DW$516, DW_AT_decl_column(0x10)
    6194                    
    6195                    $C$DW$517       .dwtag  DW_TAG_member
    6196                            .dwattr $C$DW$517, DW_AT_type(*$C$DW$T$27)
    6197                            .dwattr $C$DW$517, DW_AT_name("bNoFsPowerUp")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  115

    6198                            .dwattr $C$DW$517, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6199                            .dwattr $C$DW$517, DW_AT_bit_offset(0x05)
    6200                            .dwattr $C$DW$517, DW_AT_bit_size(0x01)
    6201                            .dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6202                            .dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
    6203                            .dwattr $C$DW$517, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6204                            .dwattr $C$DW$517, DW_AT_decl_line(0x21c)
    6205                            .dwattr $C$DW$517, DW_AT_decl_column(0x10)
    6206                    
    6207                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6208                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x20c)
    6209                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x0b)
    6210                            .dwendtag $C$DW$T$36
    6211                    
    6212                    
    6213                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6214                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    6215                    $C$DW$518       .dwtag  DW_TAG_member
    6216                            .dwattr $C$DW$518, DW_AT_type(*$C$DW$T$19)
    6217                            .dwattr $C$DW$518, DW_AT_name("triggerType")
    6218                            .dwattr $C$DW$518, DW_AT_TI_symbol_name("triggerType")
    6219                            .dwattr $C$DW$518, DW_AT_bit_offset(0x04)
    6220                            .dwattr $C$DW$518, DW_AT_bit_size(0x04)
    6221                            .dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6222                            .dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
    6223                            .dwattr $C$DW$518, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6224                            .dwattr $C$DW$518, DW_AT_decl_line(0x232)
    6225                            .dwattr $C$DW$518, DW_AT_decl_column(0x0f)
    6226                    
    6227                    $C$DW$519       .dwtag  DW_TAG_member
    6228                            .dwattr $C$DW$519, DW_AT_type(*$C$DW$T$19)
    6229                            .dwattr $C$DW$519, DW_AT_name("bEnaCmd")
    6230                            .dwattr $C$DW$519, DW_AT_TI_symbol_name("bEnaCmd")
    6231                            .dwattr $C$DW$519, DW_AT_bit_offset(0x03)
    6232                            .dwattr $C$DW$519, DW_AT_bit_size(0x01)
    6233                            .dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6234                            .dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6235                            .dwattr $C$DW$519, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6236                            .dwattr $C$DW$519, DW_AT_decl_line(0x233)
    6237                            .dwattr $C$DW$519, DW_AT_decl_column(0x0f)
    6238                    
    6239                    $C$DW$520       .dwtag  DW_TAG_member
    6240                            .dwattr $C$DW$520, DW_AT_type(*$C$DW$T$19)
    6241                            .dwattr $C$DW$520, DW_AT_name("triggerNo")
    6242                            .dwattr $C$DW$520, DW_AT_TI_symbol_name("triggerNo")
    6243                            .dwattr $C$DW$520, DW_AT_bit_offset(0x01)
    6244                            .dwattr $C$DW$520, DW_AT_bit_size(0x02)
    6245                            .dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6246                            .dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6247                            .dwattr $C$DW$520, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6248                            .dwattr $C$DW$520, DW_AT_decl_line(0x235)
    6249                            .dwattr $C$DW$520, DW_AT_decl_column(0x0f)
    6250                    
    6251                    $C$DW$521       .dwtag  DW_TAG_member
    6252                            .dwattr $C$DW$521, DW_AT_type(*$C$DW$T$19)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  116

    6253                            .dwattr $C$DW$521, DW_AT_name("pastTrig")
    6254                            .dwattr $C$DW$521, DW_AT_TI_symbol_name("pastTrig")
    6255                            .dwattr $C$DW$521, DW_AT_bit_offset(0x00)
    6256                            .dwattr $C$DW$521, DW_AT_bit_size(0x01)
    6257                            .dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6258                            .dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6259                            .dwattr $C$DW$521, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6260                            .dwattr $C$DW$521, DW_AT_decl_line(0x236)
    6261                            .dwattr $C$DW$521, DW_AT_decl_column(0x0f)
    6262                    
    6263                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6264                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x231)
    6265                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x0b)
    6266                            .dwendtag $C$DW$T$37
    6267                    
    6268                    
    6269                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6270                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    6271                    $C$DW$522       .dwtag  DW_TAG_member
    6272                            .dwattr $C$DW$522, DW_AT_type(*$C$DW$T$19)
    6273                            .dwattr $C$DW$522, DW_AT_name("rule")
    6274                            .dwattr $C$DW$522, DW_AT_TI_symbol_name("rule")
    6275                            .dwattr $C$DW$522, DW_AT_bit_offset(0x04)
    6276                            .dwattr $C$DW$522, DW_AT_bit_size(0x04)
    6277                            .dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6278                            .dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
    6279                            .dwattr $C$DW$522, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6280                            .dwattr $C$DW$522, DW_AT_decl_line(0x23a)
    6281                            .dwattr $C$DW$522, DW_AT_decl_column(0x0f)
    6282                    
    6283                    $C$DW$523       .dwtag  DW_TAG_member
    6284                            .dwattr $C$DW$523, DW_AT_type(*$C$DW$T$19)
    6285                            .dwattr $C$DW$523, DW_AT_name("nSkip")
    6286                            .dwattr $C$DW$523, DW_AT_TI_symbol_name("nSkip")
    6287                            .dwattr $C$DW$523, DW_AT_bit_offset(0x00)
    6288                            .dwattr $C$DW$523, DW_AT_bit_size(0x04)
    6289                            .dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6290                            .dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6291                            .dwattr $C$DW$523, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6292                            .dwattr $C$DW$523, DW_AT_decl_line(0x23b)
    6293                            .dwattr $C$DW$523, DW_AT_decl_column(0x0f)
    6294                    
    6295                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6296                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x239)
    6297                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x0b)
    6298                            .dwendtag $C$DW$T$38
    6299                    
    6300                    
    6301                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6302                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    6303                    $C$DW$524       .dwtag  DW_TAG_member
    6304                            .dwattr $C$DW$524, DW_AT_type(*$C$DW$T$27)
    6305                            .dwattr $C$DW$524, DW_AT_name("modType")
    6306                            .dwattr $C$DW$524, DW_AT_TI_symbol_name("modType")
    6307                            .dwattr $C$DW$524, DW_AT_bit_offset(0x0d)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  117

    6308                            .dwattr $C$DW$524, DW_AT_bit_size(0x03)
    6309                            .dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6310                            .dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6311                            .dwattr $C$DW$524, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6312                            .dwattr $C$DW$524, DW_AT_decl_line(0x23e)
    6313                            .dwattr $C$DW$524, DW_AT_decl_column(0x10)
    6314                    
    6315                    $C$DW$525       .dwtag  DW_TAG_member
    6316                            .dwattr $C$DW$525, DW_AT_type(*$C$DW$T$27)
    6317                            .dwattr $C$DW$525, DW_AT_name("deviation")
    6318                            .dwattr $C$DW$525, DW_AT_TI_symbol_name("deviation")
    6319                            .dwattr $C$DW$525, DW_AT_bit_offset(0x00)
    6320                            .dwattr $C$DW$525, DW_AT_bit_size(0x0d)
    6321                            .dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6322                            .dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6323                            .dwattr $C$DW$525, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6324                            .dwattr $C$DW$525, DW_AT_decl_line(0x241)
    6325                            .dwattr $C$DW$525, DW_AT_decl_column(0x10)
    6326                    
    6327                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6328                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x23d)
    6329                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0b)
    6330                            .dwendtag $C$DW$T$39
    6331                    
    6332                    
    6333                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6334                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    6335                    $C$DW$526       .dwtag  DW_TAG_member
    6336                            .dwattr $C$DW$526, DW_AT_type(*$C$DW$T$32)
    6337                            .dwattr $C$DW$526, DW_AT_name("preScale")
    6338                            .dwattr $C$DW$526, DW_AT_TI_symbol_name("preScale")
    6339                            .dwattr $C$DW$526, DW_AT_bit_offset(0x1c)
    6340                            .dwattr $C$DW$526, DW_AT_bit_size(0x04)
    6341                            .dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6342                            .dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6343                            .dwattr $C$DW$526, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6344                            .dwattr $C$DW$526, DW_AT_decl_line(0x244)
    6345                            .dwattr $C$DW$526, DW_AT_decl_column(0x10)
    6346                    
    6347                    $C$DW$527       .dwtag  DW_TAG_member
    6348                            .dwattr $C$DW$527, DW_AT_type(*$C$DW$T$32)
    6349                            .dwattr $C$DW$527, DW_AT_name("rateWord")
    6350                            .dwattr $C$DW$527, DW_AT_TI_symbol_name("rateWord")
    6351                            .dwattr $C$DW$527, DW_AT_bit_offset(0x03)
    6352                            .dwattr $C$DW$527, DW_AT_bit_size(0x15)
    6353                            .dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6354                            .dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6355                            .dwattr $C$DW$527, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6356                            .dwattr $C$DW$527, DW_AT_decl_line(0x246)
    6357                            .dwattr $C$DW$527, DW_AT_decl_column(0x10)
    6358                    
    6359                    $C$DW$528       .dwtag  DW_TAG_member
    6360                            .dwattr $C$DW$528, DW_AT_type(*$C$DW$T$32)
    6361                            .dwattr $C$DW$528, DW_AT_name("decimMode")
    6362                            .dwattr $C$DW$528, DW_AT_TI_symbol_name("decimMode")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  118

    6363                            .dwattr $C$DW$528, DW_AT_bit_offset(0x00)
    6364                            .dwattr $C$DW$528, DW_AT_bit_size(0x03)
    6365                            .dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6366                            .dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6367                            .dwattr $C$DW$528, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6368                            .dwattr $C$DW$528, DW_AT_decl_line(0x247)
    6369                            .dwattr $C$DW$528, DW_AT_decl_column(0x10)
    6370                    
    6371                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6372                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x243)
    6373                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x0b)
    6374                            .dwendtag $C$DW$T$40
    6375                    
    6376                    
    6377                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6378                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    6379                    $C$DW$529       .dwtag  DW_TAG_member
    6380                            .dwattr $C$DW$529, DW_AT_type(*$C$DW$T$19)
    6381                            .dwattr $C$DW$529, DW_AT_name("nPreamBytes")
    6382                            .dwattr $C$DW$529, DW_AT_TI_symbol_name("nPreamBytes")
    6383                            .dwattr $C$DW$529, DW_AT_bit_offset(0x02)
    6384                            .dwattr $C$DW$529, DW_AT_bit_size(0x06)
    6385                            .dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6386                            .dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6387                            .dwattr $C$DW$529, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6388                            .dwattr $C$DW$529, DW_AT_decl_line(0x24f)
    6389                            .dwattr $C$DW$529, DW_AT_decl_column(0x0f)
    6390                    
    6391                    $C$DW$530       .dwtag  DW_TAG_member
    6392                            .dwattr $C$DW$530, DW_AT_type(*$C$DW$T$19)
    6393                            .dwattr $C$DW$530, DW_AT_name("preamMode")
    6394                            .dwattr $C$DW$530, DW_AT_TI_symbol_name("preamMode")
    6395                            .dwattr $C$DW$530, DW_AT_bit_offset(0x00)
    6396                            .dwattr $C$DW$530, DW_AT_bit_size(0x02)
    6397                            .dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6398                            .dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6399                            .dwattr $C$DW$530, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6400                            .dwattr $C$DW$530, DW_AT_decl_line(0x255)
    6401                            .dwattr $C$DW$530, DW_AT_decl_column(0x0f)
    6402                    
    6403                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6404                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x24e)
    6405                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x0b)
    6406                            .dwendtag $C$DW$T$41
    6407                    
    6408                    
    6409                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6410                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    6411                    $C$DW$531       .dwtag  DW_TAG_member
    6412                            .dwattr $C$DW$531, DW_AT_type(*$C$DW$T$27)
    6413                            .dwattr $C$DW$531, DW_AT_name("nSwBits")
    6414                            .dwattr $C$DW$531, DW_AT_TI_symbol_name("nSwBits")
    6415                            .dwattr $C$DW$531, DW_AT_bit_offset(0x0a)
    6416                            .dwattr $C$DW$531, DW_AT_bit_size(0x06)
    6417                            .dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  119

    6418                            .dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6419                            .dwattr $C$DW$531, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6420                            .dwattr $C$DW$531, DW_AT_decl_line(0x25b)
    6421                            .dwattr $C$DW$531, DW_AT_decl_column(0x10)
    6422                    
    6423                    $C$DW$532       .dwtag  DW_TAG_member
    6424                            .dwattr $C$DW$532, DW_AT_type(*$C$DW$T$27)
    6425                            .dwattr $C$DW$532, DW_AT_name("bBitReversal")
    6426                            .dwattr $C$DW$532, DW_AT_TI_symbol_name("bBitReversal")
    6427                            .dwattr $C$DW$532, DW_AT_bit_offset(0x09)
    6428                            .dwattr $C$DW$532, DW_AT_bit_size(0x01)
    6429                            .dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6430                            .dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6431                            .dwattr $C$DW$532, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6432                            .dwattr $C$DW$532, DW_AT_decl_line(0x25c)
    6433                            .dwattr $C$DW$532, DW_AT_decl_column(0x10)
    6434                    
    6435                    $C$DW$533       .dwtag  DW_TAG_member
    6436                            .dwattr $C$DW$533, DW_AT_type(*$C$DW$T$27)
    6437                            .dwattr $C$DW$533, DW_AT_name("bMsbFirst")
    6438                            .dwattr $C$DW$533, DW_AT_TI_symbol_name("bMsbFirst")
    6439                            .dwattr $C$DW$533, DW_AT_bit_offset(0x08)
    6440                            .dwattr $C$DW$533, DW_AT_bit_size(0x01)
    6441                            .dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6442                            .dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
    6443                            .dwattr $C$DW$533, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6444                            .dwattr $C$DW$533, DW_AT_decl_line(0x25e)
    6445                            .dwattr $C$DW$533, DW_AT_decl_column(0x10)
    6446                    
    6447                    $C$DW$534       .dwtag  DW_TAG_member
    6448                            .dwattr $C$DW$534, DW_AT_type(*$C$DW$T$27)
    6449                            .dwattr $C$DW$534, DW_AT_name("fecMode")
    6450                            .dwattr $C$DW$534, DW_AT_TI_symbol_name("fecMode")
    6451                            .dwattr $C$DW$534, DW_AT_bit_offset(0x04)
    6452                            .dwattr $C$DW$534, DW_AT_bit_size(0x04)
    6453                            .dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6454                            .dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6455                            .dwattr $C$DW$534, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6456                            .dwattr $C$DW$534, DW_AT_decl_line(0x260)
    6457                            .dwattr $C$DW$534, DW_AT_decl_column(0x10)
    6458                    
    6459                    $C$DW$535       .dwtag  DW_TAG_member
    6460                            .dwattr $C$DW$535, DW_AT_type(*$C$DW$T$27)
    6461                            .dwattr $C$DW$535, DW_AT_name("whitenMode")
    6462                            .dwattr $C$DW$535, DW_AT_TI_symbol_name("whitenMode")
    6463                            .dwattr $C$DW$535, DW_AT_bit_offset(0x00)
    6464                            .dwattr $C$DW$535, DW_AT_bit_size(0x03)
    6465                            .dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6466                            .dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6467                            .dwattr $C$DW$535, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6468                            .dwattr $C$DW$535, DW_AT_decl_line(0x266)
    6469                            .dwattr $C$DW$535, DW_AT_decl_column(0x10)
    6470                    
    6471                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6472                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x25a)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  120

    6473                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x0b)
    6474                            .dwendtag $C$DW$T$42
    6475                    
    6476                    
    6477                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6478                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    6479                    $C$DW$536       .dwtag  DW_TAG_member
    6480                            .dwattr $C$DW$536, DW_AT_type(*$C$DW$T$27)
    6481                            .dwattr $C$DW$536, DW_AT_name("frontEndMode")
    6482                            .dwattr $C$DW$536, DW_AT_TI_symbol_name("frontEndMode")
    6483                            .dwattr $C$DW$536, DW_AT_bit_offset(0x0d)
    6484                            .dwattr $C$DW$536, DW_AT_bit_size(0x03)
    6485                            .dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6486                            .dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6487                            .dwattr $C$DW$536, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6488                            .dwattr $C$DW$536, DW_AT_decl_line(0x270)
    6489                            .dwattr $C$DW$536, DW_AT_decl_column(0x10)
    6490                    
    6491                    $C$DW$537       .dwtag  DW_TAG_member
    6492                            .dwattr $C$DW$537, DW_AT_type(*$C$DW$T$27)
    6493                            .dwattr $C$DW$537, DW_AT_name("biasMode")
    6494                            .dwattr $C$DW$537, DW_AT_TI_symbol_name("biasMode")
    6495                            .dwattr $C$DW$537, DW_AT_bit_offset(0x0c)
    6496                            .dwattr $C$DW$537, DW_AT_bit_size(0x01)
    6497                            .dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6498                            .dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6499                            .dwattr $C$DW$537, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6500                            .dwattr $C$DW$537, DW_AT_decl_line(0x276)
    6501                            .dwattr $C$DW$537, DW_AT_decl_column(0x10)
    6502                    
    6503                    $C$DW$538       .dwtag  DW_TAG_member
    6504                            .dwattr $C$DW$538, DW_AT_type(*$C$DW$T$27)
    6505                            .dwattr $C$DW$538, DW_AT_name("analogCfgMode")
    6506                            .dwattr $C$DW$538, DW_AT_TI_symbol_name("analogCfgMode")
    6507                            .dwattr $C$DW$538, DW_AT_bit_offset(0x06)
    6508                            .dwattr $C$DW$538, DW_AT_bit_size(0x06)
    6509                            .dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6510                            .dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6511                            .dwattr $C$DW$538, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6512                            .dwattr $C$DW$538, DW_AT_decl_line(0x278)
    6513                            .dwattr $C$DW$538, DW_AT_decl_column(0x10)
    6514                    
    6515                    $C$DW$539       .dwtag  DW_TAG_member
    6516                            .dwattr $C$DW$539, DW_AT_type(*$C$DW$T$27)
    6517                            .dwattr $C$DW$539, DW_AT_name("bNoFsPowerUp")
    6518                            .dwattr $C$DW$539, DW_AT_TI_symbol_name("bNoFsPowerUp")
    6519                            .dwattr $C$DW$539, DW_AT_bit_offset(0x05)
    6520                            .dwattr $C$DW$539, DW_AT_bit_size(0x01)
    6521                            .dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6522                            .dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6523                            .dwattr $C$DW$539, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6524                            .dwattr $C$DW$539, DW_AT_decl_line(0x27f)
    6525                            .dwattr $C$DW$539, DW_AT_decl_column(0x10)
    6526                    
    6527                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  121

    6528                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x26f)
    6529                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x0b)
    6530                            .dwendtag $C$DW$T$43
    6531                    
    6532                    
    6533                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    6534                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x24)
    6535                    $C$DW$540       .dwtag  DW_TAG_member
    6536                            .dwattr $C$DW$540, DW_AT_type(*$C$DW$T$32)
    6537                            .dwattr $C$DW$540, DW_AT_name("nInactivityTimeout")
    6538                            .dwattr $C$DW$540, DW_AT_TI_symbol_name("nInactivityTimeout")
    6539                            .dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6540                            .dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6541                            .dwattr $C$DW$540, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6542                            .dwattr $C$DW$540, DW_AT_decl_line(0x515)
    6543                            .dwattr $C$DW$540, DW_AT_decl_column(0x1d)
    6544                    
    6545                    $C$DW$541       .dwtag  DW_TAG_member
    6546                            .dwattr $C$DW$541, DW_AT_type(*$C$DW$T$45)
    6547                            .dwattr $C$DW$541, DW_AT_name("pRfMode")
    6548                            .dwattr $C$DW$541, DW_AT_TI_symbol_name("pRfMode")
    6549                            .dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6550                            .dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6551                            .dwattr $C$DW$541, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6552                            .dwattr $C$DW$541, DW_AT_decl_line(0x516)
    6553                            .dwattr $C$DW$541, DW_AT_decl_column(0x1d)
    6554                    
    6555                    $C$DW$542       .dwtag  DW_TAG_member
    6556                            .dwattr $C$DW$542, DW_AT_type(*$C$DW$T$47)
    6557                            .dwattr $C$DW$542, DW_AT_name("pRadioSetup")
    6558                            .dwattr $C$DW$542, DW_AT_TI_symbol_name("pRadioSetup")
    6559                            .dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6560                            .dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6561                            .dwattr $C$DW$542, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6562                            .dwattr $C$DW$542, DW_AT_decl_line(0x517)
    6563                            .dwattr $C$DW$542, DW_AT_decl_column(0x1d)
    6564                    
    6565                    $C$DW$543       .dwtag  DW_TAG_member
    6566                            .dwattr $C$DW$543, DW_AT_type(*$C$DW$T$32)
    6567                            .dwattr $C$DW$543, DW_AT_name("nPowerUpDuration")
    6568                            .dwattr $C$DW$543, DW_AT_TI_symbol_name("nPowerUpDuration")
    6569                            .dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6570                            .dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6571                            .dwattr $C$DW$543, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6572                            .dwattr $C$DW$543, DW_AT_decl_line(0x518)
    6573                            .dwattr $C$DW$543, DW_AT_decl_column(0x1d)
    6574                    
    6575                    $C$DW$544       .dwtag  DW_TAG_member
    6576                            .dwattr $C$DW$544, DW_AT_type(*$C$DW$T$48)
    6577                            .dwattr $C$DW$544, DW_AT_name("bMeasurePowerUpDuration")
    6578                            .dwattr $C$DW$544, DW_AT_TI_symbol_name("bMeasurePowerUpDuration")
    6579                            .dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6580                            .dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6581                            .dwattr $C$DW$544, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6582                            .dwattr $C$DW$544, DW_AT_decl_line(0x519)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  122

    6583                            .dwattr $C$DW$544, DW_AT_decl_column(0x1d)
    6584                    
    6585                    $C$DW$545       .dwtag  DW_TAG_member
    6586                            .dwattr $C$DW$545, DW_AT_type(*$C$DW$T$48)
    6587                            .dwattr $C$DW$545, DW_AT_name("bUpdateSetup")
    6588                            .dwattr $C$DW$545, DW_AT_TI_symbol_name("bUpdateSetup")
    6589                            .dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6590                            .dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6591                            .dwattr $C$DW$545, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6592                            .dwattr $C$DW$545, DW_AT_decl_line(0x51a)
    6593                            .dwattr $C$DW$545, DW_AT_decl_column(0x1d)
    6594                    
    6595                    $C$DW$546       .dwtag  DW_TAG_member
    6596                            .dwattr $C$DW$546, DW_AT_type(*$C$DW$T$27)
    6597                            .dwattr $C$DW$546, DW_AT_name("nPowerUpDurationMargin")
    6598                            .dwattr $C$DW$546, DW_AT_TI_symbol_name("nPowerUpDurationMargin")
    6599                            .dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6600                            .dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6601                            .dwattr $C$DW$546, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6602                            .dwattr $C$DW$546, DW_AT_decl_line(0x51b)
    6603                            .dwattr $C$DW$546, DW_AT_decl_column(0x1d)
    6604                    
    6605                    $C$DW$547       .dwtag  DW_TAG_member
    6606                            .dwattr $C$DW$547, DW_AT_type(*$C$DW$T$3)
    6607                            .dwattr $C$DW$547, DW_AT_name("pPowerCb")
    6608                            .dwattr $C$DW$547, DW_AT_TI_symbol_name("pPowerCb")
    6609                            .dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6610                            .dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6611                            .dwattr $C$DW$547, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6612                            .dwattr $C$DW$547, DW_AT_decl_line(0x51c)
    6613                            .dwattr $C$DW$547, DW_AT_decl_column(0x1d)
    6614                    
    6615                    $C$DW$548       .dwtag  DW_TAG_member
    6616                            .dwattr $C$DW$548, DW_AT_type(*$C$DW$T$3)
    6617                            .dwattr $C$DW$548, DW_AT_name("pErrCb")
    6618                            .dwattr $C$DW$548, DW_AT_TI_symbol_name("pErrCb")
    6619                            .dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6620                            .dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
    6621                            .dwattr $C$DW$548, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6622                            .dwattr $C$DW$548, DW_AT_decl_line(0x51d)
    6623                            .dwattr $C$DW$548, DW_AT_decl_column(0x1d)
    6624                    
    6625                    $C$DW$549       .dwtag  DW_TAG_member
    6626                            .dwattr $C$DW$549, DW_AT_type(*$C$DW$T$3)
    6627                            .dwattr $C$DW$549, DW_AT_name("pClientEventCb")
    6628                            .dwattr $C$DW$549, DW_AT_TI_symbol_name("pClientEventCb")
    6629                            .dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6630                            .dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
    6631                            .dwattr $C$DW$549, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6632                            .dwattr $C$DW$549, DW_AT_decl_line(0x51e)
    6633                            .dwattr $C$DW$549, DW_AT_decl_column(0x1d)
    6634                    
    6635                    $C$DW$550       .dwtag  DW_TAG_member
    6636                            .dwattr $C$DW$550, DW_AT_type(*$C$DW$T$49)
    6637                            .dwattr $C$DW$550, DW_AT_name("nClientEventMask")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  123

    6638                            .dwattr $C$DW$550, DW_AT_TI_symbol_name("nClientEventMask")
    6639                            .dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6640                            .dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
    6641                            .dwattr $C$DW$550, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/r
    6642                            .dwattr $C$DW$550, DW_AT_decl_line(0x51f)
    6643                            .dwattr $C$DW$550, DW_AT_decl_column(0x1d)
    6644                    
    6645                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/drivers/
    6646                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x514)
    6647                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x0c)
    6648                            .dwendtag $C$DW$T$50
    6649                    
    6650                    
    6651                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    6652                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    6653                    $C$DW$551       .dwtag  DW_TAG_member
    6654                            .dwattr $C$DW$551, DW_AT_type(*$C$DW$T$19)
    6655                            .dwattr $C$DW$551, DW_AT_name("triggerType")
    6656                            .dwattr $C$DW$551, DW_AT_TI_symbol_name("triggerType")
    6657                            .dwattr $C$DW$551, DW_AT_bit_offset(0x04)
    6658                            .dwattr $C$DW$551, DW_AT_bit_size(0x04)
    6659                            .dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6660                            .dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
    6661                            .dwattr $C$DW$551, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6662                            .dwattr $C$DW$551, DW_AT_decl_line(0xee)
    6663                            .dwattr $C$DW$551, DW_AT_decl_column(0x0f)
    6664                    
    6665                    $C$DW$552       .dwtag  DW_TAG_member
    6666                            .dwattr $C$DW$552, DW_AT_type(*$C$DW$T$19)
    6667                            .dwattr $C$DW$552, DW_AT_name("bEnaCmd")
    6668                            .dwattr $C$DW$552, DW_AT_TI_symbol_name("bEnaCmd")
    6669                            .dwattr $C$DW$552, DW_AT_bit_offset(0x03)
    6670                            .dwattr $C$DW$552, DW_AT_bit_size(0x01)
    6671                            .dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6672                            .dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
    6673                            .dwattr $C$DW$552, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6674                            .dwattr $C$DW$552, DW_AT_decl_line(0xef)
    6675                            .dwattr $C$DW$552, DW_AT_decl_column(0x0f)
    6676                    
    6677                    $C$DW$553       .dwtag  DW_TAG_member
    6678                            .dwattr $C$DW$553, DW_AT_type(*$C$DW$T$19)
    6679                            .dwattr $C$DW$553, DW_AT_name("triggerNo")
    6680                            .dwattr $C$DW$553, DW_AT_TI_symbol_name("triggerNo")
    6681                            .dwattr $C$DW$553, DW_AT_bit_offset(0x01)
    6682                            .dwattr $C$DW$553, DW_AT_bit_size(0x02)
    6683                            .dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6684                            .dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
    6685                            .dwattr $C$DW$553, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6686                            .dwattr $C$DW$553, DW_AT_decl_line(0xf1)
    6687                            .dwattr $C$DW$553, DW_AT_decl_column(0x0f)
    6688                    
    6689                    $C$DW$554       .dwtag  DW_TAG_member
    6690                            .dwattr $C$DW$554, DW_AT_type(*$C$DW$T$19)
    6691                            .dwattr $C$DW$554, DW_AT_name("pastTrig")
    6692                            .dwattr $C$DW$554, DW_AT_TI_symbol_name("pastTrig")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{57C0F975-6337-4D1D-97E0-2618861D01FE} PAGE  124

    6693                            .dwattr $C$DW$554, DW_AT_bit_offset(0x00)
    6694                            .dwattr $C$DW$554, DW_AT_bit_size(0x01)
    6695                            .dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6696                            .dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
    6697                            .dwattr $C$DW$554, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/c
    6698                            .dwattr $C$DW$554, DW_AT_decl_line(0xf2)
    6699                            .dwattr $C$DW$554, DW_AT_decl_column(0x0f)
    6700                    
    6701                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/devices/
    6702                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xed)
    6703                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x0b)
    6704                            .dwendtag $C$DW$T$51
    6705                    
    6706                    
    6707                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    6708                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    6709                    $C$DW$555       .dwtag  DW_TAG_member
    6710                            .dwattr $C$DW$555, DW_AT_type(*$C$DW$T$19)
    6711                            .dwattr $C$DW$555, DW_AT_name("rule")
    6712                            .dwattr $C$DW$555, DW_AT_TI_symbol_name("rule")
    6713                            .dwattr $C$DW$555, DW_AT_bit_offset(0x04)
