TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                        PC v16.9.8.LTS *
       3                    ;* Date/Time created: Sat Nov 24 22:21:58 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Application/MAC/StartUp/macstack.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v16.9.8.LTS Copyright (c) 1996-20
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\Einstein\MyWorkspaceCC1350\sensor_cc1350lp\sensor_c
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    6365                            .dwattr $C$DW$643, DW_AT_decl_column(0x05)
    6366                    
    6367                    $C$DW$644       .dwtag  DW_TAG_enumerator
    6368                            .dwattr $C$DW$644, DW_AT_name("MAC_RADIO_CC1352P")
    6369                            .dwattr $C$DW$644, DW_AT_const_value(0x02)
    6370                            .dwattr $C$DW$644, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    6371                            .dwattr $C$DW$644, DW_AT_decl_line(0x11e)
    6372                            .dwattr $C$DW$644, DW_AT_decl_column(0x05)
    6373                    
    6374                    $C$DW$645       .dwtag  DW_TAG_enumerator
    6375                            .dwattr $C$DW$645, DW_AT_name("MAC_RADIO_CCXXX2")
    6376                            .dwattr $C$DW$645, DW_AT_const_value(0x00)
    6377                            .dwattr $C$DW$645, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    6378                            .dwattr $C$DW$645, DW_AT_decl_line(0x11f)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  117

    6379                            .dwattr $C$DW$645, DW_AT_decl_column(0x05)
    6380                    
    6381                            .dwattr $C$DW$T$1219, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/App
    6382                            .dwattr $C$DW$T$1219, DW_AT_decl_line(0x118)
    6383                            .dwattr $C$DW$T$1219, DW_AT_decl_column(0x01)
    6384                            .dwendtag $C$DW$T$1219
    6385                    
    6386                    $C$DW$T$1220    .dwtag  DW_TAG_typedef
    6387                            .dwattr $C$DW$T$1220, DW_AT_name("macChipType_t")
    6388                            .dwattr $C$DW$T$1220, DW_AT_type(*$C$DW$T$1219)
    6389                            .dwattr $C$DW$T$1220, DW_AT_language(DW_LANG_C)
    6390                            .dwattr $C$DW$T$1220, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/App
    6391                            .dwattr $C$DW$T$1220, DW_AT_decl_line(0x120)
    6392                            .dwattr $C$DW$T$1220, DW_AT_decl_column(0x03)
    6393                    
    6394                    
    6395                    $C$DW$T$1221    .dwtag  DW_TAG_enumeration_type
    6396                            .dwattr $C$DW$T$1221, DW_AT_byte_size(0x01)
    6397                    $C$DW$646       .dwtag  DW_TAG_enumerator
    6398                            .dwattr $C$DW$646, DW_AT_name("MAC_HW_REV_21")
    6399                            .dwattr $C$DW$646, DW_AT_const_value(0x00)
    6400                            .dwattr $C$DW$646, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    6401                            .dwattr $C$DW$646, DW_AT_decl_line(0x125)
    6402                            .dwattr $C$DW$646, DW_AT_decl_column(0x05)
    6403                    
    6404                    $C$DW$647       .dwtag  DW_TAG_enumerator
    6405                            .dwattr $C$DW$647, DW_AT_name("MAC_HW_REV_20")
    6406                            .dwattr $C$DW$647, DW_AT_const_value(0x01)
    6407                            .dwattr $C$DW$647, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    6408                            .dwattr $C$DW$647, DW_AT_decl_line(0x126)
    6409                            .dwattr $C$DW$647, DW_AT_decl_column(0x05)
    6410                    
    6411                    $C$DW$648       .dwtag  DW_TAG_enumerator
    6412                            .dwattr $C$DW$648, DW_AT_name("MAC_HW_MAX_REVS")
    6413                            .dwattr $C$DW$648, DW_AT_const_value(0x02)
    6414                            .dwattr $C$DW$648, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    6415                            .dwattr $C$DW$648, DW_AT_decl_line(0x127)
    6416                            .dwattr $C$DW$648, DW_AT_decl_column(0x05)
    6417                    
    6418                            .dwattr $C$DW$T$1221, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/App
    6419                            .dwattr $C$DW$T$1221, DW_AT_decl_line(0x124)
    6420                            .dwattr $C$DW$T$1221, DW_AT_decl_column(0x01)
    6421                            .dwendtag $C$DW$T$1221
    6422                    
    6423                    $C$DW$T$1222    .dwtag  DW_TAG_typedef
    6424                            .dwattr $C$DW$T$1222, DW_AT_name("macHwRevision_t")
    6425                            .dwattr $C$DW$T$1222, DW_AT_type(*$C$DW$T$1221)
    6426                            .dwattr $C$DW$T$1222, DW_AT_language(DW_LANG_C)
    6427                            .dwattr $C$DW$T$1222, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/App
    6428                            .dwattr $C$DW$T$1222, DW_AT_decl_line(0x128)
    6429                            .dwattr $C$DW$T$1222, DW_AT_decl_column(0x03)
    6430                    
    6431                    
    6432                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    6433                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  118

    6434                    $C$DW$649       .dwtag  DW_TAG_member
    6435                            .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$19)
    6436                            .dwattr $C$DW$649, DW_AT_name("event")
    6437                            .dwattr $C$DW$649, DW_AT_TI_symbol_name("event")
    6438                            .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6439                            .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6440                            .dwattr $C$DW$649, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6441                            .dwattr $C$DW$649, DW_AT_decl_line(0x2b6)
    6442                            .dwattr $C$DW$649, DW_AT_decl_column(0x0b)
    6443                    
    6444                    $C$DW$650       .dwtag  DW_TAG_member
    6445                            .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$19)
    6446                            .dwattr $C$DW$650, DW_AT_name("status")
    6447                            .dwattr $C$DW$650, DW_AT_TI_symbol_name("status")
    6448                            .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6449                            .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6450                            .dwattr $C$DW$650, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6451                            .dwattr $C$DW$650, DW_AT_decl_line(0x2b7)
    6452                            .dwattr $C$DW$650, DW_AT_decl_column(0x0b)
    6453                    
    6454                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6455                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2b5)
    6456                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x01)
    6457                            .dwendtag $C$DW$T$20
    6458                    
    6459                    $C$DW$T$35      .dwtag  DW_TAG_typedef
    6460                            .dwattr $C$DW$T$35, DW_AT_name("macEventHdr_t")
    6461                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$20)
    6462                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    6463                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6464                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x2b8)
    6465                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    6466                    
    6467                    
    6468                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    6469                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
    6470                    $C$DW$651       .dwtag  DW_TAG_member
    6471                            .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$549)
    6472                            .dwattr $C$DW$651, DW_AT_name("addr")
    6473                            .dwattr $C$DW$651, DW_AT_TI_symbol_name("addr")
    6474                            .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6475                            .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6476                            .dwattr $C$DW$651, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    6477                            .dwattr $C$DW$651, DW_AT_decl_line(0x4db)
    6478                            .dwattr $C$DW$651, DW_AT_decl_column(0x07)
    6479                    
    6480                    $C$DW$652       .dwtag  DW_TAG_member
    6481                            .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$22)
    6482                            .dwattr $C$DW$652, DW_AT_name("addrMode")
    6483                            .dwattr $C$DW$652, DW_AT_TI_symbol_name("addrMode")
    6484                            .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6485                            .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6486                            .dwattr $C$DW$652, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    6487                            .dwattr $C$DW$652, DW_AT_decl_line(0x4de)
    6488                            .dwattr $C$DW$652, DW_AT_decl_column(0x17)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  119

    6489                    
    6490                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    6491                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x4d0)
    6492                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x01)
    6493                            .dwendtag $C$DW$T$23
    6494                    
    6495                    $C$DW$T$801     .dwtag  DW_TAG_typedef
    6496                            .dwattr $C$DW$T$801, DW_AT_name("ApiMac_sAddr_t")
    6497                            .dwattr $C$DW$T$801, DW_AT_type(*$C$DW$T$23)
    6498                            .dwattr $C$DW$T$801, DW_AT_language(DW_LANG_C)
    6499                            .dwattr $C$DW$T$801, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appl
    6500                            .dwattr $C$DW$T$801, DW_AT_decl_line(0x4df)
    6501                            .dwattr $C$DW$T$801, DW_AT_decl_column(0x03)
    6502                    
    6503                    
    6504                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6505                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    6506                    $C$DW$653       .dwtag  DW_TAG_member
    6507                            .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$550)
    6508                            .dwattr $C$DW$653, DW_AT_name("addr")
    6509                            .dwattr $C$DW$653, DW_AT_TI_symbol_name("addr")
    6510                            .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6511                            .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6512                            .dwattr $C$DW$653, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    6513                            .dwattr $C$DW$653, DW_AT_decl_line(0x55)
    6514                            .dwattr $C$DW$653, DW_AT_decl_column(0x05)
    6515                    
    6516                    $C$DW$654       .dwtag  DW_TAG_member
    6517                            .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$24)
    6518                            .dwattr $C$DW$654, DW_AT_name("addrMode")
    6519                            .dwattr $C$DW$654, DW_AT_TI_symbol_name("addrMode")
    6520                            .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6521                            .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6522                            .dwattr $C$DW$654, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    6523                            .dwattr $C$DW$654, DW_AT_decl_line(0x56)
    6524                            .dwattr $C$DW$654, DW_AT_decl_column(0x13)
    6525                    
    6526                            .dwattr $C$DW$T$25, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    6527                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x50)
    6528                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    6529                            .dwendtag $C$DW$T$25
    6530                    
    6531                    $C$DW$T$26      .dwtag  DW_TAG_typedef
    6532                            .dwattr $C$DW$T$26, DW_AT_name("sAddr_t")
    6533                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    6534                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    6535                            .dwattr $C$DW$T$26, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    6536                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x57)
    6537                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x03)
    6538                    
    6539                    $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    6540                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$26)
    6541                            .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
    6542                    
    6543                    
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  120

    6544                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    6545                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x24)
    6546                    $C$DW$655       .dwtag  DW_TAG_member
    6547                            .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$26)
    6548                            .dwattr $C$DW$655, DW_AT_name("coordAddress")
    6549                            .dwattr $C$DW$655, DW_AT_TI_symbol_name("coordAddress")
    6550                            .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6551                            .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6552                            .dwattr $C$DW$655, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6553                            .dwattr $C$DW$655, DW_AT_decl_line(0x3e1)
    6554                            .dwattr $C$DW$655, DW_AT_decl_column(0x11)
    6555                    
    6556                    $C$DW$656       .dwtag  DW_TAG_member
    6557                            .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$27)
    6558                            .dwattr $C$DW$656, DW_AT_name("coordPanId")
    6559                            .dwattr $C$DW$656, DW_AT_TI_symbol_name("coordPanId")
    6560                            .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6561                            .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6562                            .dwattr $C$DW$656, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6563                            .dwattr $C$DW$656, DW_AT_decl_line(0x3e2)
    6564                            .dwattr $C$DW$656, DW_AT_decl_column(0x11)
    6565                    
    6566                    $C$DW$657       .dwtag  DW_TAG_member
    6567                            .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$27)
    6568                            .dwattr $C$DW$657, DW_AT_name("superframeSpec")
    6569                            .dwattr $C$DW$657, DW_AT_TI_symbol_name("superframeSpec")
    6570                            .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6571                            .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6572                            .dwattr $C$DW$657, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6573                            .dwattr $C$DW$657, DW_AT_decl_line(0x3e3)
    6574                            .dwattr $C$DW$657, DW_AT_decl_column(0x11)
    6575                    
    6576                    $C$DW$658       .dwtag  DW_TAG_member
    6577                            .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$19)
    6578                            .dwattr $C$DW$658, DW_AT_name("logicalChannel")
    6579                            .dwattr $C$DW$658, DW_AT_TI_symbol_name("logicalChannel")
    6580                            .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6581                            .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6582                            .dwattr $C$DW$658, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6583                            .dwattr $C$DW$658, DW_AT_decl_line(0x3e4)
    6584                            .dwattr $C$DW$658, DW_AT_decl_column(0x11)
    6585                    
    6586                    $C$DW$659       .dwtag  DW_TAG_member
    6587                            .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$19)
    6588                            .dwattr $C$DW$659, DW_AT_name("channelPage")
    6589                            .dwattr $C$DW$659, DW_AT_TI_symbol_name("channelPage")
    6590                            .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    6591                            .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6592                            .dwattr $C$DW$659, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6593                            .dwattr $C$DW$659, DW_AT_decl_line(0x3e5)
    6594                            .dwattr $C$DW$659, DW_AT_decl_column(0x11)
    6595                    
    6596                    $C$DW$660       .dwtag  DW_TAG_member
    6597                            .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$28)
    6598                            .dwattr $C$DW$660, DW_AT_name("gtsPermit")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  121

    6599                            .dwattr $C$DW$660, DW_AT_TI_symbol_name("gtsPermit")
    6600                            .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6601                            .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6602                            .dwattr $C$DW$660, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6603                            .dwattr $C$DW$660, DW_AT_decl_line(0x3e6)
    6604                            .dwattr $C$DW$660, DW_AT_decl_column(0x11)
    6605                    
    6606                    $C$DW$661       .dwtag  DW_TAG_member
    6607                            .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$19)
    6608                            .dwattr $C$DW$661, DW_AT_name("linkQuality")
    6609                            .dwattr $C$DW$661, DW_AT_TI_symbol_name("linkQuality")
    6610                            .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6611                            .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6612                            .dwattr $C$DW$661, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6613                            .dwattr $C$DW$661, DW_AT_decl_line(0x3e7)
    6614                            .dwattr $C$DW$661, DW_AT_decl_column(0x11)
    6615                    
    6616                    $C$DW$662       .dwtag  DW_TAG_member
    6617                            .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$29)
    6618                            .dwattr $C$DW$662, DW_AT_name("timestamp")
    6619                            .dwattr $C$DW$662, DW_AT_TI_symbol_name("timestamp")
    6620                            .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6621                            .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
    6622                            .dwattr $C$DW$662, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6623                            .dwattr $C$DW$662, DW_AT_decl_line(0x3e8)
    6624                            .dwattr $C$DW$662, DW_AT_decl_column(0x11)
    6625                    
    6626                    $C$DW$663       .dwtag  DW_TAG_member
    6627                            .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$28)
    6628                            .dwattr $C$DW$663, DW_AT_name("securityFailure")
    6629                            .dwattr $C$DW$663, DW_AT_TI_symbol_name("securityFailure")
    6630                            .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6631                            .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6632                            .dwattr $C$DW$663, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6633                            .dwattr $C$DW$663, DW_AT_decl_line(0x3e9)
    6634                            .dwattr $C$DW$663, DW_AT_decl_column(0x11)
    6635                    
    6636                    $C$DW$664       .dwtag  DW_TAG_member
    6637                            .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$30)
    6638                            .dwattr $C$DW$664, DW_AT_name("sec")
    6639                            .dwattr $C$DW$664, DW_AT_TI_symbol_name("sec")
    6640                            .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6641                            .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6642                            .dwattr $C$DW$664, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6643                            .dwattr $C$DW$664, DW_AT_decl_line(0x3ea)
    6644                            .dwattr $C$DW$664, DW_AT_decl_column(0x11)
    6645                    
    6646                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6647                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x3e0)
    6648                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
    6649                            .dwendtag $C$DW$T$31
    6650                    
    6651                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    6652                            .dwattr $C$DW$T$73, DW_AT_name("macPanDesc_t")
    6653                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$31)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  122

    6654                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    6655                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6656                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x3eb)
    6657                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    6658                    
    6659                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    6660                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    6661                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    6662                    
    6663                    
    6664                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6665                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x2c)
    6666                    $C$DW$665       .dwtag  DW_TAG_member
    6667                            .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$32)
    6668                            .dwattr $C$DW$665, DW_AT_name("scanChannels")
    6669                            .dwattr $C$DW$665, DW_AT_TI_symbol_name("scanChannels")
    6670                            .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6671                            .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6672                            .dwattr $C$DW$665, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6673                            .dwattr $C$DW$665, DW_AT_decl_line(0x421)
    6674                            .dwattr $C$DW$665, DW_AT_decl_column(0x14)
    6675                    
    6676                    $C$DW$666       .dwtag  DW_TAG_member
    6677                            .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$19)
    6678                            .dwattr $C$DW$666, DW_AT_name("scanType")
    6679                            .dwattr $C$DW$666, DW_AT_TI_symbol_name("scanType")
    6680                            .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    6681                            .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6682                            .dwattr $C$DW$666, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6683                            .dwattr $C$DW$666, DW_AT_decl_line(0x422)
    6684                            .dwattr $C$DW$666, DW_AT_decl_column(0x14)
    6685                    
    6686                    $C$DW$667       .dwtag  DW_TAG_member
    6687                            .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$19)
    6688                            .dwattr $C$DW$667, DW_AT_name("scanDuration")
    6689                            .dwattr $C$DW$667, DW_AT_TI_symbol_name("scanDuration")
    6690                            .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6691                            .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6692                            .dwattr $C$DW$667, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6693                            .dwattr $C$DW$667, DW_AT_decl_line(0x423)
    6694                            .dwattr $C$DW$667, DW_AT_decl_column(0x14)
    6695                    
    6696                    $C$DW$668       .dwtag  DW_TAG_member
    6697                            .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$19)
    6698                            .dwattr $C$DW$668, DW_AT_name("channelPage")
    6699                            .dwattr $C$DW$668, DW_AT_TI_symbol_name("channelPage")
    6700                            .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    6701                            .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6702                            .dwattr $C$DW$668, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6703                            .dwattr $C$DW$668, DW_AT_decl_line(0x424)
    6704                            .dwattr $C$DW$668, DW_AT_decl_column(0x14)
    6705                    
    6706                    $C$DW$669       .dwtag  DW_TAG_member
    6707                            .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$19)
    6708                            .dwattr $C$DW$669, DW_AT_name("phyID")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  123

    6709                            .dwattr $C$DW$669, DW_AT_TI_symbol_name("phyID")
    6710                            .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6711                            .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6712                            .dwattr $C$DW$669, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6713                            .dwattr $C$DW$669, DW_AT_decl_line(0x425)
    6714                            .dwattr $C$DW$669, DW_AT_decl_column(0x14)
    6715                    
    6716                    $C$DW$670       .dwtag  DW_TAG_member
    6717                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$19)
    6718                            .dwattr $C$DW$670, DW_AT_name("maxResults")
    6719                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("maxResults")
    6720                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    6721                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6722                            .dwattr $C$DW$670, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6723                            .dwattr $C$DW$670, DW_AT_decl_line(0x426)
    6724                            .dwattr $C$DW$670, DW_AT_decl_column(0x14)
    6725                    
    6726                    $C$DW$671       .dwtag  DW_TAG_member
    6727                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$28)
    6728                            .dwattr $C$DW$671, DW_AT_name("permitJoining")
    6729                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("permitJoining")
    6730                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6731                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6732                            .dwattr $C$DW$671, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6733                            .dwattr $C$DW$671, DW_AT_decl_line(0x427)
    6734                            .dwattr $C$DW$671, DW_AT_decl_column(0x14)
    6735                    
    6736                    $C$DW$672       .dwtag  DW_TAG_member
    6737                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$19)
    6738                            .dwattr $C$DW$672, DW_AT_name("linkQuality")
    6739                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("linkQuality")
    6740                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    6741                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6742                            .dwattr $C$DW$672, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6743                            .dwattr $C$DW$672, DW_AT_decl_line(0x429)
    6744                            .dwattr $C$DW$672, DW_AT_decl_column(0x14)
    6745                    
    6746                    $C$DW$673       .dwtag  DW_TAG_member
    6747                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$19)
    6748                            .dwattr $C$DW$673, DW_AT_name("percentFilter")
    6749                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("percentFilter")
    6750                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6751                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6752                            .dwattr $C$DW$673, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6753                            .dwattr $C$DW$673, DW_AT_decl_line(0x42b)
    6754                            .dwattr $C$DW$673, DW_AT_decl_column(0x14)
    6755                    
    6756                    $C$DW$674       .dwtag  DW_TAG_member
    6757                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$30)
    6758                            .dwattr $C$DW$674, DW_AT_name("sec")
    6759                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("sec")
    6760                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    6761                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    6762                            .dwattr $C$DW$674, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6763                            .dwattr $C$DW$674, DW_AT_decl_line(0x42e)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  124

    6764                            .dwattr $C$DW$674, DW_AT_decl_column(0x14)
    6765                    
    6766                    $C$DW$675       .dwtag  DW_TAG_member
    6767                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$28)
    6768                            .dwattr $C$DW$675, DW_AT_name("MPMScan")
    6769                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("MPMScan")
    6770                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6771                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    6772                            .dwattr $C$DW$675, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6773                            .dwattr $C$DW$675, DW_AT_decl_line(0x42f)
    6774                            .dwattr $C$DW$675, DW_AT_decl_column(0x14)
    6775                    
    6776                    $C$DW$676       .dwtag  DW_TAG_member
    6777                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$19)
    6778                            .dwattr $C$DW$676, DW_AT_name("MPMScanType")
    6779                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("MPMScanType")
    6780                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    6781                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    6782                            .dwattr $C$DW$676, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6783                            .dwattr $C$DW$676, DW_AT_decl_line(0x431)
    6784                            .dwattr $C$DW$676, DW_AT_decl_column(0x14)
    6785                    
    6786                    $C$DW$677       .dwtag  DW_TAG_member
    6787                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$27)
    6788                            .dwattr $C$DW$677, DW_AT_name("MPMScanDuration")
    6789                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("MPMScanDuration")
    6790                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    6791                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    6792                            .dwattr $C$DW$677, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6793                            .dwattr $C$DW$677, DW_AT_decl_line(0x432)
    6794                            .dwattr $C$DW$677, DW_AT_decl_column(0x14)
    6795                    
    6796                    $C$DW$678       .dwtag  DW_TAG_member
    6797                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$551)
    6798                            .dwattr $C$DW$678, DW_AT_name("result")
    6799                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("result")
    6800                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6801                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    6802                            .dwattr $C$DW$678, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6803                            .dwattr $C$DW$678, DW_AT_decl_line(0x440)
    6804                            .dwattr $C$DW$678, DW_AT_decl_column(0x05)
    6805                    
    6806                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6807                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x420)
    6808                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    6809                            .dwendtag $C$DW$T$33
    6810                    
    6811                    $C$DW$T$552     .dwtag  DW_TAG_typedef
    6812                            .dwattr $C$DW$T$552, DW_AT_name("macMlmeScanReq_t")
    6813                            .dwattr $C$DW$T$552, DW_AT_type(*$C$DW$T$33)
    6814                            .dwattr $C$DW$T$552, DW_AT_language(DW_LANG_C)
    6815                            .dwattr $C$DW$T$552, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6816                            .dwattr $C$DW$T$552, DW_AT_decl_line(0x441)
    6817                            .dwattr $C$DW$T$552, DW_AT_decl_column(0x03)
    6818                    
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  125

    6819                    
    6820                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    6821                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    6822                    $C$DW$679       .dwtag  DW_TAG_member
    6823                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$19)
    6824                            .dwattr $C$DW$679, DW_AT_name("msduHandle")
    6825                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("msduHandle")
    6826                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6827                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    6828                            .dwattr $C$DW$679, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6829                            .dwattr $C$DW$679, DW_AT_decl_line(0x160)
    6830                            .dwattr $C$DW$679, DW_AT_decl_column(0x1f)
    6831                    
    6832                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6833                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x15f)
    6834                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    6835                            .dwendtag $C$DW$T$34
    6836                    
    6837                    $C$DW$T$553     .dwtag  DW_TAG_typedef
    6838                            .dwattr $C$DW$T$553, DW_AT_name("macMcpsPurgeReq_t")
    6839                            .dwattr $C$DW$T$553, DW_AT_type(*$C$DW$T$34)
    6840                            .dwattr $C$DW$T$553, DW_AT_language(DW_LANG_C)
    6841                            .dwattr $C$DW$T$553, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6842                            .dwattr $C$DW$T$553, DW_AT_decl_line(0x161)
    6843                            .dwattr $C$DW$T$553, DW_AT_decl_column(0x03)
    6844                    
    6845                    
    6846                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    6847                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x38)
    6848                    $C$DW$680       .dwtag  DW_TAG_member
    6849                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$35)
    6850                            .dwattr $C$DW$680, DW_AT_name("hdr")
    6851                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("hdr")
    6852                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6853                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    6854                            .dwattr $C$DW$680, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6855                            .dwattr $C$DW$680, DW_AT_decl_line(0x167)
    6856                            .dwattr $C$DW$680, DW_AT_decl_column(0x1f)
    6857                    
    6858                    $C$DW$681       .dwtag  DW_TAG_member
    6859                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$554)
    6860                            .dwattr $C$DW$681, DW_AT_name("mac")
    6861                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("mac")
    6862                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6863                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    6864                            .dwattr $C$DW$681, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6865                            .dwattr $C$DW$681, DW_AT_decl_line(0x170)
    6866                            .dwattr $C$DW$681, DW_AT_decl_column(0x05)
    6867                    
    6868                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6869                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x166)
    6870                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    6871                            .dwendtag $C$DW$T$36
    6872                    
    6873                    $C$DW$T$562     .dwtag  DW_TAG_typedef
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  126

    6874                            .dwattr $C$DW$T$562, DW_AT_name("macApiEvent_t")
    6875                            .dwattr $C$DW$T$562, DW_AT_type(*$C$DW$T$36)
    6876                            .dwattr $C$DW$T$562, DW_AT_language(DW_LANG_C)
    6877                            .dwattr $C$DW$T$562, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154st
    6878                            .dwattr $C$DW$T$562, DW_AT_decl_line(0x171)
    6879                            .dwattr $C$DW$T$562, DW_AT_decl_column(0x03)
    6880                    
    6881                    
    6882                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6883                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    6884                    $C$DW$682       .dwtag  DW_TAG_member
    6885                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$37)
    6886                            .dwattr $C$DW$682, DW_AT_name("p")
    6887                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("p")
    6888                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6889                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    6890                            .dwattr $C$DW$682, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    6891                            .dwattr $C$DW$682, DW_AT_decl_line(0x3d)
    6892                            .dwattr $C$DW$682, DW_AT_decl_column(0x0e)
    6893                    
    6894                    $C$DW$683       .dwtag  DW_TAG_member
    6895                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$27)
    6896                            .dwattr $C$DW$683, DW_AT_name("len")
    6897                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("len")
    6898                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6899                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    6900                            .dwattr $C$DW$683, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Applic
    6901                            .dwattr $C$DW$683, DW_AT_decl_line(0x3e)
    6902                            .dwattr $C$DW$683, DW_AT_decl_column(0x0e)
    6903                    
    6904                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    6905                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x3c)
    6906                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    6907                            .dwendtag $C$DW$T$38
    6908                    
    6909                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    6910                            .dwattr $C$DW$T$59, DW_AT_name("sData_t")
    6911                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$38)
    6912                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    6913                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/Users/Einstein/MyWorkspaceCC1350/sensor_cc1350lp/Appli
    6914                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x3f)
    6915                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
    6916                    
    6917                    
    6918                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6919                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x0a)
    6920                    $C$DW$684       .dwtag  DW_TAG_member
    6921                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$39)
    6922                            .dwattr $C$DW$684, DW_AT_name("lookupData")
    6923                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("lookupData")
    6924                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6925                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    6926                            .dwattr $C$DW$684, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6927                            .dwattr $C$DW$684, DW_AT_decl_line(0x2c6)
    6928                            .dwattr $C$DW$684, DW_AT_decl_column(0x16)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  127

    6929                    
    6930                    $C$DW$685       .dwtag  DW_TAG_member
    6931                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$19)
    6932                            .dwattr $C$DW$685, DW_AT_name("lookupDataSize")
    6933                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("lookupDataSize")
    6934                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6935                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    6936                            .dwattr $C$DW$685, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6937                            .dwattr $C$DW$685, DW_AT_decl_line(0x2c7)
    6938                            .dwattr $C$DW$685, DW_AT_decl_column(0x16)
    6939                    
    6940                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6941                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x2c5)
    6942                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    6943                            .dwendtag $C$DW$T$40
    6944                    
    6945                    $C$DW$T$43      .dwtag  DW_TAG_typedef
    6946                            .dwattr $C$DW$T$43, DW_AT_name("keyIdLookupDescriptor_t")
    6947                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$40)
    6948                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    6949                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6950                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x2c8)
    6951                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x03)
    6952                    
    6953                    $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    6954                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    6955                            .dwattr $C$DW$T$44, DW_AT_address_class(0x20)
    6956                    
    6957                    
    6958                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    6959                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    6960                    $C$DW$686       .dwtag  DW_TAG_member
    6961                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$27)
    6962                            .dwattr $C$DW$686, DW_AT_name("deviceDescriptorHandle")
    6963                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("deviceDescriptorHandle")
    6964                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6965                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    6966                            .dwattr $C$DW$686, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6967                            .dwattr $C$DW$686, DW_AT_decl_line(0x2cd)
    6968                            .dwattr $C$DW$686, DW_AT_decl_column(0x16)
    6969                    
    6970                    $C$DW$687       .dwtag  DW_TAG_member
    6971                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$28)
    6972                            .dwattr $C$DW$687, DW_AT_name("uniqueDevice")
    6973                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("uniqueDevice")
    6974                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6975                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    6976                            .dwattr $C$DW$687, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6977                            .dwattr $C$DW$687, DW_AT_decl_line(0x2ce)
    6978                            .dwattr $C$DW$687, DW_AT_decl_column(0x16)
    6979                    
    6980                    $C$DW$688       .dwtag  DW_TAG_member
    6981                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$28)
    6982                            .dwattr $C$DW$688, DW_AT_name("blackListed")
    6983                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("blackListed")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  128

    6984                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6985                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    6986                            .dwattr $C$DW$688, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    6987                            .dwattr $C$DW$688, DW_AT_decl_line(0x2cf)
    6988                            .dwattr $C$DW$688, DW_AT_decl_column(0x16)
    6989                    
    6990                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    6991                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2cc)
    6992                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    6993                            .dwendtag $C$DW$T$41
    6994                    
    6995                    $C$DW$T$45      .dwtag  DW_TAG_typedef
    6996                            .dwattr $C$DW$T$45, DW_AT_name("keyDeviceDescriptor_t")
    6997                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$41)
    6998                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    6999                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7000                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2d0)
    7001                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x03)
    7002                    
    7003                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    7004                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    7005                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    7006                    
    7007                    
    7008                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    7009                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    7010                    $C$DW$689       .dwtag  DW_TAG_member
    7011                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$19)
    7012                            .dwattr $C$DW$689, DW_AT_name("frameType")
    7013                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("frameType")
    7014                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7015                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7016                            .dwattr $C$DW$689, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7017                            .dwattr $C$DW$689, DW_AT_decl_line(0x2d5)
    7018                            .dwattr $C$DW$689, DW_AT_decl_column(0x16)
    7019                    
    7020                    $C$DW$690       .dwtag  DW_TAG_member
    7021                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$19)
    7022                            .dwattr $C$DW$690, DW_AT_name("cmdFrameId")
    7023                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("cmdFrameId")
    7024                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7025                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7026                            .dwattr $C$DW$690, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7027                            .dwattr $C$DW$690, DW_AT_decl_line(0x2d6)
    7028                            .dwattr $C$DW$690, DW_AT_decl_column(0x16)
    7029                    
    7030                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7031                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x2d4)
    7032                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    7033                            .dwendtag $C$DW$T$42
    7034                    
    7035                    $C$DW$T$47      .dwtag  DW_TAG_typedef
    7036                            .dwattr $C$DW$T$47, DW_AT_name("keyUsageDescriptor_t")
    7037                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$42)
    7038                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  129

    7039                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7040                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2d7)
    7041                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
    7042                    
    7043                    $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    7044                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    7045                            .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    7046                    
    7047                    
    7048                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    7049                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x2c)
    7050                    $C$DW$691       .dwtag  DW_TAG_member
    7051                            .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$44)
    7052                            .dwattr $C$DW$691, DW_AT_name("keyIdLookupList")
    7053                            .dwattr $C$DW$691, DW_AT_TI_symbol_name("keyIdLookupList")
    7054                            .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7055                            .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7056                            .dwattr $C$DW$691, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7057                            .dwattr $C$DW$691, DW_AT_decl_line(0x2dc)
    7058                            .dwattr $C$DW$691, DW_AT_decl_column(0x1d)
    7059                    
    7060                    $C$DW$692       .dwtag  DW_TAG_member
    7061                            .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$19)
    7062                            .dwattr $C$DW$692, DW_AT_name("keyIdLookupEntries")
    7063                            .dwattr $C$DW$692, DW_AT_TI_symbol_name("keyIdLookupEntries")
    7064                            .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7065                            .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7066                            .dwattr $C$DW$692, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7067                            .dwattr $C$DW$692, DW_AT_decl_line(0x2dd)
    7068                            .dwattr $C$DW$692, DW_AT_decl_column(0x1c)
    7069                    
    7070                    $C$DW$693       .dwtag  DW_TAG_member
    7071                            .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$46)
    7072                            .dwattr $C$DW$693, DW_AT_name("keyDeviceList")
    7073                            .dwattr $C$DW$693, DW_AT_TI_symbol_name("keyDeviceList")
    7074                            .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7075                            .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7076                            .dwattr $C$DW$693, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7077                            .dwattr $C$DW$693, DW_AT_decl_line(0x2df)
    7078                            .dwattr $C$DW$693, DW_AT_decl_column(0x1d)
    7079                    
    7080                    $C$DW$694       .dwtag  DW_TAG_member
    7081                            .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$27)
    7082                            .dwattr $C$DW$694, DW_AT_name("keyDeviceListEntries")
    7083                            .dwattr $C$DW$694, DW_AT_TI_symbol_name("keyDeviceListEntries")
    7084                            .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7085                            .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7086                            .dwattr $C$DW$694, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7087                            .dwattr $C$DW$694, DW_AT_decl_line(0x2e2)
    7088                            .dwattr $C$DW$694, DW_AT_decl_column(0x1d)
    7089                    
    7090                    $C$DW$695       .dwtag  DW_TAG_member
    7091                            .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$48)
    7092                            .dwattr $C$DW$695, DW_AT_name("keyUsageList")
    7093                            .dwattr $C$DW$695, DW_AT_TI_symbol_name("keyUsageList")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  130

    7094                            .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7095                            .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7096                            .dwattr $C$DW$695, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7097                            .dwattr $C$DW$695, DW_AT_decl_line(0x2e4)
    7098                            .dwattr $C$DW$695, DW_AT_decl_column(0x1d)
    7099                    
    7100                    $C$DW$696       .dwtag  DW_TAG_member
    7101                            .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$19)
    7102                            .dwattr $C$DW$696, DW_AT_name("keyUsageListEntries")
    7103                            .dwattr $C$DW$696, DW_AT_TI_symbol_name("keyUsageListEntries")
    7104                            .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7105                            .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7106                            .dwattr $C$DW$696, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7107                            .dwattr $C$DW$696, DW_AT_decl_line(0x2e6)
    7108                            .dwattr $C$DW$696, DW_AT_decl_column(0x1c)
    7109                    
    7110                    $C$DW$697       .dwtag  DW_TAG_member
    7111                            .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$49)
    7112                            .dwattr $C$DW$697, DW_AT_name("key")
    7113                            .dwattr $C$DW$697, DW_AT_TI_symbol_name("key")
    7114                            .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7115                            .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7116                            .dwattr $C$DW$697, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7117                            .dwattr $C$DW$697, DW_AT_decl_line(0x2e8)
    7118                            .dwattr $C$DW$697, DW_AT_decl_column(0x1c)
    7119                    
    7120                    $C$DW$698       .dwtag  DW_TAG_member
    7121                            .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$29)
    7122                            .dwattr $C$DW$698, DW_AT_name("frameCounter")
    7123                            .dwattr $C$DW$698, DW_AT_TI_symbol_name("frameCounter")
    7124                            .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7125                            .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7126                            .dwattr $C$DW$698, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7127                            .dwattr $C$DW$698, DW_AT_decl_line(0x2e9)
    7128                            .dwattr $C$DW$698, DW_AT_decl_column(0x1c)
    7129                    
    7130                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7131                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2db)
    7132                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    7133                            .dwendtag $C$DW$T$50
    7134                    
    7135                    $C$DW$T$52      .dwtag  DW_TAG_typedef
    7136                            .dwattr $C$DW$T$52, DW_AT_name("keyDescriptor_t")
    7137                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$50)
    7138                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    7139                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7140                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x2ec)
    7141                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
    7142                    
    7143                    $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    7144                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    7145                            .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    7146                    
    7147                    
    7148                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  131

    7149                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x78)
    7150                    $C$DW$699       .dwtag  DW_TAG_member
    7151                            .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$29)
    7152                            .dwattr $C$DW$699, DW_AT_name("timestamp")
    7153                            .dwattr $C$DW$699, DW_AT_TI_symbol_name("timestamp")
    7154                            .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7155                            .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7156                            .dwattr $C$DW$699, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7157                            .dwattr $C$DW$699, DW_AT_decl_line(0x356)
    7158                            .dwattr $C$DW$699, DW_AT_decl_column(0x19)
    7159                    
    7160                    $C$DW$700       .dwtag  DW_TAG_member
    7161                            .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$27)
    7162                            .dwattr $C$DW$700, DW_AT_name("timestamp2")
    7163                            .dwattr $C$DW$700, DW_AT_TI_symbol_name("timestamp2")
    7164                            .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7165                            .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7166                            .dwattr $C$DW$700, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7167                            .dwattr $C$DW$700, DW_AT_decl_line(0x357)
    7168                            .dwattr $C$DW$700, DW_AT_decl_column(0x19)
    7169                    
    7170                    $C$DW$701       .dwtag  DW_TAG_member
    7171                            .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$27)
    7172                            .dwattr $C$DW$701, DW_AT_name("timeToLive")
    7173                            .dwattr $C$DW$701, DW_AT_TI_symbol_name("timeToLive")
    7174                            .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7175                            .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7176                            .dwattr $C$DW$701, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7177                            .dwattr $C$DW$701, DW_AT_decl_line(0x358)
    7178                            .dwattr $C$DW$701, DW_AT_decl_column(0x19)
    7179                    
    7180                    $C$DW$702       .dwtag  DW_TAG_member
    7181                            .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$19)
    7182                            .dwattr $C$DW$702, DW_AT_name("frameType")
    7183                            .dwattr $C$DW$702, DW_AT_TI_symbol_name("frameType")
    7184                            .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7185                            .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7186                            .dwattr $C$DW$702, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7187                            .dwattr $C$DW$702, DW_AT_decl_line(0x359)
    7188                            .dwattr $C$DW$702, DW_AT_decl_column(0x19)
    7189                    
    7190                    $C$DW$703       .dwtag  DW_TAG_member
    7191                            .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$27)
    7192                            .dwattr $C$DW$703, DW_AT_name("txOptions")
    7193                            .dwattr $C$DW$703, DW_AT_TI_symbol_name("txOptions")
    7194                            .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7195                            .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7196                            .dwattr $C$DW$703, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7197                            .dwattr $C$DW$703, DW_AT_decl_line(0x35a)
    7198                            .dwattr $C$DW$703, DW_AT_decl_column(0x19)
    7199                    
    7200                    $C$DW$704       .dwtag  DW_TAG_member
    7201                            .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$19)
    7202                            .dwattr $C$DW$704, DW_AT_name("txMode")
    7203                            .dwattr $C$DW$704, DW_AT_TI_symbol_name("txMode")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  132

    7204                            .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7205                            .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7206                            .dwattr $C$DW$704, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7207                            .dwattr $C$DW$704, DW_AT_decl_line(0x35b)
    7208                            .dwattr $C$DW$704, DW_AT_decl_column(0x19)
    7209                    
    7210                    $C$DW$705       .dwtag  DW_TAG_member
    7211                            .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$19)
    7212                            .dwattr $C$DW$705, DW_AT_name("txSched")
    7213                            .dwattr $C$DW$705, DW_AT_TI_symbol_name("txSched")
    7214                            .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    7215                            .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7216                            .dwattr $C$DW$705, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7217                            .dwattr $C$DW$705, DW_AT_decl_line(0x35c)
    7218                            .dwattr $C$DW$705, DW_AT_decl_column(0x19)
    7219                    
    7220                    $C$DW$706       .dwtag  DW_TAG_member
    7221                            .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$19)
    7222                            .dwattr $C$DW$706, DW_AT_name("retries")
    7223                            .dwattr $C$DW$706, DW_AT_TI_symbol_name("retries")
    7224                            .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7225                            .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7226                            .dwattr $C$DW$706, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7227                            .dwattr $C$DW$706, DW_AT_decl_line(0x35d)
    7228                            .dwattr $C$DW$706, DW_AT_decl_column(0x19)
    7229                    
    7230                    $C$DW$707       .dwtag  DW_TAG_member
    7231                            .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$19)
    7232                            .dwattr $C$DW$707, DW_AT_name("channel")
    7233                            .dwattr $C$DW$707, DW_AT_TI_symbol_name("channel")
    7234                            .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    7235                            .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7236                            .dwattr $C$DW$707, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7237                            .dwattr $C$DW$707, DW_AT_decl_line(0x35e)
    7238                            .dwattr $C$DW$707, DW_AT_decl_column(0x19)
    7239                    
    7240                    $C$DW$708       .dwtag  DW_TAG_member
    7241                            .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$19)
    7242                            .dwattr $C$DW$708, DW_AT_name("power")
    7243                            .dwattr $C$DW$708, DW_AT_TI_symbol_name("power")
    7244                            .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7245                            .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7246                            .dwattr $C$DW$708, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7247                            .dwattr $C$DW$708, DW_AT_decl_line(0x35f)
    7248                            .dwattr $C$DW$708, DW_AT_decl_column(0x19)
    7249                    
    7250                    $C$DW$709       .dwtag  DW_TAG_member
    7251                            .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$19)
    7252                            .dwattr $C$DW$709, DW_AT_name("mpduLinkQuality")
    7253                            .dwattr $C$DW$709, DW_AT_TI_symbol_name("mpduLinkQuality")
    7254                            .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    7255                            .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7256                            .dwattr $C$DW$709, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7257                            .dwattr $C$DW$709, DW_AT_decl_line(0x360)
    7258                            .dwattr $C$DW$709, DW_AT_decl_column(0x19)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  133

    7259                    
    7260                    $C$DW$710       .dwtag  DW_TAG_member
    7261                            .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$19)
    7262                            .dwattr $C$DW$710, DW_AT_name("correlation")
    7263                            .dwattr $C$DW$710, DW_AT_TI_symbol_name("correlation")
    7264                            .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7265                            .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7266                            .dwattr $C$DW$710, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7267                            .dwattr $C$DW$710, DW_AT_decl_line(0x361)
    7268                            .dwattr $C$DW$710, DW_AT_decl_column(0x19)
    7269                    
    7270                    $C$DW$711       .dwtag  DW_TAG_member
    7271                            .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$51)
    7272                            .dwattr $C$DW$711, DW_AT_name("rssi")
    7273                            .dwattr $C$DW$711, DW_AT_TI_symbol_name("rssi")
    7274                            .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    7275                            .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7276                            .dwattr $C$DW$711, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7277                            .dwattr $C$DW$711, DW_AT_decl_line(0x362)
    7278                            .dwattr $C$DW$711, DW_AT_decl_column(0x19)
    7279                    
    7280                    $C$DW$712       .dwtag  DW_TAG_member
    7281                            .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$37)
    7282                            .dwattr $C$DW$712, DW_AT_name("ptrMData")
    7283                            .dwattr $C$DW$712, DW_AT_TI_symbol_name("ptrMData")
    7284                            .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7285                            .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7286                            .dwattr $C$DW$712, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7287                            .dwattr $C$DW$712, DW_AT_decl_line(0x364)
    7288                            .dwattr $C$DW$712, DW_AT_decl_column(0x19)
    7289                    
    7290                    $C$DW$713       .dwtag  DW_TAG_member
    7291                            .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$53)
    7292                            .dwattr $C$DW$713, DW_AT_name("pKeyDesc")
    7293                            .dwattr $C$DW$713, DW_AT_TI_symbol_name("pKeyDesc")
    7294                            .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7295                            .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7296                            .dwattr $C$DW$713, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7297                            .dwattr $C$DW$713, DW_AT_decl_line(0x365)
    7298                            .dwattr $C$DW$713, DW_AT_decl_column(0x19)
    7299                    
    7300                    $C$DW$714       .dwtag  DW_TAG_member
    7301                            .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$29)
    7302                            .dwattr $C$DW$714, DW_AT_name("frameCntr")
    7303                            .dwattr $C$DW$714, DW_AT_TI_symbol_name("frameCntr")
    7304                            .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7305                            .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7306                            .dwattr $C$DW$714, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7307                            .dwattr $C$DW$714, DW_AT_decl_line(0x366)
    7308                            .dwattr $C$DW$714, DW_AT_decl_column(0x19)
    7309                    
    7310                    $C$DW$715       .dwtag  DW_TAG_member
    7311                            .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$55)
    7312                            .dwattr $C$DW$715, DW_AT_name("payloadIeInfo")
    7313                            .dwattr $C$DW$715, DW_AT_TI_symbol_name("payloadIeInfo")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  134

    7314                            .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7315                            .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7316                            .dwattr $C$DW$715, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7317                            .dwattr $C$DW$715, DW_AT_decl_line(0x368)
    7318                            .dwattr $C$DW$715, DW_AT_decl_column(0x19)
    7319                    
    7320                    $C$DW$716       .dwtag  DW_TAG_member
    7321                            .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$57)
    7322                            .dwattr $C$DW$716, DW_AT_name("headerIeInfo")
    7323                            .dwattr $C$DW$716, DW_AT_TI_symbol_name("headerIeInfo")
    7324                            .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    7325                            .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7326                            .dwattr $C$DW$716, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7327                            .dwattr $C$DW$716, DW_AT_decl_line(0x369)
    7328                            .dwattr $C$DW$716, DW_AT_decl_column(0x19)
    7329                    
    7330                    $C$DW$717       .dwtag  DW_TAG_member
    7331                            .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$27)
    7332                            .dwattr $C$DW$717, DW_AT_name("totalLen")
    7333                            .dwattr $C$DW$717, DW_AT_TI_symbol_name("totalLen")
    7334                            .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    7335                            .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7336                            .dwattr $C$DW$717, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7337                            .dwattr $C$DW$717, DW_AT_decl_line(0x36a)
    7338                            .dwattr $C$DW$717, DW_AT_decl_column(0x19)
    7339                    
    7340                    $C$DW$718       .dwtag  DW_TAG_member
    7341                            .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$37)
    7342                            .dwattr $C$DW$718, DW_AT_name("ptrHeaderIE")
    7343                            .dwattr $C$DW$718, DW_AT_TI_symbol_name("ptrHeaderIE")
    7344                            .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    7345                            .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7346                            .dwattr $C$DW$718, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7347                            .dwattr $C$DW$718, DW_AT_decl_line(0x36b)
    7348                            .dwattr $C$DW$718, DW_AT_decl_column(0x19)
    7349                    
    7350                    $C$DW$719       .dwtag  DW_TAG_member
    7351                            .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$27)
    7352                            .dwattr $C$DW$719, DW_AT_name("headerIesLen")
    7353                            .dwattr $C$DW$719, DW_AT_TI_symbol_name("headerIesLen")
    7354                            .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    7355                            .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    7356                            .dwattr $C$DW$719, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7357                            .dwattr $C$DW$719, DW_AT_decl_line(0x36c)
    7358                            .dwattr $C$DW$719, DW_AT_decl_column(0x19)
    7359                    
    7360                    $C$DW$720       .dwtag  DW_TAG_member
    7361                            .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$37)
    7362                            .dwattr $C$DW$720, DW_AT_name("ptrPayloadIE")
    7363                            .dwattr $C$DW$720, DW_AT_TI_symbol_name("ptrPayloadIE")
    7364                            .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    7365                            .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    7366                            .dwattr $C$DW$720, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7367                            .dwattr $C$DW$720, DW_AT_decl_line(0x36d)
    7368                            .dwattr $C$DW$720, DW_AT_decl_column(0x19)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  135

    7369                    
    7370                    $C$DW$721       .dwtag  DW_TAG_member
    7371                            .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$37)
    7372                            .dwattr $C$DW$721, DW_AT_name("ptrUTIE")
    7373                            .dwattr $C$DW$721, DW_AT_TI_symbol_name("ptrUTIE")
    7374                            .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    7375                            .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    7376                            .dwattr $C$DW$721, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7377                            .dwattr $C$DW$721, DW_AT_decl_line(0x36e)
    7378                            .dwattr $C$DW$721, DW_AT_decl_column(0x19)
    7379                    
    7380                    $C$DW$722       .dwtag  DW_TAG_member
    7381                            .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$37)
    7382                            .dwattr $C$DW$722, DW_AT_name("ptrBTIE")
    7383                            .dwattr $C$DW$722, DW_AT_TI_symbol_name("ptrBTIE")
    7384                            .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    7385                            .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    7386                            .dwattr $C$DW$722, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7387                            .dwattr $C$DW$722, DW_AT_decl_line(0x36f)
    7388                            .dwattr $C$DW$722, DW_AT_decl_column(0x19)
    7389                    
    7390                    $C$DW$723       .dwtag  DW_TAG_member
    7391                            .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$37)
    7392                            .dwattr $C$DW$723, DW_AT_name("ptrFrameCnt")
    7393                            .dwattr $C$DW$723, DW_AT_TI_symbol_name("ptrFrameCnt")
    7394                            .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    7395                            .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    7396                            .dwattr $C$DW$723, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7397                            .dwattr $C$DW$723, DW_AT_decl_line(0x370)
    7398                            .dwattr $C$DW$723, DW_AT_decl_column(0x19)
    7399                    
    7400                    $C$DW$724       .dwtag  DW_TAG_member
    7401                            .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$19)
    7402                            .dwattr $C$DW$724, DW_AT_name("rsl")
    7403                            .dwattr $C$DW$724, DW_AT_TI_symbol_name("rsl")
    7404                            .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    7405                            .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    7406                            .dwattr $C$DW$724, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7407                            .dwattr $C$DW$724, DW_AT_decl_line(0x371)
    7408                            .dwattr $C$DW$724, DW_AT_decl_column(0x19)
    7409                    
    7410                    $C$DW$725       .dwtag  DW_TAG_member
    7411                            .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$19)
    7412                            .dwattr $C$DW$725, DW_AT_name("nb")
    7413                            .dwattr $C$DW$725, DW_AT_TI_symbol_name("nb")
    7414                            .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0x5d]
    7415                            .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    7416                            .dwattr $C$DW$725, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7417                            .dwattr $C$DW$725, DW_AT_decl_line(0x372)
    7418                            .dwattr $C$DW$725, DW_AT_decl_column(0x19)
    7419                    
    7420                    $C$DW$726       .dwtag  DW_TAG_member
    7421                            .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$19)
    7422                            .dwattr $C$DW$726, DW_AT_name("be")
    7423                            .dwattr $C$DW$726, DW_AT_TI_symbol_name("be")
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  136

    7424                            .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    7425                            .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    7426                            .dwattr $C$DW$726, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7427                            .dwattr $C$DW$726, DW_AT_decl_line(0x373)
    7428                            .dwattr $C$DW$726, DW_AT_decl_column(0x19)
    7429                    
    7430                    $C$DW$727       .dwtag  DW_TAG_member
    7431                            .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$19)
    7432                            .dwattr $C$DW$727, DW_AT_name("fhFrameType")
    7433                            .dwattr $C$DW$727, DW_AT_TI_symbol_name("fhFrameType")
    7434                            .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x5f]
    7435                            .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    7436                            .dwattr $C$DW$727, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7437                            .dwattr $C$DW$727, DW_AT_decl_line(0x374)
    7438                            .dwattr $C$DW$727, DW_AT_decl_column(0x19)
    7439                    
    7440                    $C$DW$728       .dwtag  DW_TAG_member
    7441                            .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$19)
    7442                            .dwattr $C$DW$728, DW_AT_name("gpDuration")
    7443                            .dwattr $C$DW$728, DW_AT_TI_symbol_name("gpDuration")
    7444                            .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    7445                            .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    7446                            .dwattr $C$DW$728, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7447                            .dwattr $C$DW$728, DW_AT_decl_line(0x375)
    7448                            .dwattr $C$DW$728, DW_AT_decl_column(0x19)
    7449                    
    7450                    $C$DW$729       .dwtag  DW_TAG_member
    7451                            .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$19)
    7452                            .dwattr $C$DW$729, DW_AT_name("gpNumOfTx")
    7453                            .dwattr $C$DW$729, DW_AT_TI_symbol_name("gpNumOfTx")
    7454                            .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
    7455                            .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    7456                            .dwattr $C$DW$729, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7457                            .dwattr $C$DW$729, DW_AT_decl_line(0x376)
    7458                            .dwattr $C$DW$729, DW_AT_decl_column(0x19)
    7459                    
    7460                    $C$DW$730       .dwtag  DW_TAG_member
    7461                            .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$19)
    7462                            .dwattr $C$DW$730, DW_AT_name("gpInterframeDelay")
    7463                            .dwattr $C$DW$730, DW_AT_TI_symbol_name("gpInterframeDelay")
    7464                            .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    7465                            .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    7466                            .dwattr $C$DW$730, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7467                            .dwattr $C$DW$730, DW_AT_decl_line(0x377)
    7468                            .dwattr $C$DW$730, DW_AT_decl_column(0x19)
    7469                    
    7470                    $C$DW$731       .dwtag  DW_TAG_member
    7471                            .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$557)
    7472                            .dwattr $C$DW$731, DW_AT_name("dest")
    7473                            .dwattr $C$DW$731, DW_AT_TI_symbol_name("dest")
    7474                            .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    7475                            .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    7476                            .dwattr $C$DW$731, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7477                            .dwattr $C$DW$731, DW_AT_decl_line(0x37d)
    7478                            .dwattr $C$DW$731, DW_AT_decl_column(0x05)
TI ARM Assembler PC v16.9.8 Sat Nov 24 22:21:58 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
C:\Users\Einstein\AppData\Local\Temp\{29B91F12-1919-4635-840D-A4126ED80F3B} PAGE  137

    7479                    
    7480                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7481                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x355)
    7482                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    7483                            .dwendtag $C$DW$T$58
    7484                    
    7485                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    7486                            .dwattr $C$DW$T$60, DW_AT_name("macTxIntData_t")
    7487                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$58)
    7488                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    7489                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154sta
    7490                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x37e)
    7491                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    7492                    
    7493                    
    7494                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    7495                            .dwattr $C$DW$T$61, DW_AT_byte_size(0xa4)
    7496                    $C$DW$732       .dwtag  DW_TAG_member
    7497                            .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$35)
    7498                            .dwattr $C$DW$732, DW_AT_name("hdr")
    7499                            .dwattr $C$DW$732, DW_AT_TI_symbol_name("hdr")
    7500                            .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7501                            .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    7502                            .dwattr $C$DW$732, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7503                            .dwattr $C$DW$732, DW_AT_decl_line(0x150)
    7504                            .dwattr $C$DW$732, DW_AT_decl_column(0x1f)
    7505                    
    7506                    $C$DW$733       .dwtag  DW_TAG_member
    7507                            .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$59)
    7508                            .dwattr $C$DW$733, DW_AT_name("mpdu")
    7509                            .dwattr $C$DW$733, DW_AT_TI_symbol_name("mpdu")
    7510                            .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7511                            .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    7512                            .dwattr $C$DW$733, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7513                            .dwattr $C$DW$733, DW_AT_decl_line(0x151)
    7514                            .dwattr $C$DW$733, DW_AT_decl_column(0x1f)
    7515                    
    7516                    $C$DW$734       .dwtag  DW_TAG_member
    7517                            .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$60)
    7518                            .dwattr $C$DW$734, DW_AT_name("internal")
    7519                            .dwattr $C$DW$734, DW_AT_TI_symbol_name("internal")
    7520                            .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7521                            .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    7522                            .dwattr $C$DW$734, DW_AT_decl_file("C:/ti/simplelink_cc13x0_sdk_2_30_00_20/source/ti/ti154stac
    7523                            .dwattr $C$DW$734, DW_AT_decl_line(0x152)
    7524                            .dwattr $C$DW$734, DW_AT_decl_column(0x1f)
    7525                    
    7526                    $C$DW$735       .dwtag  DW_TAG_member
    7527                            .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$558)
    7528                            .dwattr $C$DW$735, DW_AT_name("mac")
    7529                            .dwattr $C$DW$735, DW_AT_TI_symbol_name("mac")
    7530                            .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    7531                            .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
